{ "category" : null,
  "colorCode" : "#023F6C",
  "displayName" : null,
  "feed" : [ { "category" : "INDIA",
        "colorCode" : "#E85137",
        "content" : "The Supreme Court on Thursday said that freedom of speech and expression cannot be “absolute” as it refused to reject criminal charges against an author for penning an alleged vulgar and obscene poem on Mahatma Gandhi in 1994. Putting vulgar and obscene words in the mouth of “historically respected personalities” like Gandhi cannot pass the “contemporary community standards test” meant to adjudge the obscenity of an alleged literary work, the apex court said. The observation came in a judgement by which the court quashed criminal charges against bank employee Devidas Ramchandra Tuljapurkar for publishing the “vulgar and obscene” poem on Gandhi in 1994 in an in-house magazine of which he was an editor. “Freedom of speech and expression has to be given a broad canvas, but it has to have inherent limitations which are permissible within the constitutional parameters. We have already opined that freedom of speech and expression as enshrined under Article 19(1)(a) of the Constitution is not absolute in view of Article 19(2) of the Constitution. “We reiterate the said right is a right of great value and transcends and with the passage of time and growth of culture, it has to pave the path of ascendancy, but it cannot be put in the compartment of absoluteness. There is constitutional limitation attached to it…,” a bench of justices Dipak Misra and P C Pant said. The bench noted that the publisher published the poem “Gandhi Mala Bhetala” in 1994 and “immediately” after coming to know its impact, he tendered unconditional apology in the next issue of the magazine. “Once he has tendered the unconditional apology even before the inception of the proceedings and almost more than two decades have passed, we are inclined to quash the charge framed against him as well as the printer. “We are disposed to quash the charge against the printer, as it is submitted that he had printed as desired by the publisher. Hence, they stand discharged,” the bench said. The apex court quashed the criminal proceedings against Tuljapurkar who had published the poem in a magazine ‘Bulletin’ for private circulation among the members of All India Bank Association Union. It, however, made it clear that it was not expressing any opinion on the charges framed against Marathi poet Vasant Dattatraya Gurjar, author of the poem, and it would be up to him to explain the “manner and the context” in which he used the words against Mahatma in the trial court.",
        "date" : "Thu May 14 11:04:16 GMT-05:00 2015",
        "description" : "\"Freedom of speech and expression has to be given a broad canvas, but it has to have inherent limitations, said SC.",
        "displayName" : "INDIA",
        "id" : "22258a3f-8191-44e0-b7c5-1a48dc8a685b",
        "image" : { "detail" : "<img class=\"size-full wp-image-2322405\" src=\"http://images.indianexpress.com/2015/03/supreme-court.jpg\" alt=\"Supreme Court of India\" width=\"759\" height=\"422\">",
            "sort" : "http://images.indianexpress.com/2015/03/supreme-court.jpg"
          },
        "link" : "http://indianexpress.com/article/india/india-others/freedom-of-speech-cannot-be-absolute-sc/",
        "order" : 1,
        "source" : "INDIAN EXPRESS",
        "title" : "Freedom of speech cannot be absolute: SC"
      },
      { "category" : "SOUTH_INDIA",
        "colorCode" : "#1387D5",
        "content" : "Special Public Prosecutor B.V. Acharya on Thursday recommended the Karnataka Government to file an appeal in the Supreme Court against the Karnataka High Court’s verdict of acquitting AIADMK General Secretary J. Jayalalithaa and three others in the disproportionate assets case. After going through the 919-page verdict for the past three days, Mr. Acharya has said that \"it is a fit case for appeal\" before the Apex Court. Karnataka High Court on May 11 had acquitted all the accused, holding that no evidence were available against them while setting aside the September 27, 2014 verdict of the Special Court, which had convicted and sentenced them to four years imprisonment.",
        "date" : "Thu May 14 09:55:10 GMT-05:00 2015",
        "description" : "Karnataka High Court on May 11 had acquitted all the accused in the disproportionate assets case.",
        "displayName" : "SOUTH INDIA",
        "id" : "ca3ecc7c-5a88-4399-8214-67c5635f7cae",
        "image" : { "detail" : "<img src=\"http://www.thehindu.com/multimedia/dynamic/02402/B_V__ACHARYA_2402876f.jpg\" class=\"main-image\" alt=\"Special Public Prosecutor B.V. Acharya File photo\" width=\"636\" height=\"423\" title=\"Special Public Prosecutor B.V. Acharya File photo\">",
            "sort" : "http://www.thehindu.com/multimedia/dynamic/02402/B_V__ACHARYA_2402876f.jpg"
          },
        "link" : "http://www.thehindu.com/news/national/tamil-nadu/approach-sc-in-jayalalithaa-case-spp-recommends-state/article7205929.ece?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "order" : 2,
        "source" : "THEHINDU",
        "title" : "Approach SC in Jayalalithaa case: SPP recommends State"
      },
      { "category" : "WORLD",
        "colorCode" : "#E49E1B",
        "content" : "LONDON: The economist who coined the terms BRICs to describe the world's leading emerging nations is turning his sights closer to home after he was appointed by British finance minister George Osborne to work for him. Former Goldman Sachs chief economist Jim O'Neill will be commercial secretary to the Treasury, a junior ministerial role which includes responsibility for boosting infrastructure and improving competition policy. He will also play a role in the government's push to devolve more powers to British cities and create more growth in the north of England to counterbalance the might of London, according to the text of a speech by Osborne on Thursday. Last year, O'Neill was put in charge of an international commission to investigate global antimicrobial resistance by British Prime Minister David Cameron. Manchester-born O'Neill chaired the Cities Growth Commission in Britain until October 2014. The commission's recommendations have influenced Osborne's thinking on devolution of powers to cities.",
        "date" : "Thu May 14 10:47:36 GMT-05:00 2015",
        "description" : "O'Neill was put in charge of an international commission to investigate global antimicrobial resistance by British Prime Minister David Cameron.",
        "displayName" : "WORLD",
        "id" : "33321282-1b43-4c0e-bd3b-1433c6fc59c7",
        "image" : { "detail" : "<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47287477,width-310,resizemode-4/ji.jpg\" alt=\"O'Neill was put in charge of an international commission to investigate global antimicrobial resistance by British Prime Minister David Cameron.\" title=\"O'Neill was put in charge of an international commission to investigate global antimicrobial resistance by British Prime Minister David Cameron.\">",
            "sort" : "http://economictimes.indiatimes.com/thumb/msid-47287477,width-310,resizemode-4/ji.jpg"
          },
        "link" : "http://economictimes.indiatimes.com/news/international/business/uk-names-brics-economist-jim-oneill-as-junior-finance-minister/articleshow/47287347.cms",
        "order" : 3,
        "source" : "THEECONOMICTIMES",
        "title" : "UK names BRICs economist Jim O'Neill as junior finance minister"
      },
      { "category" : "BUSINESS",
        "colorCode" : "#11C275",
        "content" : "Reserve Bank of India (RBI) today said it will soon come out with a new series of the currency notes as part of its constant endeavour to improve the security features of the currency bills. “So far, whatever forged notes we’ve seen and have been analysed, they have not breached our security features,” Reserve Bank Deputy Governor R Gandhi said today. Speaking to reporters after the RBI’s central board meeting here, Gandhi said the counterfeit notes, which have come to light, are similar only “by the look of it”, which may make it difficult for an ordinary person to detect them. “But, the paper, the security threads, other security features like the ink, they’ve not been breached. We’ve not seen that kind of forgery,” he added. Gandhi said the counterfeit notes, which have come to light, are similar only “by the look of it”, which may make it difficult for an ordinary person to detect them. (Reuters) However, he said, improving the security features of the bills is a constant endeavour for the central bank and it will soon be coming out with a new series of notes in consultation with the government. In the past, law enforcement agencies have expressed concern over counterfeiting menace, hinting that forgers are often able to produce the exact replica which makes detection difficult. For Updates Check Banking News; follow us on Facebook and Twitter First Published on May 14, 2015 9:32 pm",
        "date" : "Thu May 14 11:02:10 GMT-05:00 2015",
        "description" : "Reserve Bank of India (RBI) today said it will soon come out with a new series of the currency notes as part of its constant endeavour...",
        "displayName" : "BUSINESS",
        "id" : "926d84e0-69e9-4775-afe8-8d827283b79d",
        "image" : { "detail" : "<img class=\"size-full wp-image-72576\" src=\"http://images.financialexpress.com/2015/05/Raghuram-Rajan-PTI1.jpg\" alt=\"RBI currency notes\" width=\"780\" height=\"520\">",
            "sort" : "http://images.financialexpress.com/2015/05/Raghuram-Rajan-PTI1.jpg"
          },
        "link" : "http://www.financialexpress.com/article/industry/banking-finance/rbi-to-come-out-with-new-series-of-currency-notes-soon/72575/",
        "order" : 4,
        "source" : "FINANCIAL EXPRESS",
        "title" : "RBI to come out with new series of currency notes soon"
      },
      { "category" : "CRICKET",
        "colorCode" : "#9B090C",
        "content" : "Zimbabwe pulled out of this month's historic cricket tour to Pakistan and then retracted their decision within 16 minutes in a bizarre turnaround on Thursday. Zimbabwe Cricket initially released a statement saying that a decision had been reached not to tour on the advice of the country's supreme sports regulatory authority, the Sports and Recreation Commission (SRC). The SRC had previously cited concerns over the safety of the touring party. But after the news release was issued, the statement was withdrawn and Zimbabwe Cricket spokesman Lovemore Banda said that discussions are still on-going. \"At this time the tour has not been suspended. The executive and board of Zimbabwe Cricket are still in discussions,\" he said. Banda would not put a time frame on when a decision would be made, saying only that it would be announced \"as soon as the discussions are finalised\". Zimbabwe were due to be the first Test-playing nation to tour Pakistan since a 2009 gun attack on Sri Lanka's team bus in Lahore left seven players injured and eight Pakistanis dead.",
        "date" : "Thu May 14 10:42:17 GMT-05:00 2015",
        "description" : "Zimbabwe pulled out of this month's historic cricket tour to Pakistan and then retracted their decision within 16 minutes in a bizarre turnaround on Thursday.",
        "displayName" : "CRICKET",
        "id" : "cbf958bd-05ef-4f70-b8a5-9799fc4680c4",
        "image" : { "detail" : "<img class=\"imgwidth\" src=\"http://im.rediff.com/cricket/2015/apr/09pak.jpg\" alt=\"\" style=\"max-width:670px;*width:670px\" width=\"99%\">",
            "sort" : "http://im.rediff.com/cricket/2015/apr/09pak.jpg"
          },
        "link" : "http://www.rediff.com/cricket/report/zimbabwe-decision-to-quit-pakistan-cricket-tour-put-on-hold/20150514.htm",
        "order" : 5,
        "source" : "REDIFF",
        "title" : "Zimbabwe decision to quit Pakistan tour put on hold"
      },
      { "category" : "SPORTS",
        "colorCode" : "#965DB1",
        "content" : "Play 01:23 KP can feel aggrieved - Bell As the man who struck the six that sealed New Zealand's epic World Cup semi-final win over South Africa in March, Grant Elliott is no stranger to stressful situations. But even he was taken aback by the blizzard of headlines that have enveloped English cricket in the past 48 hours. \"You guys are pretty intense over here,\" he said at the launch of the Investec Test summer. \"I asked Belly, 'is it always like this?' He said, 'yeah, pretty much'.\" Ian Bell, separated from Elliot by compere Nasser Hussain, was visibly braced for impact. The most striking aspect of the morning came in the contrast between Bell's understandably guarded responses, and the utter relaxation of a New Zealand cricketer who, though he will not be featuring on this tour until the ODIs in June, is self-evidently qualified to speak for the mindset of his Test-playing team-mates. The afterglow of New Zealand's extraordinary and captivating World Cup has yet to wear off and Elliott spoke with an openness and enthusiasm that must surely be the envy of any England player who longs for a chance to be truly judged on the field. \"The cohesion and team environment we had could be seen through the television screen,\" Elliot said. \"But possibly the best accolade was having mums and dads come up to us, saying my son or daughter wants to play cricket next summer. It was great.\" Respect for your team-mates would have played its part too, which is presumably the underlying, and still unspoken reason, for Kevin Pietersen's blackballing from the England set-up. And yet Bell, who is part of the same management company, could shed no light on the dressing-room politics. \"I played ten years with Kevin, we both went through highs and lows, we won a lot of cricket together,\" Bell said. \"I enjoyed my time with him but it's very difficult to say anything. Kevin is a quality player, probably the best player I've ever played with so he does make any team stronger. But I haven't sat in on any of these meetings, I don't know what's been said between Colin Graves and Kevin, and Tom Harrison and Kevin, and Andrew Strauss and Kevin. \"It's no good us as players talking about that and there have been no conversations in the dressing room about any of this stuff.\" There's no use blaming the players for the situation that their management has created for them, but whatever way you try to spin it, it's not a good look for a sport that has rarely felt more distant from its public. As Elliott summed up, not without a degree of relish: \"It's complicated, isn't it?\" New Zealand shrugged off their internal politics long ago and throughout the World Cup, the connection between the New Zealand team and their fans was real and heartfelt, and stories abound to illustrate the warmth and the depth of that feeling - a primary school teacher in the Bay of Plenty won a bet (50 press-ups) with an incredulous Year Five student that, yes, she was in fact Trent Boult's girlfriend, and, yes, if the class behaved for the rest of the term she would ask him to visit. There's a significant difference in scale between England and New Zealand, of course - Elliott himself likened his home town, Wellington, to a \"fishing village\" - but the ECB can but dream of creating such a seamless connection between its team and its public. Play 01:53 'We're not good enough to leave out anyone' - Hussain To that end, Matt Dwyer, formerly of Cricket Australia, has been appointed the ECB's new director of participation and growth. It is a vital role, in spite of the lumpiness of the title, but nothing compared to the impact that a liberated, exciting, free-spirited national team could create. More's the pity that, ten years ago, that's exactly what England had. Though only a rookie at the time, Bell was a member of the 2005 Ashes team that won over the country with every bit as much élan as Brendon McCullum's New Zealand have shown throughout their recent triumphs. \"I remember Michael Vaughan saying he'd rather lose to Australia by taking them on than sit there and lose by playing passive cricket,\" Bell said. \"I see this summer as similar, we are going to have to be brave, take the odd gamble here and there, and if we play good cricket, we can start changing people's opinions on the team and start getting people talking about cricket again, which is what we all play for. \"But we're certainly not in the place ideally that we'd like right now.\" Indeed. If England are embarking on a long-term project - and Andrew Strauss appeared to imply that a five-year rebuilding mission is on the cards - then the first Test at Lord's, now only seven days' away, is probably too soon to hope that England can exorcise the negativity and find a new thrilling brand of KP-free aggression. But they ought to expect some handy pointers on the merits, and otherwise, of all-out attack, as Elliott fully expects Brendon McCullum to stick to the gameplan that has served him well in all formats and all conditions. \"He's a bit of a maverick, he's risky, but it's great to be a part of that and you have to buy into it,\" he said. \"I know that the bowlers turn around and think 'where the hell are my fielders?', and they'll all be in the slips. But you can't help but be endeared to him and want to play for him. He's been an integral part of New Zealand's success.\" So too has the underlying recognition that cricket is only a game - as Elliott himself personified after booking New Zealand's place in the World Cup final. Again, with echoes England's endeavours in 2005, Elliott's first instinct was to offer a hand to his beaten opponent. \"I've got a perspective on the game now,\" Elliott said. \"That game could have gone any way, my middle pole could still be tumbling out of Eden Park. It's a game of sport, and it's about having that respect for your opponents.\" © ESPN Sports Media Ltd.",
        "date" : "Thu May 14 10:55:09 GMT-05:00 2015",
        "description" : "The most striking aspect of the Investec summer launch came in the contrast between Ian Bell's understandably guarded responses, and the utter relaxation of Grant Elliot, nevertheless taken aback by the headlines around English cricket in the past 48 hour",
        "displayName" : "SPORTS",
        "id" : "16b41ab6-08f0-438e-8bc6-6deb1f77239f",
        "image" : { "detail" : "<img class=\"espni-vid-thumb full\" src=\"http://a.espncdn.com/combiner/i?img=/media/motion/2015/0514/dm_150514_engvnz_pc_bellonkp/dm_150514_engvnz_pc_bellonkp.jpg?w=926&h=540\" alt=\"\">",
            "sort" : "http://a.espncdn.com/combiner/i?img=/media/motion/2015/0514/dm_150514_engvnz_pc_bellonkp/dm_150514_engvnz_pc_bellonkp.jpg?w=926&h=540"
          },
        "link" : "http://www.espncricinfo.com/england-v-new-zealand-2015/content/story/875671.html?CMP=OTC-RSS",
        "order" : 6,
        "source" : "ESPNCRICINFO",
        "title" : "NZ present settled side as Bell shows sympathy for Pietersen"
      },
      { "category" : "TECHNOLOGY",
        "colorCode" : "#3D9BDC",
        "content" : "WASHINGTON: You are more likely to become a celebrity if you were born between late December and March, a new study suggests. People's personalities tend to vary somewhat depending on the season in which they are born, and astrological signs may have developed as a useful system for remembering these patterns, according to researchers. Such seasonal effects may not be clear in individuals, but can be discerned through averaging personality traits across large cohorts born at the same time of year. Psychologists have known that certain personality traits tend to be associated with certain birth months. For example, people born in January and February tend to be more creative, and have a higher chance of being diagnosed with schizophrenia, than people born at any other time of year. And people born in odd-numbered months tend to be more extroverted than those born in even-numbered months. Traditional Western astrology uses elements (water, earth, air and fire), sign duality (bright/dark) and sign qualities (cardinal, mutable and fixed) to describe and categorise these effects. It considers late December through early March as a \"wet\" time of year, and connects wetness with creativity, for example. \"Fixed\" signs are said to be more stubborn and persistent than others, researchers said. Hamilton looked at a data set of 300 celebrities from the fields of politics, science, public service, literature, the arts and sports. He found that celebrities' birth dates tended to cluster at certain times of the year. 'Wet' signs were associated with more celebrities, as were signs classified as 'bright' and 'fixed'. \"Psychologists want to dismiss these astrological correlations, but there are seasonality effects that we have yet to explain,\" said researcher Mark Hamilton, a social scientist in the Communication Department at the University of Connecticut (UConn). Hamilton is not arguing that heavenly bodies are the true source of these effects; rather, astrological aspects are just useful tools, or heuristics, that help people remember the timing and patterns of nature. Hamilton is currently working with other researchers on an analysis of 85,000 celebrities dating from 3,000 BC to the present era. He said that the seasonality effect on celebrity appears to hold true even in this large data set stretching across millennia and cultures. The study was published in the journal Comprehensive Psychology.",
        "date" : "Thu May 14 10:44:43 GMT-05:00 2015",
        "description" : "You are more likely to become a celebrity if you were born between late December and March, a new study suggests.",
        "displayName" : "TECHNOLOGY",
        "id" : "69c988b2-7c02-4a8c-9d88-418f530f5dff",
        "image" : { "detail" : "<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Birth month influences personality traits: Study\" title=\"Birth month influences personality traits: Study\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47287352,width-300,resizemode-4/Lower-birth-weight.jpg\">",
            "sort" : "http://timesofindia.indiatimes.com/thumb/msid-47287352,width-300,resizemode-4/Lower-birth-weight.jpg"
          },
        "link" : "http://timesofindia.feedsportal.com/c/33039/f/533922/s/4650c36c/sc/28/l/0Ltimesofindia0Bindiatimes0N0Chome0Cscience0CBirth0Emonth0Einfluences0Epersonality0Etraits0EStudy0Carticleshow0C472873310Bcms/story01.htm",
        "order" : 7,
        "source" : "TimesOfIndia",
        "title" : "Birth month influences personality traits: Study"
      },
      { "category" : "CINEMA",
        "colorCode" : "#252084",
        "content" : "Actor Kunal Bakshi, best known for his roles in TV shows like “Meera”, “Ssshhhh…Phir Koi Hai” and “Bharat Ka Veer Putra – Maharana Pratap”, will next be seen playing the negative character of Hubahu in “Baal Veer”. “When I got the offer for ‘Baal Veer’, I said ‘yes’ without blinking an eye. It’s an amazing experience shooting with the children, and Dev Joshi (Baal Veer) is a very talented child,” Kunal said in a statement. Related Rachana Parulkar set to enjoy motherhood, on screen! 'Aahat' will increase horror quotient in genre: Shakti Anand Shweta Tiwari excited about first negative role in 'Baal Veer' “The makeup and costume of my character (Hubahu) is very creative. I hope the viewers will love my character,” he added. The story of “Baal Veer” revolves around a superhero and his endeavour to save ‘Parilok’ from evil spirits. The show is aired on SAB TV.",
        "date" : "Thu May 14 10:39:42 GMT-05:00 2015",
        "description" : "Kunal Bakshi will be seen playing the negative character of Hubahu in “Baal Veer”.",
        "displayName" : "CINEMA",
        "id" : "b32c7240-7c61-43df-b5ce-c0fb2693f6db",
        "image" : { "detail" : "<img class=\"size-full wp-image-2368668\" src=\"http://images.indianexpress.com/2015/05/kunal-bakshi-baal-veer-759.jpg\" alt=\"Kunal Bakshi, Baal Veer, Hubahu, Kunal bakshi Hubahu, Kunal hubahu, Kunal Bakshi Baal Veer, Kunal Baal Veer, Kunal Bakshi in Baal Veer, Meera, Ssshhhh Phir Koi Hai, Bharat Ka Veer Putra Maharana Pratap, Entertainment news\" width=\"759\" height=\"422\">",
            "sort" : "http://images.indianexpress.com/2015/05/kunal-bakshi-baal-veer-759.jpg"
          },
        "link" : "http://indianexpress.com/article/entertainment/television/kunal-bakshi-to-star-in-baal-veer/",
        "order" : 8,
        "source" : "INDIAN EXPRESS",
        "title" : "Kunal Bakshi to star in ‘Baal Veer’"
      },
      { "category" : "SOUTH_CINEMA",
        "colorCode" : "#1387D5",
        "content" : "Matrimony has snatched many a good actress. Some return after acrimonious breakups to play supporting roles. You forget a few who disappear into oblivion but miss a Simran or a Jyothika not only for their unquestionable talent but their pleasant on-screen presence. Jyothika has designed her destiny, be it personal or professional. ‘36 Vayadhinile’ is eagerly awaited, purely because her fans get an opportunity to see her perform again. She’ll not go on a signing spree, but await a film that befits her talent and impeccable image. I had accused Surya of snatching away a good actress. Thank you, but it was a mutual decision. I tied the knot when I was 27. There’s a time and age for everything, so got married and had kids. There was no thought of returning to films for at least five years. It was all planned. You quit at a high after winning accolades for ‘Vetaiyadu Vilayadu’ and ‘Mozhi’. Surya says he didn’t stop you from acting. That was entirely my call. We were waiting for his family’s approval which took more than a couple of years. If we had got the nod earlier I wouldn’t have done those films. Marriage was the first priority. Luckily, those films came during the wait. As an artiste it took me to a high but I was not going to postpone the wedding. I didn’t miss work. I had my first child before our first anniversary. So was it all worth giving up? To be frank every bit of motherhood is worth it. I was very comfortable being away from cinema. I wonder why. The expectations my return is generating makes me realise I’ve not acted for eight years. The time was spent watching my kids grow and I didn’t have time to breathe. I’m hyper by nature. I like to take them to all the classes and their outdoor activities. I don’t connect the word hyper with you. Has parenthood made you calm and composed? Well, hyper in the sense I don’t like to leave them with a maid. I want to do everything for them myself. That’s a way of spending maximum time with them. I’ve eased up now since my daughter is eight. I’m still doing it for my son. I have become very composed. Post marriage there’s a lot of giving, be it time or energy. Your priorities become the last. You don’t make what you want to eat. It’s always about what the family wants. That’s not a complaint. It’s a joy. Incidentally today’s Mother’s Day. Your mother pulled you out of school and put you in cinema which is strange. You only hear of parental opposition to joining cinema. I’m very proud of what she did. Opportunities come to everybody at some point of time. In my case it was early. I was being offered work when I was in high school. She said it was my choice but wanted me to get out and work. If I had studied it would have been another ten years. I’m proud because I took the right decision. I’d have been educated but how experienced in life I’d have been is a question mark. You probably wouldn’t have met Surya. Yes, I came to a strange city, learnt a new language and met Surya which is one of my biggest achievements. I’ve made a name for myself. Life has given me a balance. If the same happens to Diya and Dev I’d do likewise. A Punjabi girl who studied in Bombay and came to Madras -- it must have been a struggle initially. I was very young and still in the family cocoon so I held my mother’s hand. It was very fearful to step into the film industry where you’re the only female amongst a crowd of men. It was a new world but a great experience. My mother stuck around till she felt I was comfortable. She left me with a help and returned because I have a younger brother. Nagma, my sister too helped. You eventually reached a stage where you could recommend Surya to a director. (Laughs) We both started together. We were friends for a long time. That turning into love took five years. It just so happened that Gautam had signed me first for ‘Kakhkha Kakhkha’ and was looking for a hero. I mentioned Surya. He watched ‘Nanda’ and was impressed. It all fell in place. Do you regret the fact that you didn’t learn Tamil to dub your lines? Yes I do, and that’s with capital letters. There’s so much I want to convey even on shows. I’m facing the media after 16 years. I get self conscious using difficult words. It rolls in my mind in English and I translate into whatever Tamil I know. I keep asking Surya how I sounded. Conveying something should not sound like I’m preaching. Not dubbing has been a regret. I tried to dub for ‘36 Vayadhinile’. My dubbing was good but I didn’t sound like a middle-class Tamil girl. Accent is very important. Not knowing the language is a big minus. You’ve lost a lot of weight. You didn’t seem to bother during your heydays. That’s a state of mind with married women. It was not because I was making a comeback. You start aging fast after motherhood. You start looking different. I met the right people at the right time. My Yoga instructor Gayathri is very determined. I’ve been working out for the last six years. It was at a stage where I realised that I was married to Surya and couldn’t afford to look bloated. I’d put on thirty kilos. Once you start working out it’s an addiction. If you did want to make a comeback in a heroine centric role there was ‘Kahaani’ and ‘Queen’. Why did you choose this film? ‘Kahaani’ was offered to me two years ago when I wasn’t keen. The project didn’t seem to have a good team. They came to sign me first and nothing seemed right. ‘Queen’ wasn’t offered to me. This film too came when I wasn’t too keen. My son is just five but it’s the message. It blew me because I identified with the character. I wanted the film to reach a wider audience. Are you here to stay? I haven’t planned anything. I will do films if they’re better than ‘36 Vayadhinile’. I’m not here for money. I will not bargain my precious time with my kids for cinema. It has to be worth the time. Was revealing your age difficult? We wanted an age related title. Other than being feminist, the film is about being proud of your age. I’m proud of my age. There was opposition but this seemed apt. Age is just a number and you should be proud. I’m sure I’ll be more proud when I’m fifty.",
        "date" : "Thu May 14 07:27:51 GMT-05:00 2015",
        "description" : "Jyothika is back in 36 Vayadhinile after an eight year break. Totally involved in her marriage and motherhood, the actor who used to be super busy, says that nothing matters to her more than her kids",
        "displayName" : "SOUTH CINEMA",
        "id" : "bcb32c9a-46da-4f3e-ae5b-4881d05b1a7d",
        "image" : { "detail" : "<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/15BGF_2_2405990g.jpg\" width=\"564\" alt=\"Proud to be 36: A still from the film\" title=\"Proud to be 36: A still from the film\">",
            "sort" : "http://www.thehindu.com/multimedia/dynamic/02405/15BGF_2_2405990g.jpg"
          },
        "link" : "http://www.thehindu.com/features/friday-review/on-a-different-pitch/article7205672.ece?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "order" : 9,
        "source" : "THEHINDU",
        "title" : "On a different pitch: Jyothika"
      },
      { "category" : "FOOD",
        "colorCode" : "#11C275",
        "content" : "AHMEDABAD: The Gujarat Co-operative Milk Marketing Federation (GCMMF), which markets its products under the Amul brand, has requested the government not to allow other countries to dump their dairy products in India under the Free Trade Agreement (FTA). GCMMF announced here today that it had achieved a turnover of Rs 20,733 crore for 2014-15. Speaking on the occasion, GCMMF Managing Director R S Sodhi expressed concerns over the possible entry of foreign players in the Indian dairy market under the FTA and registered his strong objections to such a move. \"Some countries are lobbying hard for access to the Indian dairy market through bilateral Free Trade Agreement (FTA) negotiations. We request our policy makers to ensure that dairy products are completely kept out of the ambit of FTAs with major dairy product exporting nations,\" Sodhi told. According to Sodhi, countries like New Zealand, Australia and European Union (EU) nations are under pressure to sell their surplus products, since they have been hit by a major meltdown in the global dairy products market recently. \"Earlier, China used to import dairy products in very large quantities from these countries. After that demand dried up, exports of these countries suffered and resulted in a major meltdown in global prices of dairy commodities,\" Sodhi said. \"Due to low demand, milk prices continue to fall in these countries, which are heavily dependent on dairy exports. Thus, in order to dump their surplus stocks of dairy commodities, these countries are lobbying hard to get access to the Indian dairy market,\" Sodhi said. Though the central government has not included dairy products in the FTA yet, Sodhi said that GCMMF has been cautioning the government against this move. \"We know that the government has never favoured the inclusion of dairy products under FTA, but it is our duty to caution them from time to time, since these countries still lobby for it. \"We believe that the entry of foreign players will severely hit the livelihood of millions of Indian farmers,\" Sod hi said. He said that banning foreign players in the Indian dairy market is also necessary to safeguard India's food security and ensure self sufficiency. \"No duty concessions and no Geographical Indication (GI) Protection on dairy products should be given to these countries. These steps will ensure our self sufficiency in the dairy sector and our food security with regard to milk and dairy products,\" Sodhi said.",
        "date" : "Thu May 14 10:28:35 GMT-05:00 2015",
        "description" : "GCMMF Managing Director R S Sodhi expressed concerns over the possible entry of foreign players in the Indian dairy market under the FTA.",
        "displayName" : "FOOD",
        "id" : "f10072d7-4734-4209-b32a-861b46f32dee",
        "image" : { "detail" : "<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47287179,width-310,resizemode-4/amul-sodhi_bccl.jpg\" alt=\"GCMMF&nbsp;Managing Director R S&nbsp;Sodhi&nbsp;expressed concerns over the possible entry of foreign players in the Indian dairy market under the FTA.\" title=\"GCMMF&nbsp;Managing Director R S&nbsp;Sodhi&nbsp;expressed concerns over the possible entry of foreign players in the Indian dairy market under the FTA.\">",
            "sort" : "http://economictimes.indiatimes.com/thumb/msid-47287179,width-310,resizemode-4/amul-sodhi_bccl.jpg"
          },
        "link" : "http://economictimes.indiatimes.com/industry/cons-products/food/amul-md-cautions-government-about-dumping-of-dairy-products/articleshow/47287103.cms",
        "order" : 10,
        "source" : "THEECONOMICTIMES",
        "title" : "Amul MD cautions government about dumping of dairy products"
      },
      { "category" : "HEALTH",
        "colorCode" : "#DC143C",
        "content" : "MUMBAI Indian generic drugmaker Ranbaxy Laboratories Ltd has been sued in a district court in the United States for allegedly manipulating U.S. Food and Drug Administration rules for years to keep rival generic drugs out of the market.",
        "date" : "Thu May 14 10:35:00 GMT-05:00 2015",
        "description" : "MUMBAI (Reuters) - Indian generic drugmaker Ranbaxy Laboratories Ltd has been sued in a district court in the United States for allegedly manipulating U.S. Food and Drug Administration rules for years to keep rival generic drugs out of the market.",
        "displayName" : "HEALTH",
        "id" : "67b16385-4d54-4ee7-8960-7f470b4e055f",
        "image" : { "detail" : "<img src=\"http://s1.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048343635&w=644&fh=&fw=&ll=&pl=&r=LYNXMPEB4D0R0\" border=\"0\" alt=\"A Ranbaxy office building is pictured in the northern Indian city of Mohali May 14, 2013.  REUTERS/Ajay Verma\">",
            "sort" : "http://s1.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048343635&w=644&fh=&fw=&ll=&pl=&r=LYNXMPEB4D0R0"
          },
        "link" : "http://feeds.reuters.com/~r/reuters/healthNews/~3/O4cValD0uPg/story01.htm",
        "order" : 11,
        "source" : "REUTERS",
        "title" : "U.S. class action asserts India's Ranbaxy manipulated FDA rules"
      },
      { "category" : "LIFESTYLE",
        "colorCode" : "#5FA896",
        "content" : "LONDON Is the Beatles song \"Lucy in the Sky with Diamonds\" a rebellious anthem to wild drug-taking or a touching tribute to a child's imagination? Discuss.",
        "date" : "Thu May 14 09:57:00 GMT-05:00 2015",
        "description" : "LONDON (Reuters) - Is the Beatles song \"Lucy in the Sky with Diamonds\" a rebellious anthem to wild drug-taking or a touching tribute to a child's imagination? Discuss.",
        "displayName" : "LIFESTYLE",
        "id" : "3b31d254-0f6b-4673-9f4f-c2a02e722689",
        "image" : { "detail" : "<img src=\"http://s4.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048326278&w=644&fh=&fw=&ll=&pl=&r=LYNXMPEB4D0OU\" border=\"0\" alt=\"Paul McCartney (L) and Ringo Starr perform during the taping of ''The Night That Changed America: A GRAMMY Salute To The Beatles'', which commemorates the 50th anniversary of The Beatles appearance on the Ed Sullivan Show, in Los Angeles January 27, 2014.   REUTERS/Mario Anzuoni\">",
            "sort" : "http://s4.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048326278&w=644&fh=&fw=&ll=&pl=&r=LYNXMPEB4D0OU"
          },
        "link" : "http://feeds.reuters.com/~r/reuters/INlifestyle/~3/c8g2FVGjTYA/us-britain-beatles-idINKBN0NZ1J820150514",
        "order" : 12,
        "source" : "REUTERS",
        "title" : "For 10 points: What is the meaning of 'Lucy in the Sky with Diamonds'?"
      },
      { "category" : "TRAVEL",
        "colorCode" : "#87CEEB",
        "content" : "We’ll confess that this is one of the least happening weeks in the city. Which is why if you want to ‘do nothing’ for a while, the time has never been better. No scorching sun; no heavy downpour either. The weather gods have conjured up a truly uplifting mix of puffy clouds, slight drizzle and warm sunshine in equal measure — just the weather to wander about with your thoughts. Step outdoors Find a seat in the sun: Start at the Promenade, where grey seas with overhanging grey clouds are brightened up by the sight of gaily striped umbrellas sprouting here and there. Sit out in the sun at Le Café with a book in hand and watch the waves. Slow down; savour that newly laundered feeling that hovers in the air in this part of town. Give Instagram a rest, make your bougainvillea moment: How many ‘Rues’ or lanes in the French quarter have you actually explored? The weather makes it perfect to discover their quaintness by foot or bike. Did we tell you that the bougainvillea are in bloom, spilling over those colonial villas with their brightly painted doors? Or that the tree-lined avenues in Tamil town, like Vysial or Aurobindo Street, are strewn with rain-washed flowers dotting the kolams in front of thinnais. For once, you may actually forego that Instagram filter — the colours on every street are bright enough. Take a selfie with the smartened up Dupleix: You might have almost felt sorry for Dupleix, whose statue relegated to the corner of the beach road, looked about to crumble any time. But this summer, Dupleix’s Park has become a popular spot for families to hang out. All spruced up, the statue no longer cuts a sorry figure, and Dupleix looks over a small, miniature park that skirts the sea. Illuminated with retro looking round lamps and landscaped with patches of grass and benches, this is a good place to rest your legs after your long walk down the Promenade. Tuck in On a break: Some popular cafes in the heritage quarter will close their doors till the first week of June. Shut for the summer are Umami, LB2 (from May 17), Café des Arts, Café de flore, La Pasta and Well Café among others. A Hepburn brownie?: Pondy’s Hollywood-themed restaurant La Marina has a new dessert named after a leading silver screen idol of yesteryear — Katherine Hepburn. If the name is anything to go by, the homemade brownies with vanilla ice cream promise a mix of the strong and the sweet. Splurge Bargain-hunting in the summer? Looking for export surplus or international brands for a song? Here are three all-year discount stores that have bargains to cheer any shopaholic’s heart. 1. Titanic on Madam Ambalathadayar Street (Mission Street cutting): for toddlers, kids, dresses and tops. 2. Outfits on Nehru Street for trousers and western wear 3. Best Deal on Bussy Street for Indian ethnic wear  In Auroville Sojourn to Benares: Leave behind the tranquillity that is Auroville and, for an hour, experience the sights and sounds of Benares in a guided tour by Banglaore-based poet Maitreyee B. Chowdury .She will read excerpts from Where Even The Present Is Ancient: Benaras and narrate the sensations and stories that the Ganga’s banks abound in. Through poetry, the author tries to unveil a lesser-known India. Meet the author on Saturday at 5.30 p.m. at Kala Kendra in Bharat Nivas. Make your harvest into star dishes: Solitude Kitchen in Auroville will be holding mini workshops on teaching food enthusiasts to turn locally harvested vegetables into healthy and exciting recipes. This week’s focus has been on the green papaya which can be made into soup, noodles, sanji and chutney. Workshops are timed between 11 a.m. to 12 noon and helmed by Sarah Kundig, head chef at Solitude. Call 9843319260 for details. Handmade paper: If the rustle of paper and the squeaky clean feel of new stationery set your heart aflutter, the workshop on making your own handmade paper by Auroville Papers may be your cup of tea. On May 15 and 16. ",
        "date" : "Thu May 14 09:35:24 GMT-05:00 2015",
        "description" : "We’ll confess that this is one of the least happening weeks in the city. Which is why if you want to ‘do nothing’ for a while, the time has never been better. No scorching sun; no heavy downpour e...",
        "displayName" : "TRAVEL",
        "id" : "ff350eaa-68be-4e1e-a508-67fa5b7e7544",
        "image" : { "detail" : "<img src=\"http://www.thehindu.com/multimedia/dynamic/02406/15MP_BOUGAINVILLEA_2406113g.jpg\" width=\"564\" alt=\"bougainvillea\" title=\"bougainvillea\">",
            "sort" : "http://www.thehindu.com/multimedia/dynamic/02406/15MP_BOUGAINVILLEA_2406113g.jpg"
          },
        "link" : "http://www.thehindu.com/features/metroplus/travel/right-up-your-rue-your-weekend-guide-to-pondy/article7206186.ece?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "order" : 13,
        "source" : "THEHINDU",
        "title" : "Right up your Rue: Your Weekend Guide to Pondy"
      },
      { "category" : "AUTO",
        "colorCode" : "#9E9705",
        "content" : "NEW DELHI:  Japanese carmaker Nissan today launched a special edition of its sports utility vehicle Terrano in India priced at Rs 11,45,123 (ex-showroom Delhi). Nissan Terrano Groove limited edition comes with features including precision speakers by Rockford Fosgate, one of the leading brands in high-performance in-car audio. The model also comes with branded fabric mats and upmarket LED scuff plates on the doors as well as chrome highlights for fog lamps, tail lamps and tailgate. Nissan India Operations-President, Guillaume Sicard said: \"With the Groove edition, we want to reach out to individuals who like their cars to reflect their dynamic lifestyle. We are confident that the new addition will make the Terrano even more appealing to them.\" The company said production of Terrano Groove will be limited to 250 units. Nissan also announced a new advertising campaign featuring Bollywood actor Sushant Singh Rajput. \"With the Groove edition, we wish to target younger customers and opted for an energetic campaign around contemporary music and dance,\" Nissan Motor India Managing Director Arun Malhotra said.",
        "date" : "Thu May 14 05:03:30 GMT-05:00 2015",
        "description" : "Japanese carmaker Nissan launched a special edition of its sports utility vehicle Terrano in India priced at Rs 11,45,123 (ex-showroom Delhi).",
        "displayName" : "AUTO",
        "id" : "d3f34720-cb4f-4f1f-9625-c175975451be",
        "image" : { "detail" : "<img src=\"http://media.newindianexpress.com/Nissan-Evalia.jpg/2014/11/01/article2502761.ece/alternates/w620/Nissan-Evalia.jpg\" alt=\"\">",
            "sort" : "http://media.newindianexpress.com/Nissan-Evalia.jpg/2014/11/01/article2502761.ece/alternates/w620/Nissan-Evalia.jpg"
          },
        "link" : "http://www.newindianexpress.com/auto/Nissan-Launches-Terrano-Groove-Priced-at-Rs-11.45-Lakh/2015/05/14/article2814084.ece",
        "order" : 14,
        "source" : "NEW INDIAN EXPRESS",
        "title" : "Nissan Launches Terrano Groove Priced at Rs 11.45 Lakh"
      },
      { "category" : "EDUCATION",
        "colorCode" : "#941ACE",
        "content" : "Raghunath K. Shevgaonkar, who resigned as Director of the Indian Institute of Technology, Delhi, on December 22, is waiting for the Human Resource Development Ministry to relieve him even after he has completed the stipulated three-month notice period. He is being made to wait as the HRD Ministry appears to be in no mood to relieve him. Prof. Shevgaonkar communicated his concern to the IIT chairman and the matter was taken up by the IIT Board on March 12. The Board gave its nod to relieve him and conveyed its decision to the Ministry. But Prof. Shevgaonkar continues to attend office, though he is keen to move on and devote time to research. Such is the level of distrust between Prof. Shevgaonkar and HRD Minister Smriti Irani, sources said, that the Ministry will perhaps relieve him on June 12, three months after the Board communicated its decision to the Ministry. Shevgaonkar saga raises questions on IITs’ autonomy Human Resource Development Minister Smriti Irani’s silence on the issue of IIT-Delhi Director Raghunath K. Shevgaonkar’s resignation has been the subject of much speculation. It is learnt that whenever the subject cropped up, the Minister’s response was to always remind everyone that Prof. Shevgaonkar remained the director of IIT-D, which was proof of her non-interference. Last month four MPs cutting across party lines had complained about the interference of Ms. Irani in prestigious institutes such as the IITs. Decision after meeting Minister The Shevgaonkar saga perhaps nails the lie on the much-vaunted autonomy of IITs. From all accounts, Prof. Shevgaonkar is a competent administrator and academic. Described as a gentleman by his contemporaries, he had a cordial relationship with his faculty as the Director of IIT-Delhi. Yet, after completing three-and-a-half years of his five-year tenure, Prof. Shevgaonkar dramatically offered to resign on December 22, the decision coming a mere 17 days after his meeting with the HRD Minister on December 5. Sources close to Prof. Shevgaonkar described the closed-door meeting as extremely unpleasant. The meeting, according to sources, left Prof. Shevgaonkar quite bruised, after which he made up his mind to quit.",
        "date" : "Wed May 13 21:53:38 GMT-05:00 2015",
        "description" : "Raghunath K. Shevgaonkar is being made to wait as the HRD Ministry appears to be in no mood to relieve him.",
        "displayName" : "EDUCATION",
        "id" : "85bed7a8-4d91-4fbd-8204-a94679d3d4a3",
        "image" : { "detail" : "<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/TH14_SHEVGAONKAR_2405043f.jpg\" class=\"main-image\" alt=\"R. K. Shevgaonkar has already served out his notice period.\" width=\"636\" height=\"487\" title=\"R. K. Shevgaonkar has already served out his notice period.\">",
            "sort" : "http://www.thehindu.com/multimedia/dynamic/02405/TH14_SHEVGAONKAR_2405043f.jpg"
          },
        "link" : "http://www.thehindu.com/news/national/iitdelhi-waiting-to-be-relieved/article7202685.ece?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "order" : 15,
        "source" : "THEHINDU",
        "title" : "IIT-Delhi director waits for Ministry’s nod to be relieved"
      },
      { "category" : "JOBS",
        "colorCode" : "#9B090C",
        "content" : "NEW DELHI: India will need around 56 million skilled workers in the booming retail sector by 2022, which is currently estimated at $ 435 billion and expected to witness a CAGR of 18.1 per cent over the next 4-5 years to touch $ 848 billion, according to a NSDC report. At present, distribution of workforce in the retail industry is concentrated mainly in five states, including Uttar Pradesh, Maharashtra, Andhra Pradesh, West Bengal and Tamil Nadu, which account for over 45 per cent of those employed. However, tier 2 and smaller cities are set to evolve to organise retail format rapidly in the near future. The retail sector, which contributes 23 per cent to the GDP, was driven by an increasing Private Final Consumption Expenditure (PFCE) over the last few years and grew from Rs 19 lakh crore in 2005 to around Rs 51 lakh crore in 2012. There will be a considerable rise in demand for skilled manpower in retail sector as the industry has been growing at a steady pace, fuelled by factors like changing lifestyles, rising disposable incomes, favourable demographics, and easy credit availability, according to the report. \"To match the requirement of skilled manpower we need to further scale up our efforts. The sector not only offers jobs but also entrepreneurship opportunities to trained manpower,\" MD & CEO, National Skill Development Corporation (NSDC), Dilip Chenoy said. According to the report, the employment base of the industry is expected to reach 56 million by 2022 across conventional and specialised retail segments.",
        "date" : "Thu May 14 07:45:45 GMT-05:00 2015",
        "description" : "The employment base of the industry is expected to reach 56 million by 2022 across conventional and specialised retail segments.",
        "displayName" : "JOBS",
        "id" : "aa0f3041-b377-4da1-911a-11477b325b57",
        "image" : { "detail" : "<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47285184,width-310,resizemode-4/labour.jpg\" alt=\"The employment base of the industry is expected to reach 56 million by 2022 across conventional and&nbsp;specialised&nbsp;retail segments.\" title=\"The employment base of the industry is expected to reach 56 million by 2022 across conventional and&nbsp;specialised&nbsp;retail segments.\">",
            "sort" : "http://economictimes.indiatimes.com/thumb/msid-47285184,width-310,resizemode-4/labour.jpg"
          },
        "link" : "http://economictimes.indiatimes.com/jobs/india-will-need-56-million-skilled-workers-in-retail-by-2022-report/articleshow/47285165.cms",
        "order" : 16,
        "source" : "THEECONOMICTIMES",
        "title" : "India will need 56 million skilled workers in retail by 2022: Report"
      },
      { "category" : "ENVIRONMENT",
        "colorCode" : "#E49E1B",
        "content" : "NEW DELHI India's weather office said on Thursday it expects monsoon rains to hit the southern Kerala coast around May 30, a timely arrival for farmers worried about dry weather from an El Nino weather pattern this year.",
        "date" : "Thu May 14 08:56:42 GMT-05:00 2015",
        "description" : "NEW DELHI (Reuters) - India's weather office said on Thursday it expects monsoon rains to hit the southern Kerala coast around May 30, a timely arrival for farmers worried about dry weather from an El Nino weather pattern this year.",
        "displayName" : "ENVIRONMENT",
        "id" : "bd18e47c-c8ff-400b-a9d7-05b04ee13ab9",
        "image" : { "detail" : "<img src=\"http://s2.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048292856&w=644&fh=&fw=&ll=&pl=&r=LYNXMPEB4D0IG\" border=\"0\" alt=\"Beachgoers react to the camera while holding an umbrella as it drizzles at the Fort Kochi beach in the southern Indian city of Kochi June 6, 2014. REUTERS/Sivaram V.\">",
            "sort" : "http://s2.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048292856&w=644&fh=&fw=&ll=&pl=&r=LYNXMPEB4D0IG"
          },
        "link" : "http://feeds.reuters.com/~r/reuters/environment/~3/n4GmeZpP8PM/story01.htm",
        "order" : 17,
        "source" : "REUTERS",
        "title" : "Monsoon rains to hit southern India on time, may help sowing"
      },
      { "category" : "BOOKS",
        "colorCode" : "#1387D5",
        "content" : "The 13th book taken up for review by Tamizh Puthaka Nanbargal was ‘Korkai,’ by Joe D’Cruz, and the reviewer was marine engineer and author K.R.A. Narasaiah.  D’Cruz, who has 25 years of experience in the shipping industry, is from a fisherman’s family in Tuticorin. His novel ‘Azhi Soozh Ulagu’ won the Tamil Nadu State award, and ‘Korkai’ won a Sahitya Akademi award.  He has written many research articles about ships, ports and fishermen. Ravi Tamizhvanan in his introduction to the programme, observed that a seafarer reviewing a book about a community that depended on the sea for its livelihood, was most apt.  E.M. Forster spoke of a novel as having a pattern, plot and rhythm. Rhythm is “like a musical motif which reappears with slight variations and helps to unify the novel.” Quoting Forster, Narasaiah said that ‘Korkai’ conformed to Forster’s definition of a novel.  Narasaiah gave a brief history of the Paratava community, who traditionally dived for pearls and conches. The novel, ‘Korkai,’ examines the history of the community, beginning from the early years of the 20th century. It has 380 characters and chronicles the lives of 32 families. Although it has no protagonist, Philip Kalingarayan, who runs away from home and becomes a wealthy owner of boats, comes closest to being the hero of the story.  The book deals with lust and forbidden liaisons too, but does so without vulgarity. The book records the history of the period casually, through conversations, whether it is the caste equations in the Congress party, or the building of the Cochin Port by Bristow. Throughout the book, there is a fidelity to truth, which lends authenticity to the historical accounts.  That the Paratavas continue to refer to Hindu mythology in everyday conversation is seen when they chase a pig. “Do you think you are Vishnu?” they yell after it, the reference being to the Varaha avatara of Vishnu. When Andamani dies, he wants a twig from the Santana Mariamman temple to be laid in his grave. Philip’s wife, Salome, offers a silver kavacham to Mariamman, showing that the Christians never completely gave up their Hindu beliefs. The last chapter is reminiscent of Joyce’s Ulysses, where the spirit of the entire novel is captured in one chapter. The story ends on a philosophical note, concluded Narasaiah.  D’Cruz said that there were others too, who had written about the Paratavas. But there was a difference between saying, “The Paratavas were hurt,” and saying, “We were hurt.” And so a first person account like D’Cruz’s gained significance. To D’Cruz, capturing the lives of his people and their problems was an emotional journey.  He said that even today, the rope for hoisting the flag during the festival at the Kanyakumari Amman temple comes from a fisherman’s family. Once, there were objections to accepting the ceremonial rope from a Christian family. But when the flag was hoisted, the rope gave way seven times.  So finally, a rope from the fishermen community was used, and the flag stayed aloft. To D’Cruz, it seemed like divine endorsement of the offerings of the Catholic fishermen.  D’Cruz is an ardent devotee of Mariamman, and says proudly that he sports the traditional three horizontal lines of vibhuti on his forehead, when he visits the temple! The Paratavas see themselves as exiles from the North, who came to South India during the time of Dritarashtra! In fact, during their weddings, once the Church ceremony is over, they recite their hoary lineage.  D’Cruz said that when Katchatheevu was ceded, there was a clause for protection of hereditary rights of both Indian and Lankan fishermen.  But subsequently, officials ignored the mention of hereditary rights, and only concentrated on the need to keep out of each other’s territory. Businessmen, who were out to make money through the marine wealth of the region, but who had no deep rooted ties to the sea, were also spoilers. Trawling uses a technology that should be used only at a depth of 2000 metres, and is disastrous when used in our coastal areas, where the depth is only about 15 metres. D’Cruz was asked by External Affairs Minister Sushma Swaraj, to prepare a report on the problems of the fishermen, and how to tackle them. He has made all these points in his report.  He does not believe in churning out books, just to chalk up impressive statistics. Nor does he write with a view to winning awards. He sees himself as an activist writer.   Literary forum  Industrialist R. T. Chari, who took it up as a mission to spread awareness on South Indian heritage, turned his attention to Tamil literature, and thus was born Tamizh Puthaka Nanbargal, a forum for discussions on Tamil books.  R.V. Rajan, who retired from the advertising industry, Ravi Tamizhvanan of Manimekalai publishers, and journalist Charukesi are also members of the organising team. Every month a meeting is held, where a book by a living author is reviewed, followed by the author’s response.  Why do they take up books only by living authors? “Vaazhumpodhe vaazhthuvom –honour them while they are alive- that’s our motto,” observes Ravi.  With the author present, are negative observations by reviewers allowed? “Certainly,” says Rajan. “In fact, when Sivasankari’s book was criticised, she said that she was glad to hear criticism of her work after 30 years!”  What happens if a reviewer goes beyond the purview of the book, and makes irrelevant observations? “We interrupt, and tell them to stick to the subject,” clarifies Charukesi.  “So far only novels and collections of essays have been taken up for review. There are plans to take up short story collections later,” says Chari. The best reviewer is given an award of Rs 20, 000 by Ramu Endowments, a trust created by Chari in memory of his father Ramabhadran. The first to win the award was Bharatiputran. ",
        "date" : "Thu May 14 08:08:35 GMT-05:00 2015",
        "description" : "Activist and author, Joe D’Cruz’s ‘Korkai’ chronicles the lives of the fishermen community.",
        "displayName" : "BOOKS",
        "id" : "2dafdca3-cb4d-4ce3-a0f5-027493e326fe",
        "image" : { "detail" : "<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/15FR-KORKAI_2405940g.jpg\" width=\"564\" alt=\"Joe D' Cruz, author of 'Korkai,' with the reviewer K.R.A. Narasiah. Photo: K.V. Srinivasan\" title=\"Joe D' Cruz, author of 'Korkai,' with the reviewer K.R.A. Narasiah. Photo: K.V. Srinivasan\">",
            "sort" : "http://www.thehindu.com/multimedia/dynamic/02405/15FR-KORKAI_2405940g.jpg"
          },
        "link" : "http://www.thehindu.com/features/friday-review/novel-with-rhythm-as-a-silver-thread/article7205527.ece?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "order" : 18,
        "source" : "THEHINDU",
        "title" : "Novel with rhythm as a silver thread"
      },
      { "category" : "ENTERTAINMENT",
        "colorCode" : "#E85137",
        "content" : "Actor Anas Rashid, best known for his role as Sooraj Rathi in popular soap opera “Diya Aur Baati Hum”, will be seen showing off his kabaddi skills in the upcoming sequence of the show. The 34-year-old says he has “fond memories” of the indigenous sport. Anas has hired a personal trainer and is giving extra hours in gym to look his part in the Kabaddi sequence. “I have fond memories of playing Kabaddi with my friends. My love for the sport made me follow the Kabaddi tournament last year and I’m glad that I can show off my skills on TV now,” Anas said in a statement. Related Jimmy Sheirgill in talks for 'Diya aur Baati Hum' Deepika Singh, Diya Aur Bati Hum's Sandhya slaps on-screen husband Suraj Diya Aur Baati Hum “My trainer overlooks my workout and has designed this nutritious diet for me which I have to follow to build up my stamina,” he added. Also, Anas has cut down on his night outs to get his eight hours of sleep. He said: “My friends have been calling me up every night, badgering me to go out with them but I really can’t. This Kabaddi match is one of the biggest tracks on the show and I want it to turn out right.” “Diya Aur Baati Hum” is aired on Star Plus.",
        "date" : "Thu May 14 10:52:35 GMT-05:00 2015",
        "description" : "Anas Rashid says he has \"fond memories\" of the indigenous sport.",
        "displayName" : "ENTERTAINMENT",
        "id" : "69a54b4a-71f7-424f-8a8e-571775b4b1e5",
        "image" : { "detail" : "<img class=\"size-full wp-image-2368677\" src=\"http://images.indianexpress.com/2015/05/anas-rashid-7591.jpg\" alt=\"Anas Rashid, Kabaddi, Sooraj Rathi, Deepika Singh, Diya aur Baati Hum, Anas Rashid Diya Aur Baati Hum, Anas Rashid Kabaddi, Anas Rashid Kabaddi Connection, Anas Rashid Sooraj rathi, Anas Rashid in Diya aur Baati Hum, Anas Sooraj rathi, Sooraj Rathi Anas Rashid, Anas Rashid Star Plus Show, Bollywood News, Entertainment news\" width=\"759\" height=\"422\">",
            "sort" : "http://images.indianexpress.com/2015/05/anas-rashid-7591.jpg"
          },
        "link" : "http://indianexpress.com/article/entertainment/television/anas-rashids-kabaddi-connection/",
        "order" : 19,
        "source" : "INDIAN EXPRESS",
        "title" : "Anas Rashid’s Kabaddi connection"
      },
      { "category" : "OVERSEAS",
        "colorCode" : "#5FA896",
        "content" : "WASHINGTON: Four Indian Americans are among 197 new members of the prestigious American Academy of Arts and Sciences, a leading centre for independent policy research. The new Indian American members are Sanjeev Arora of Princeton University, Sangeeta N Bhatia of the Massachusetts Institute of Technology, Renu Malhotra of the University of Arizona, and Ravindran Kannan of Microsoft Research Labs in Bangalore. American Academy of Arts and Sciences is one of the oldest and most prestigious honorary societies and a leading center for independent policy research in the US. Election to the Academy is considered one of the nation's highest honours. Theoretical computer scientist Sanjeev Arora, 47, who developed the PCP Theorem at Princeton University, is currently the Charles C Fitzmorris Professor of Computer Science at the same institution. His research interests include computational complexity theory, uses of randomness in computation, probabilistically checkable proofs, computing approximate solutions to NP-hard problems, and geometric embeddings of metric spaces, India West reported. Sangeeta N Bhatia, 47, a biological engineer at the Massachusetts Institute of Technology, was inducted on the merit of her investigative research into the application of micro- and nano-technology for tissue repair and regeneration. Ravindran Kannan, 62, serves as a principal researcher at Microsoft Research India, where he leads the algorithms research group. He is also the first adjunct faculty of Computer Science and Automation Department of Indian Institute of Science. Renu Malhotra, 54, is an American physicist known for her work on the orbital resonance between Pluto and Neptune. The new class will be inducted at a ceremony on Oct 10 in Cambridge, Massachusetts.",
        "date" : "Thu May 14 08:50:00 GMT-05:00 2015",
        "description" : "Ravindran Kannan, 62, serves as a principal researcher at Microsoft Research India, where he leads the algorithms research group.",
        "displayName" : "NRI NEWS",
        "id" : "1edb2f4c-d093-4e7a-843b-43577704a33c",
        "image" : { "detail" : "<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47285941,width-310,resizemode-4/deal4_bccl.jpg\" alt=\"Ravindran&nbsp;Kannan, 62, serves as a principal researcher at Microsoft Research India, where he leads the algorithms research group.\" title=\"Ravindran&nbsp;Kannan, 62, serves as a principal researcher at Microsoft Research India, where he leads the algorithms research group.\">",
            "sort" : "http://economictimes.indiatimes.com/thumb/msid-47285941,width-310,resizemode-4/deal4_bccl.jpg"
          },
        "link" : "http://economictimes.indiatimes.com/articleshow/47285926.cms",
        "order" : 20,
        "source" : "THEECONOMICTIMES",
        "title" : "4 Indian Americans elected to US Academy of Arts and Sciences"
      },
      { "category" : "REAL_ESTATE",
        "colorCode" : "#965DB1",
        "content" : "NEW DELHI: Realty firm Tata Housing will invest about Rs 600 crore to develop a new residential project at Bahadurgarh, Haryana. The company has tied up with a local developer, who owns 21.7 acres of land, to develop this housing project comprising 800-1,000 units. Tata Housing subsidiary Tata Value Homes said in a statement it has entered into Delhi-NCR's affordable housing market with the launch of this project in Bahadurgarh. The apartment price starts from nearly Rs 50 lakh. Tata Housing did not mention the total investment to develop this project, but sources said it would be about Rs 600 crore. The company has received all the necessary approvals to develop this project and construction works would start soon, they added. Tata Housing MD & CEO Brotin Banerjee said: \"Situated in close proximity to both Gurgaon and New Delhi, Bahadurgarh has the potential of being the hub for the value and affordable housing segment in the NCR area.\" Tata Housing is a closely held public limited company and a subsidiary of Tata Sons Ltd, which holds 99.86 per cent stake in the realty firm. It has 70 million square feet under various stages of planning and execution and an additional 19 million square feet in the pipeline. At present, Tata Housing is developing three projects in Gurgaon.",
        "date" : "Fri May 08 09:40:48 GMT-05:00 2015",
        "description" : "The company has tied up with a local developer, who owns 21.7 acres of land, to develop this housing project comprising 800-1,000 units.",
        "displayName" : "REAL ESTATE",
        "id" : "4518b2f0-ced3-4725-8ec7-f1960a95f406",
        "image" : { "detail" : null,
            "sort" : "http://economictimes.indiatimes.com/thumb/msid-47205096,width-600,resizemode-4/tata.jpg"
          },
        "link" : null,
        "order" : 21,
        "source" : "THEECONOMICTIMES",
        "title" : "Tata Housing to invest Rs 600 crore on new Bahadurgarh project"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "BEIJING: Prime Minister Narendra Modi and Chinese President Xi Jinping walked hand in hand, and chated at a pagoda in his home town of Xi'an on Thursday. The two leaders seemed to have built up a rare chemistry, which would help bring the two countries closer. The two leaders walked around in the Wild Goose Pagoda, which houses the rare manuscripts of Xuan Zhen, the 6th-century scholar who brought Buddhist texts from India and helped spread Buddhism in China. Xi took him around the sprawling pagoda premises, showing his reliecs of the scholar. Modi gifted the Chinese leader with a Bodhi sampling to signify that Buddism is one of the key factors behinds the civilizational relationship between India and China. Xi reciprocated presenting him a figurine of Xuan Zhen. Complete coverage — PM Modi's China visit \"This is the first time I have treated a foreign leader in my hometown and I hope you have a happy stay,\" Xi said at the start of their meeting. He also thanked the Indian Prime Minister for the warm reception given to him in Gujarat, Modi's home state, in September last year. \"That left me with a deep and good impression,\" Xi said. During the visit, they have \"reached an important consensus on promoting the bilateral strategic partnership of cooperation and forging a closer partnership of development,\" the official Xinhua quoted the Chinese president as saying. READ ALSO: Modi, Xi discuss ways to strengthen trust between two countries The Chinese president conveyed his admiration for Modi as he discussed the \"Gujarat miracle\" and said he would eagerly wait for it to spread across India. Gujarat is one state which has attracted the maxium amount of Chinese investments, and seen projects being implemented as compared to several other places where Chinese funded projects have been held up. Chinese President Xi looks on as Prime Minister Modi receives a golden Buddha statue from Buddhist abbot of Dacien Buddhist temple in Xi'an. (Reuters photo) Xi watched on with a faint smile on his face as the Indian Prime Mininster spent 6-7 minutes writing three pages in the visitor's book at the pagoda about his feelings on visiting the relics of the monk, who also visited his home town of Vadnagar in Gujarat. The two leaders arrived at the pagoda after a 90-minute meeting during which more than a dozen issues were discussed. Issues covered during the structured dialogue at a guest house covered issues concerning the border dispute. As it happened: Modi in China — Day 1 \"They discussed the problem of terrorism, more so in the context of what has happened in Kabul today, and what happened in Pakistan,\" foreign secretary S.Jaishankar said referring to the recent bloodbath in the two countries this week.",
        "date" : "Thu May 14 10:58:50 GMT-05:00 2015",
        "description" : "Prime Minister Narendra Modi and Chinese President Xi Jinping walked hand in hand, and chated at a pagoda in his home town of Xi'an on Thursday. The two leaders seemed to have built up a rare chemistry, which would help bring the two countries closer.",
        "displayName" : "BREAKING",
        "id" : "5b929063-6939-4104-99f7-4ce318bc0216",
        "image" : { "detail" : "<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"This is the first time I have treated a foreign leader in my hometown, Xi Jinping tells Narendra Modi\" title=\"This is the first time I have treated a foreign leader in my hometown, Xi Jinping tells Narendra Modi\" src=\"images/img-1.png\">",
            "sort" : "images/img-1.png"
          },
        "link" : "http://timesofindia.indiatimes.com/india/This-is-the-first-time-I-have-treated-a-foreign-leader-in-my-hometown-Xi-Jinping-tells-Narendra-Modi/articleshow/47287481.cms",
        "order" : null,
        "source" : "TimesOfIndia",
        "title" : "This is the 1st time I’ve treated a foreign leader in my hometown: Xi to Modi"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "A man from Punjab, who escaped from the clutches of the Islamic State (IS) in June 2014, claimed on Thursday that 39 Indians who were taken hostage by the terror outfit have been killed. However, external affairs minister Sushma Swaraj said in New Delhi that she did not believe the claims, and her own sources felt that the Indian nationals were still alive. Harjit Masih, 25, told the media in Mohali town adjoining Chandigarh that the 39 Indians, mostly from Punjab, were attacked by IS terrorists and killed. \"The IS came and kidnapped us and took us to another place. We were 40 Indians and about 50 Bangladeshis. They assured us that our passports would come and we will be allowed to leave for India,\" Masih said. \"They handed us over to another group (of terrorists), who took us to another place. Later, they put us in a room and started firing. Everyone around me fell. I kept lying there and later escaped,\" he said. Swaraj, however, disputed Masih's claims. \"We are not sparing any efforts to find them. We are hopeful that we will be able to find them and bring them back home. I have eight different sources who say that they are alive,\" Sushma Swaraj told the media after families of the hostages met her in New Delhi on Thursday. \"Harjit Masih left our protection on his own. He was not under detention,\" she added. The family of Masih had earlier claimed that he was kept under detention after his escape from Iraq. \"There is no reason to believe him. If we believe him, it will mean ending our search. I don't want to give up hope on this, and we are still looking for proof,\" Swaraj said. The Indian nationals were taken hostage by the IS on June 11 last year in northern Iraq's Mosul town. Their families had met Swaraj and other leaders in New Delhi and Chandigarh to know the whereabouts of their kin stuck in Iraq. Tags Islamic State Indian hostages hostages caliphate  ",
        "date" : "Thu May 14 10:32:57 GMT-05:00 2015",
        "description" : "A man from Punjab who escaped from the clutches of the Islamic State IS in June 2014 claimed on Thursday that 39 Indians who were taken hostage by the terror outfit have been killed However external affairs minister Sushma Swaraj said in New Delhi that she did not believe the claims and her own sources felt that the Indian nationals were still alive",
        "displayName" : "BREAKING",
        "id" : "a1c86bbb-6d06-44f5-8683-6b77f68713e6",
        "image" : { "detail" : "<img src=\"http://www.hindustantimes.com//images/2015/5/81834f69-257f-4c34-970a-b75206ce9437wallpaper1.jpg\">",
            "sort" : "http://www.hindustantimes.com//images/2015/5/81834f69-257f-4c34-970a-b75206ce9437wallpaper1.jpg"
          },
        "link" : "http://feeds.hindustantimes.com/~r/HT-HomePage-TopStories/~3/8-aQbvfdwgU/story01.htm",
        "order" : null,
        "source" : "HINDUSTAN TIMES",
        "title" : "Iraq survivor says IS killed 39 Indian hostages govt denies claim"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "A controversial map of India that excluded Arunachal Pradesh and Jammu and Kashmir was aired on China's national television broadcaster on Thursday, triggering angry reactions on social media platforms. The map was shown as a background during a news programme aired on China Central Television (CCTV) soon after Indian Prime Minister Narendra Modi landed in Xian early on Thursday. China's official maps show Arunachal Pradesh as South Tibet and also exclude parts of Jammu and Kashmir, in a move that has become a sore area in the ties between the world's two most populous countries which have bickered long over a Himalayan border dispute and fought a brief, bloody war in 1962. The development came on a day PM Modi opened his three-day tour of China, and discussed key issues such as terrorism and trade with Chinese President Xi Jinping in a \"comfortable\" atmosphere. There was no official reaction from the PM's team, but the timing of the map being shown on television could trigger disquiet among the visiting delegates. The controversial map cropped up within two days of a racist article in the state-run Global Times newspaper, which called Indians \"inferior\" and said Modi was playing tricks with the Chinese over the border dispute. The map was shared multiple times on Twitter and led to angry outbursts. However, besides the map controversy and the Global Times opinion piece, the Chinese state media has mostly been positive about Modi's visit. In fact, the Global Times carried out a survey on more than 2,100 people on Modi's visit, asking them for an opinion on Sino-India relations. More than 20% of the people interviewed said they did not want India to consider China as an \"imaginary enemy\". More than 24% said India should not trust the US and over 18% respondents said they wished that China and India could work together in various fields. However, over 66% of those surveyed said they thought that the current visit will not change much in Sino-India relations. People's Daily, organ of the Communist Party of China (CPC), published an article by the current Chinese ambassador to India, Lu Yucheng, which said \\the relationship between China and India would soon take off like a \"high speed rail\". Another state media article said \"Modi was trying to use Yoga-style diplomacy\" to improve relationship between the two countries. Read India-China border tussle: the Dragon is dreaming big China says border dispute with India contained Modi visit: India and China have many rivalries, some areas of cooperation Analysis: Three reasons why PM Modi matters to Chinese prez Xi Jinping Tags Narendra Modi's China visit India-China bilateral talks Modi in China Chinese media Indian map  ",
        "date" : "Thu May 14 10:11:38 GMT-05:00 2015",
        "description" : "A controversial map of India that excluded Arunachal Pradesh and Jammu and Kashmir was aired on Chinas national television broadcaster on Thursday triggering angry reactions on social media platforms",
        "displayName" : "BREAKING",
        "id" : "cffe7465-2b77-4b39-8dcb-2cb3c57345f3",
        "image" : { "detail" : "<img src=\"http://www.hindustantimes.com//images/2015/5/8ad77a80-6e31-4576-9e86-bbf4fbd49ad5wallpaper1.jpg\">",
            "sort" : "http://www.hindustantimes.com//images/2015/5/8ad77a80-6e31-4576-9e86-bbf4fbd49ad5wallpaper1.jpg"
          },
        "link" : "http://feeds.hindustantimes.com/~r/HT-HomePage-TopStories/~3/wNgzDL08-Ms/story01.htm",
        "order" : null,
        "source" : "HINDUSTAN TIMES",
        "title" : "Chinese media blows hot and cold Shows wrong Indian map projects positive survey on ties"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "Zimbabwe pulled out of this month’s historic cricket tour to Pakistan and then retracted their decision within 16 minutes in a bizarre turnaround on Thursday. Zimbabwe Cricket initially released a statement saying that a decision had been reached not to tour on the advice of the country’s supreme sports regulatory authority, the Sports and Recreation Commission (SRC). The SRC had previously cited concerns over the safety of the touring party. But after the news release was issued, the statement was withdrawn and Zimbabwe Cricket spokesman Lovemore Banda told Reuters that discussions were still on-going. “At this time the tour has not been suspended. The executive and board of Zimbabwe Cricket are still in discussions,” he said. Banda would not put a time frame on when a decision would be made, saying only that it would be announced “as soon as the discussions are finalised”. Zimbabwe were due to be the first Test-playing nation to tour Pakistan since a 2009 gun attack on Sri Lanka’s team bus in Lahore left seven players injured and eight Pakistanis dead.",
        "date" : "Thu May 14 10:27:46 GMT-05:00 2015",
        "description" : "The statement was withdrawn and Zimbabwe Cricket spokesman Lovemore Banda said discussions were still on-going.",
        "displayName" : "BREAKING",
        "id" : "6145b9b6-acbd-48d9-b57e-a081e9597f68",
        "image" : { "detail" : "<img class=\"size-full wp-image-2368659\" src=\"http://images.indianexpress.com/2015/05/zimbabwecricketapl.jpg\" alt=\"Zimbabwe Pakistan, Zimbabwe vs Pakistan, Pakistan vs Zimbabwe, Zimbabwe tour of Pakistan, Cricket News, Cricket\" width=\"759\" height=\"422\">",
            "sort" : "http://images.indianexpress.com/2015/05/zimbabwecricketapl.jpg"
          },
        "link" : "http://indianexpress.com/article/sports/cricket/zimbabwes-decision-to-cancel-pakistan-tour-put-on-hold/",
        "order" : null,
        "source" : "INDIAN EXPRESS",
        "title" : "Zimbabwe’s decision to cancel Pakistan tour put on hold"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "A day after former Aligarh Muslim University (AMU) student leader Asma Javed was found dead in her apartment, the police had yet to arrest any suspects in connection with the case, triggering resentment among her family members and AMU students. Javed's brother, Salman, told HT the family had lodged an FIR and informed police about a suspect, but no action was taken. \"Asma had earlier told senior police officials that she feared she was going to be murdered and had named some persons, including one Akram, against whom she had earlier also lodged a complaint. But police did not take her seriously and she was murdered,\" he said. Javed, the first woman to contest the election of Aligarh Muslim University student union, was allegedly strangled to death five days ago. Her decomposed body was found on Wednesday afternoon, after neighbours alerted police about a foul smell coming from her rented apartment in Aligarh. Her brother had lodged a missing diary the same morning. Her family could not contact her and her flat was found locked from outside. Police said a tablet and Rs 45,000 was missing from her apartment. Superintendent of police (crime) Shri Krishan said, \"The motive behind her murder is being investigated and soon police will arrest the accused. A four-member team was formed to conduct the post-mortem.\" According to reports, Javed had earlier registered an FIR in civil lines police station against one Akram, accusing him of rape on the pretext of marriage.  She had later withdrawn the rape charges. However, a few days she met senior police officials again, and alleged that a compromise was reached under pressure and she was afraid. Aligarh senior superintendent of police J Ravindar Gaur said, \"All new and old relations inside and outside AMU will be included in the investigation. The civil lines police have changed the FIR from missing person to murder and the investigation has been handed over to the SOG and surveillance team has also been pressed into service.\" Javed, 28, had contested the AMU students' poll for the president's post in 2011. A vocal campaigner for women's rights, she had completed her doctorate from the university couple of years ago, NDTV reported. According to reports, she had been living alone since her husband reportedly left for South America. Tags Asma Javed AMU Aligarh Muslim University former AMU leader found dead  ",
        "date" : "Thu May 14 09:06:22 GMT-05:00 2015",
        "description" : "A day after former Aligarh Muslim University AMU student leader Asma Javed was found dead in her apartment the police had yet to arrest any suspects in connection with the case triggering resentment among her family members and AMU students",
        "displayName" : "BREAKING",
        "id" : "d0296b44-9362-4849-91f6-10a3e1f024db",
        "image" : { "detail" : "<img src=\"http://www.hindustantimes.com//images/2015/5/09b9a6ef-9515-4ef2-a992-f7f86a413e5dwallpaper1.jpg\">",
            "sort" : "http://www.hindustantimes.com//images/2015/5/09b9a6ef-9515-4ef2-a992-f7f86a413e5dwallpaper1.jpg"
          },
        "link" : "http://feeds.hindustantimes.com/~r/HT-HomePage-TopStories/~3/Gl_KxwepF0w/story01.htm",
        "order" : null,
        "source" : "HINDUSTAN TIMES",
        "title" : "First girl student who contested Aligarh varsity polls found dead family alleges police inaction"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "KABUL The Afghan Taliban claimed responsibility on Thursday for an attack on a popular guesthouse in Kabul that killed at least 14 people, including foreigners attending a dinner and arriving for a concert.",
        "date" : "Thu May 14 08:59:06 GMT-05:00 2015",
        "description" : "KABUL (Reuters) - The Afghan Taliban claimed responsibility on Thursday for an attack on a popular guesthouse in Kabul that killed at least 14 people, including foreigners attending a dinner and arriving for a concert.",
        "displayName" : "BREAKING",
        "id" : "329ed3f0-58a0-4563-bff2-7e7d4eb82ed6",
        "image" : { "detail" : "<img data-lazy=\"http://s1.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048322217&w=&fh=&fw=&ll=644&pl=429&r=LYNXMPEB4D0O1\" alt=\"\">",
            "sort" : "http://s1.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048322217&w=&fh=&fw=&ll=644&pl=429&r=LYNXMPEB4D0O1"
          },
        "link" : "http://feeds.reuters.com/~r/reuters/INtopNews/~3/KyJyQ-jsWN8/story01.htm",
        "order" : null,
        "source" : "REUTERS",
        "title" : "Taliban claim attack on Afghan guesthouse that killed 14"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "BEIJING Chinese President Xi Jinping hosted Indian Prime Minister Narendra Modi in his ancestral home town at the start of a three-day visit to China on Thursday as the two Asian giants work to boost economic ties despite decades of mistrust.",
        "date" : "Thu May 14 08:57:14 GMT-05:00 2015",
        "description" : "BEIJING (Reuters) - Chinese President Xi Jinping hosted Indian Prime Minister Narendra Modi in his ancestral home town at the start of a three-day visit to China on Thursday as the two Asian giants work to boost economic ties despite decades of mistrust.",
        "displayName" : "BREAKING",
        "id" : "bb6863b3-27dc-483e-b355-c90c66cd9ab4",
        "image" : { "detail" : "<img data-lazy=\"http://s3.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048322215&w=&fh=&fw=&ll=644&pl=429&r=LYNXMPEB4D0IQ\" alt=\"\">",
            "sort" : "http://s3.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048322215&w=&fh=&fw=&ll=644&pl=429&r=LYNXMPEB4D0IQ"
          },
        "link" : "http://feeds.reuters.com/~r/reuters/INtopNews/~3/kWpdXKiFCKw/story01.htm",
        "order" : null,
        "source" : "REUTERS",
        "title" : "Xi greets Modi in ancestral home town with eye to trade ties"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "The Supreme Court stayed on Thursday a circular by the Delhi government on filing defamation cases against media organisations for any news that caused damage to its reputation or that of chief minister Arvind Kejriwal. Asking Kejriwal to explain why the directorate of information had issued \"such circular\", the court sought a reply within six weeks and listed the matter for further hearing on July 8. The court's order came on an application filed by senior advocate Amit Sibal seeking vacation of the stay granted by the apex court on the proceedings before a trial court in a defamation case. Rival political parties welcomed the Supreme Court order. The Bharatiya Janata Party (BJP) and the Congress quickly reacted to the apex court's observation that accused Kejriwal of following double standards. Welcoming the SC's decision of staying the circular, expelled AAP leader Prashant Bhushan too criticised the \"double standard\" of the Kejriwal dispensation. Here's a look at who said what on the issue. Congress: 'Against freedom of expression' Congress general secretary and DPCC chief Ajay Maken said the Kejriwal government had not only targeted the media but also tried to throttle the voices of its political adversaries through the circular on filing of defamation cases against the media for any news that caused \"damage\" to its reputation. \"It was against the basic principle of freedom of expression. What Arvind Kejriwal wanted was to not only gag the media but also the common man and leaders of political parties. The circular was totally unconstitutional and we welcome the Supreme Court order,\" Maken said. Senior Congress leader Pramod Tiwari too praised the SC for safeguarding the nation's crucial \"fourth pillar of democracy\". \"The court has shown (Arvind Kejriwal's) real face. This is what he really deserved. It is a sign of victory of democracy, because, the media is considered as the fourth pillar of democracy,\" Tiwari said. BJP: 'Victory of democratic rights' The Delhi BJP called the SC observation a victory of democratic rights. \"We welcome the Supreme Court order. In democracy, you cannot gag the media. The anti-media circular was aimed at curbing voices of dissent,\" said Delhi BJP leader Vijender Gupta. BJP spokesperson Sambit Patra said, \"It is very welcome step by the Supreme Court. It is clear now that the Delhi government and Kejriwal have acted in a very dictatorial way to formulate this draconian circular, which today (Thursday) has been stayed by the Supreme Court.\" Shazia Ilmi, a former AAP leader who is now with the BJP, said, \"Arvind Kejriwal wants to use the media. But when the same media shows him the mirror he cannot bear it.\" Prashant Bhushan: 'Double standards' The former AAP leader, who was expelled from the party last month and has now formed his own organisation Swaraj Samvad, said, \"…the Supreme Court saw that on one hand Arvind Kejriwal has filed a petition to stay his defamation case challenging its constitutional validity. And on the other hand the same (Delhi) government is issuing circular that any media organisation, if it says something or writes anything which is defamatory, then a case of crimimal defemation will be filed on government expenditure.\" \"Then the Supreme Court said how can you have double standard on the issue,\" Bhushan said. Read: Media gag: Has CM Kejriwal govt scored a self goal? Arvind Kejriwal under attack for circular on 'defamatory' news CM’s defamation circular violates constitutional right to free speech Tags media Delhi AAP Supreme Court Arvind Kejriwal  ",
        "date" : "Thu May 14 08:47:24 GMT-05:00 2015",
        "description" : "The Supreme Court stayed on Thursday a circular by the Delhi government on filing defamation cases against media organisations for any news that caused damage to its reputation or that of chief minister Arvind Kejriwal",
        "displayName" : "BREAKING",
        "id" : "e02e52b1-65dd-443d-bc9f-54e5c564099c",
        "image" : { "detail" : "<img src=\"http://www.hindustantimes.com//images/2015/5/ba4b3127-ff2e-4ca3-b2f9-d9c29a8015e0wallpaper1.jpg\">",
            "sort" : "http://www.hindustantimes.com//images/2015/5/ba4b3127-ff2e-4ca3-b2f9-d9c29a8015e0wallpaper1.jpg"
          },
        "link" : "http://feeds.hindustantimes.com/~r/HT-HomePage-TopStories/~3/7kfpbbpcs78/story01.htm",
        "order" : null,
        "source" : "HINDUSTAN TIMES",
        "title" : "Cong hails SC BJP welcomes move Who said what after Kejriwal govts media circular"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "MUMBAI: Leading IT services company, Tata Consultancy Services (TCS) has been ranked as the 57th leading brand in the US by Brand Finance in its second annual Top 500 US Brands survey, the company said today. The survey evaluates the financial value of a company's brand name, intellectual assets and trademark, as compared to companies across industries. This is also the first time that TCS has featured among the top 100 brands in the survey, the company said in a statement. \"Developing a valuable brand goes far beyond awareness, it's about the deep opportunities and service we provide to our employees, clients and the communities in which we work and live,\" said Surya Kant, president of North America, UK and Europe, TCS. \"Our goal is to push ourselves and our clients to re-imagine their business operations in today's digital economy,\" he added. \"TCS was recognised as a top four IT Services brand in the US -- the same as its global ranking -- and has a AA+ score for its brand strength, the sector's highest designation,\" it added. Globally, TCS' brand value grew 271% in five years, from $2.3 billion in 2010 to $8.7 billion in 2015, marking the fastest growth across the IT services industry during the period. \"TCS has established itself as one of the fastest growing brands in the United States,\" said Edgar Baum, managing director, Brand Finance, North America. \"TCS is one of the rare businesses that has sustained the industry AA+ rating for three years in a row,\" he added. TCS has a long-standing presence in North America, being one of the top ten recruiters of IT talent, with 19 facilities and innovation labs serving many of the region's Fortune 500 companies. Follow TOI Tech on Twitter >>> @toi_tech And like us on Facebook >>> TOI_tech",
        "date" : "Thu May 14 08:29:57 GMT-05:00 2015",
        "description" : "Tata Consultancy Services (TCS) has been ranked as the 57th leading brand in the US by Brand Finance in its second annual Top 500 US Brands survey, the company said today.",
        "displayName" : "BREAKING",
        "id" : "953b8abe-df90-4119-a052-a8bce16d853e",
        "image" : { "detail" : "<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"TCS ranks 57th in US brands survey\" title=\"TCS ranks 57th in US brands survey\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47285714,width-300,resizemode-4/TCS.jpg\">",
            "sort" : "http://timesofindia.indiatimes.com/thumb/msid-47285714,width-300,resizemode-4/TCS.jpg"
          },
        "link" : "http://timesofindia.indiatimes.com/tech/tech-news/TCS-ranks-57th-in-US-brands-survey/articleshow/47285695.cms",
        "order" : null,
        "source" : "TimesOfIndia",
        "title" : "TCS ranks 57th in US brands survey"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "XI'AN: Prime Minister Narendra Modi on Thursday began a three-day visit to China from this northwest city, the hometown of Chinese President Xi Jinping with whom he held \"very substantive\" discussions focussing on strengthening of mutual trust and the boundary issue. On his first visit to China since assuming office last year, Modi was warmly greeted by Xi, who set aside protocol to receive a foreign dignitary outside Beijing in replay of the Indian leader's gesture in September last when he welcomed the Chinese President in Ahmedabad. Even as mutual warmth was apparent, Modi raised the question of some $46 billion investment by China in an economic corridor passing through Pakistan-occupied Kashmir (PoK), about which India had protested. The investments were announced during Xi's visit to Pakistan last month. Complete coverage — PM Modi's China visit Another ticklish issue reportedly raised by Modi concerns the issuance of stapled visas by China to residents of Arunachal Pradesh, which the Chinese claim to be a part of southern Tibet, a claim totally rejected by India. For the record, foreign secretary S Jaishankar said the \"very substantive talks\" between the two leaders covered subjects ranging from political, economic and global issues like terrorism, UN security council reforms and India's membership of Nuclear Suppliers Group (NSG). \"On the political side, there was a lot of discussion on strengthening trust and increasing convergence,\" he said while briefing media on the 90-minute delegation-level talks without taking any questions. READ ALSO: Modi, Xi discuss ways to strengthen trust between two countries He said the two leaders discussed the boundary issue, including peace and tranquility, besides trans-border rivers. Prime Minister Narendra Modi (left) during a meeting with Chinese President Xi Jinping at Xi'an, on May 14, 2015. (PTI photo) The boundary issue has been a sticking point in the relations between the two major Asian countries and both are making efforts to settle it through special representatives' talks. The special representatives have held 18 rounds of discussions so far. Talking about the atmospherics at the meeting, the third in a year between Modi and the all-powerful Xi, who is also the general secretary of the Chinese Communist Party, Jaishankar said, \"the atmosphere was very comfortable. \"So, in the sense it was building on the chemistry between the two of them which started last September.\" As it happened: Modi in China — Day 1 On the economic front, Modi and Xi discussed the issue of trade deficit, which is in favour of China to the tune of $38 billion, and ways to address it. They also talked about the investment climate and challenges of reforms, Jaishankar said.",
        "date" : "Thu May 14 08:25:32 GMT-05:00 2015",
        "description" : "Prime Minister Narendra Modi on Thursday began a three-day visit to China from this northwest city, the hometown of Chinese President Xi Jinping with whom he held \"very substantive\" discussions focussing on strengthening of mutual trust and the boundary issue.",
        "displayName" : "BREAKING",
        "id" : "84bcbd57-7af8-4793-9da1-bce66fe408c7",
        "image" : { "detail" : "<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"PM Narendra Modi holds ‘very substantive’ talks with President Xi Jinping at latter’s hometown\" title=\"PM Narendra Modi holds ‘very substantive’ talks with President Xi Jinping at latter’s hometown\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47285721,width-300,resizemode-4/Narendra-Modi-China-Visit-II.jpg\">",
            "sort" : "http://timesofindia.indiatimes.com/thumb/msid-47285721,width-300,resizemode-4/Narendra-Modi-China-Visit-II.jpg"
          },
        "link" : "http://timesofindia.indiatimes.com/india/PM-Narendra-Modi-holds-very-substantive-talks-with-President-Xi-Jinping-at-latters-hometown/articleshow/47285659.cms",
        "order" : null,
        "source" : "TimesOfIndia",
        "title" : "Modi holds ‘very substantive’ talks with Xi at latter’s hometown"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "NEW DELHI: The Supreme Court on Thursday deferred a decision on conglomerate Sahara's bid for bail for its jailed boss in a long-running dispute over illegal bonds. It gave no date for a decision. Subrata Roy has been held in jail for more than a year, after Sahara failed to comply with a court order to refund money it had raised from millions of small investors by selling bonds that were later ruled to be illegal. READ ALSO: Sahara agrees to pay bail to release Subrata Roy SC gives Sahara 90 days to raise Rs 1,200cr for Roy's release Mumbai's development plan may unlock Rs 20,000cr goldmine for Sahara A lawyer for the group said last week Sahara had agreed to pay the full $1.6 billion the court had asked for to release Roy on bail, but the group has yet to publicly outline that plan.",
        "date" : "Thu May 14 07:01:29 GMT-05:00 2015",
        "description" : "The Supreme Court on Thursday deferred a decision on conglomerate Sahara's bid for bail for its jailed boss in a long-running dispute over illegal bonds.",
        "displayName" : "BREAKING",
        "id" : "eec9ae6f-9552-4701-8439-a50ebc0e268f",
        "image" : { "detail" : "<img style=\"cursor:pointer\" onerror=\"pm_imageFailed(this);\" pg=\"StoryVid\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"217\" border=\"0\" id=\"articleimg1\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47284592,width-217,resizemode-4/Subrata-Roy-Police.jpg\" alt=\"Subrata Roy Police\" title=\"Subrata Roy Police\">",
            "sort" : "http://timesofindia.indiatimes.com/thumb/msid-47284592,width-217,resizemode-4/Subrata-Roy-Police.jpg"
          },
        "link" : "http://timesofindia.indiatimes.com/business/india-business/Supreme-Court-delays-decision-on-jailed-Sahara-chief-Subrata-Roy/articleshow/47284508.cms",
        "order" : null,
        "source" : "TimesOfIndia",
        "title" : "SC delays decision on jailed Sahara chief"
      },
      { "category" : "BREAKING",
        "colorCode" : "#808080",
        "content" : "MUMBAI: Giving his support for the proposed revival of Indo-Pak cricket series, former skipper Rahul Dravid on Thursday said he welcomed it from a purely cricketing perspective, although there were many other matters to be considered. READ ALSO: 'Second round of talks on Indo-Pak cricket in coming weeks' \"From a cricketing perspective an India-Pakistan series is any day welcome. But this series is more than about cricket, looking at the security angle and political situations, and is best left to the two Boards to decide,\" Dravid said at a media conference of IPL franchise Rajasthan Royals. Pakistan Cricket Board chairman Shaharyar Khan had visited India recently to rally hard for the resumption of Indo-Pak cricket ties. Shaharyar, during a joint press briefing along with BCCI President Jagmohan Dalmiya in Kolkata, proposed a series comprising three Tests, five ODIs and two T20s in UAE in December, but the BCCI has not given any categorical statement yet on the proposed series and the venue. \"Possibility is that in the coming few days or coming weeks, second round of talks will take place,\" BCCI secretary Anurag Thakur told a press conference in Chandigarh on Thursday. Thakur, who is also a BJP MP from Hamirpur in Himachal Pradesh, said the talks between the Boards of the two countries were still in \"early stages\". \"I want to say only this, which is that the talks between the Boards of two countries has taken place, which are at early stages. And when talks between two Boards takes place, you limit the talk to just cricket only. \"At government level, what is their thinking, whether they want (the series to take place) or not, on this no talk has taken place,\" Thakur said. Follow TOI Sports on Twitter >>> @TOISportsNews",
        "date" : "Thu May 14 06:30:42 GMT-05:00 2015",
        "description" : "Giving his support for the proposed revival of Indo-Pak cricket series, former skipper Rahul Dravid said he welcomed it from a purely cricketing perspective.",
        "displayName" : "BREAKING",
        "id" : "2240839b-ae9b-43d7-b6e3-2bbc647d3d8e",
        "image" : { "detail" : "<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Rahul Dravid bats for India-Pakistan series from cricketing angle\" title=\"Rahul Dravid bats for India-Pakistan series from cricketing angle\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47284142,width-300,resizemode-4/Dravid.jpg\">",
            "sort" : "http://timesofindia.indiatimes.com/thumb/msid-47284142,width-300,resizemode-4/Dravid.jpg"
          },
        "link" : "http://timesofindia.indiatimes.com/sports/icc-world-cup-2015/top-stories/Rahul-Dravid-bats-for-India-Pakistan-series-from-cricketing-angle/articleshow/47284125.cms",
        "order" : null,
        "source" : "TimesOfIndia",
        "title" : "Rahul Dravid bats for India-Pak cricket series"
      }
    ],
  "lastupdated" : 1431619802712,
  "refreshInt" : 5
}