{"feed":[{"title":"CBI Nabs Porn Kingpin in Bengaluru; Over 500 Obscene Clips Found","link":"http://www.newindianexpress.com/nation/CBI-Nabs-Porn-Kingpin-in-Bengaluru-Over-500-Obscene-Clips-Found/2015/05/14/article2814266.ece","description":"CBI arrested an alleged porn kingpin from Bengaluru in connection with its probe into obscene MMS clips being circulated on social messaging platforms.","date":"Thu May 14 11:14:13 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/CBI2PTI.jpg/2013/07/17/article1688201.ece/alternates/w620/CBI2PTI.jpg\" alt=\"\">","sort":"http://media.newindianexpress.com/CBI2PTI.jpg/2013/07/17/article1688201.ece/alternates/w620/CBI2PTI.jpg"},"content":"NEW DELHI: CBI today arrested an alleged porn kingpin from Bengaluru in connection with its probe into obscene MMS clips being circulated on social messaging platforms. CBI sources said Kaushik Kuonar was arrested during a search operation in the evening as part of a probe which was undertaken upon directions from Supreme Court. Over 500 secretly shot porn clips of gullible girls in compromising positions were found by the agency during the search. Supreme Court had taken suo-motu cognisance of a letter sent by a Hyderabad-based NGO to Chief Justice of India HL Dattu along with a pen drive containing nine clips. The apex court had then ordered a CBI probe into the issue. In none of the cases was it clear as to what was the time and place of crime or the identity of the victim and offenders appearing in the video, thereby leaving the agency to hunt in dark. The agency used sophisticated forensic software to track the origins of these video messages which went viral on social messaging platform. Three of the nine clips given to the agency were traced to Kuonar. In connection with one clip, the agency has already arrested two persons from Odisha. The sources said that during searches today, the CBI team was surprised to find high-end editing software, stealth cameras and other equipment which was allegedly being used for creating these videos. They said the suspect belongs to a well-to-do family living in an affluent locality. The sources said he had allegedly made a profession out of creating such titillating videos of girls which he posted on the Internet. \"Every click or every visit (to a webpage) for viewing these clips would apparently reward him with money,\" an official told PTI while giving details of the initial questioning. The sources said he would be brought to Delhi for further interrogation. Besides this case, the agency has registered six FIRs of alleged gangrape and one FIR of rape while a Preliminary Enquiry has also been registered. While the FIRs related to gangrape and rape, the agency has also invoked sections of abduction.","source":"NEW INDIAN EXPRESS","id":"cf375341-5d96-478b-9e7a-7cf8f7608439","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"All 39 Indians Held as Hostages in Iraq by ISIS are Alive: Sushma Swaraj","link":"http://feedproxy.google.com/~r/ndtv/Lsgd/~3/8Myg-kmw1rg/story01.htm","description":"All 39 Indians held hostage in Iraq by ISIS militants for nearly a year are \"alive\", External Affairs Minister Sushma Swaraj told the families of the victims today.","date":"Thu May 14 10:11:04 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"All 39 Indians Held as Hostages in Iraq by ISIS are Alive: Sushma Swaraj\" alt=\"All 39 Indians Held as Hostages in Iraq by ISIS are Alive: Sushma Swaraj\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/mt/2015-01/Sushma_Swaraj_in_Bhopal_ANI_650.jpg\">","sort":"http://i.ndtvimg.com/mt/2015-01/Sushma_Swaraj_in_Bhopal_ANI_650.jpg"},"content":"New Delhi:  All 39 Indians held hostage in Iraq by ISIS militants for nearly a year are \"alive\", External Affairs Minister Sushma Swaraj told the families of the victims today. Ms Swaraj, who met the families for the seventh time since the abduction of the Indians in June last year from Mosul, reassured the families about the well-being of the nationals on the basis of information received from various sources. The government was making sincere efforts for the safe and early release of the Indian workers, she told them. \"Earlier we had six sources we told us that the Indians are alive. Now we have two more sources to corroborate the same. Out of these two, one is so solidly reliable that there is no question of not believing. They have very clearly said that all the 39 Indian are alive,\" Ms Swaraj said after meeting the families of the hostages. The ministry said Ms Swaraj had earlier personally spoken to her counterpart Foreign Ministers in the Gulf Cooperation Council or GCC as well as other friendly countries in the region for their assistance in the safe release of Indians in captivity. The minister also assured them that as soon as some concrete proof on the well-being of the workers is received by the government, it would be shared with the families. Minister of Food Processing Harsimrat Kaur Badal was also present during the meeting.  ","source":"NDTV","id":"1865a371-2551-406a-bd51-458b8887ed64","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Protest in Agra Over Shifting of Centuries-old Cremation Ground","link":"http://www.newindianexpress.com/nation/Protest-in-Agra-Over-Shifting-of-Centuries-old-Cremation-Ground/2015/05/14/article2814263.ece","description":"Scores of BJP activists, members of citizens groups and some NGOs joined a protest march to oppose shifting of a centuries-old cremation ground located close to Taj Mahal.","date":"Thu May 14 11:05:47 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"AGRA: Scores of BJP activists, members of citizens groups and some NGOs today joined a protest march to oppose shifting of a centuries-old cremation ground located close to Taj Mahal here. The protesters marched this morning to stall the process of shifting of Taj Ganj shamshan ghat. \"This march was a warning for the administration not to proceed with the shifting of the cremation ground otherwise there will be a bigger mass movement in days to come,\" said Purushuttam Khandelwal, pesident of Braj Prant, an RSS body. The district administration is under pressure from the Archaeological Survey of India (ASI) to implement the recommendation of Dr S Vardarajan Committee report which wanted shifting of the cremation ground because the pollution from the smoke of burning pyres was adversely affecting the world-famous white marble monument.","source":"NEW INDIAN EXPRESS","id":"e6a9fe03-2d92-4859-835e-ef615b921ca1","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Freedom of speech cannot be absolute: SC","link":"http://indianexpress.com/article/india/india-others/freedom-of-speech-cannot-be-absolute-sc/","description":"\"Freedom of speech and expression has to be given a broad canvas, but it has to have inherent limitations, said SC.","date":"Thu May 14 11:04:16 GMT-05:00 2015","image":{"detail":"<img class=\"size-full wp-image-2322405\" src=\"http://images.indianexpress.com/2015/03/supreme-court.jpg\" alt=\"Supreme Court of India\" width=\"759\" height=\"422\">","sort":"http://images.indianexpress.com/2015/03/supreme-court.jpg"},"content":"The Supreme Court on Thursday said that freedom of speech and expression cannot be “absolute” as it refused to reject criminal charges against an author for penning an alleged vulgar and obscene poem on Mahatma Gandhi in 1994. Putting vulgar and obscene words in the mouth of “historically respected personalities” like Gandhi cannot pass the “contemporary community standards test” meant to adjudge the obscenity of an alleged literary work, the apex court said. The observation came in a judgement by which the court quashed criminal charges against bank employee Devidas Ramchandra Tuljapurkar for publishing the “vulgar and obscene” poem on Gandhi in 1994 in an in-house magazine of which he was an editor. “Freedom of speech and expression has to be given a broad canvas, but it has to have inherent limitations which are permissible within the constitutional parameters. We have already opined that freedom of speech and expression as enshrined under Article 19(1)(a) of the Constitution is not absolute in view of Article 19(2) of the Constitution. “We reiterate the said right is a right of great value and transcends and with the passage of time and growth of culture, it has to pave the path of ascendancy, but it cannot be put in the compartment of absoluteness. There is constitutional limitation attached to it…,” a bench of justices Dipak Misra and P C Pant said. The bench noted that the publisher published the poem “Gandhi Mala Bhetala” in 1994 and “immediately” after coming to know its impact, he tendered unconditional apology in the next issue of the magazine. “Once he has tendered the unconditional apology even before the inception of the proceedings and almost more than two decades have passed, we are inclined to quash the charge framed against him as well as the printer. “We are disposed to quash the charge against the printer, as it is submitted that he had printed as desired by the publisher. Hence, they stand discharged,” the bench said. The apex court quashed the criminal proceedings against Tuljapurkar who had published the poem in a magazine ‘Bulletin’ for private circulation among the members of All India Bank Association Union. It, however, made it clear that it was not expressing any opinion on the charges framed against Marathi poet Vasant Dattatraya Gurjar, author of the poem, and it would be up to him to explain the “manner and the context” in which he used the words against Mahatma in the trial court.","source":"INDIAN EXPRESS","id":"22258a3f-8191-44e0-b7c5-1a48dc8a685b","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Naveen Launches Digital Campaign for Nabakalebara Festival","link":"http://www.newindianexpress.com/states/odisha/Naveen-Launches-Digital-Campaign-for-Nabakalebara-Festival/2015/05/14/article2814261.ece","description":"Naveen Patnaik launched the digital campaign for Lord Jagannath's Nabakalebara - 2015 by inaugurating the official portal of the festival.","date":"Thu May 14 10:58:57 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/Naveen_Patnaik3PTI.jpg/2013/12/03/article1925417.ece/alternates/w620/Naveen_Patnaik3PTI.jpg\" alt=\"\">","sort":"http://media.newindianexpress.com/Naveen_Patnaik3PTI.jpg/2013/12/03/article1925417.ece/alternates/w620/Naveen_Patnaik3PTI.jpg"},"content":"BHUBANESWAR: Odisha Chief Minister Naveen Patnaik today launched the digital campaign for Lord Jagannath's Nabakalebara - 2015 by inaugurating the official portal of the festival here. \"The official portal aims at increasing awareness and also enable devotees, visitors and tourists to find relevant information about the Nabakalebara festival,\" Patnaik said while launching the web portal. The objective of the digital campaign is to make Nabakalebara a 'World Event', through a state of art dynamic  website www.nabakalebara.gov.in, a user friendly mobile application in Android, iOS and Windows platforms, and  extensive social media campaign \"Nabakalebara 2015 Official\" on Facebook, Twitter, Youtube and Google Plus platforms. This campaign aims at improving the tourist engagement, enhance the service offerings, maintain the visitor profile and generate analysis for use during the future events, said Information and Public Relations minister Atanu S Nayak. The website will have details about Nabakalebara, story of Daru Brahma (holy log used to build Lord's body), role of the Sevayats, on going rituals, about Sreekshetra, about the trinity, tourism and culture. How to reach, places to visit around Puri and  in Odisha. Accommodation details, Nabakalebara news, Twitter  speaks, videos and Photos and information of Health and  safety parking places and Local travel agencies and others, said Nayak.","source":"NEW INDIAN EXPRESS","id":"b50feb9d-0d3b-428d-b6ef-c7cd22575202","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Take up dam issue with China, Gogoi urges Modi","link":"http://timesofindia.feedsportal.com/c/33039/f/533916/s/465093f2/sc/31/l/0Ltimesofindia0Bindiatimes0N0Cindia0CTake0Eup0Edam0Eissue0Ewith0EChina0EGogoi0Eurges0EModi0Carticleshow0C472874780Bcms/story01.htm","description":"Assam chief minister Tarun Gogoi on Thursday urged Prime Minister Narendra Modi to take up the issue of China's construction of dams on the Brahmaputra river during his ongoing visit to the country.","date":"Thu May 14 10:58:39 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Take up dam issue with China, Gogoi urges Modi\" title=\"Take up dam issue with China, Gogoi urges Modi\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47287519,width-300,resizemode-4/Tarun-Gogoi.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47287519,width-300,resizemode-4/Tarun-Gogoi.jpg"},"content":"GUWAHATI: Assam chief minister Tarun Gogoi on Thursday urged Prime Minister Narendra Modi to take up the issue of China's construction of dams on the Brahmaputra river during his ongoing visit to the country. Gogoi said there were serious concerns about the construction of dams by China over the Brahmaputra that would adversely impact downstream flow. \"Prime Minister Narendra Modi must convey India's concerns to Beijing during his visit,\" Gogoi told the media.","source":"TimesOfIndia","id":"ffa9bf36-b9cd-4ee0-a18f-49f361cb37d2","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Pleasant weather in north, rain lashes Himachal","link":"http://timesofindia.feedsportal.com/c/33039/f/533916/s/465093f4/sc/26/l/0Ltimesofindia0Bindiatimes0N0Cindia0CPleasant0Eweather0Ein0Enorth0Erain0Elashes0EHimachal0Carticleshow0C472874290Bcms/story01.htm","description":"Weather remained pleasant in vast swathes of north India on Thursday with rain lashing many areas including Himachal Pradesh.","date":"Thu May 14 10:53:12 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Pleasant weather in north, rain lashes Himachal\" title=\"Pleasant weather in north, rain lashes Himachal\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47287447,width-300,resizemode-4/rainfall-Shimla.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47287447,width-300,resizemode-4/rainfall-Shimla.jpg"},"content":"NEW DELHI: Weather remained pleasant in vast swathes of north India on Thursday with rain lashing many areas including Himachal Pradesh. In the national capital, the mercury stayed well below normal levels a day after light rains broke the spell of scorching heat. The maximum temperature settled three notches below the season's average at 35.8 degrees Celsius, while the minimum stood at 22 degrees celsius, also three notches below the normal, Met department officials said. Humidity oscillated between 81 and 34 per cent. Meanwhile, several areas of Himachal Pradesh were lashed by moderate to heavy rains while thunderstorm hit several places in mid hills, causing marginal fall in mercury. The mid and lower hills experienced moderate to heavy rains and Jogindernagar in Mandi district received 49 mm rain, followed by Kasauli 29mm, Renuka 25mm, Hamirpur 16mm, Gaggal, Baijnath and Manali 13mm each, Jubbal 12mm, Paonta Sahib 11 mm, and Solan 8mm. Himachal Pradesh capital Shimla and its surrounding areas were lashed by heavy showers, accompanied by strong winds and sky remained heavily overcast, causing sharp fall in day temperature and reducing visibility. There was marginal fluctuation in minimum temperatures and Keylong was the coldest at night with a low of 6.9 degrees, followed by Manali 7 degrees, Kalpa 7.8, Dalhousie 14.5, Shimla 13.3, Bhuntar 13.4, Solan and Chamba 14, Sundernagar 15.2, Hamirpur 16e, Dharamshala 16.2, Nahan and Una 16.3, Mandi 16.5, Kangra 16.6, and Bilaspur 16.9 degrees celsius. Una was the hottest during the day with a high of 35.4 degrees celsius, followed by Nahan 30.7, Sundernagar 28.5, Dharamsala 27.8, Solan 27.5, Bhuntar 22.8, Shimla 22.5, Manali 15.4, and Kalpa 14.2 degrees celsius.","source":"TimesOfIndia","id":"9eae2133-34c6-430d-b421-bc86de7574f0","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Chinese media blows hot and cold Shows wrong Indian map projects positive survey on ties","link":"http://www.hindustantimes.com/india-news/chinese-media-blows-hot-and-cold-shows-wrong-indian-map-projects-positive-survey-on-ties/article1-1347249.aspx","description":"A controversial map of India that excluded Arunachal Pradesh and Jammu and Kashmir was aired on Chinas national television broadcaster on Thursday triggering angry reactions on social media platforms","date":"Thu May 14 10:11:38 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.hindustantimes.com//images/2015/5/8ad77a80-6e31-4576-9e86-bbf4fbd49ad5wallpaper1.jpg\">","sort":"http://www.hindustantimes.com//images/2015/5/8ad77a80-6e31-4576-9e86-bbf4fbd49ad5wallpaper1.jpg"},"content":"A controversial map of India that excluded Arunachal Pradesh and Jammu and Kashmir was aired on China's national television broadcaster on Thursday, triggering angry reactions on social media platforms. The map was shown as a background during a news programme aired on China Central Television (CCTV) soon after Indian Prime Minister Narendra Modi landed in Xian early on Thursday. China's official maps show Arunachal Pradesh as South Tibet and also exclude parts of Jammu and Kashmir, in a move that has become a sore area in the ties between the world's two most populous countries which have bickered long over a Himalayan border dispute and fought a brief, bloody war in 1962. The development came on a day PM Modi opened his three-day tour of China, and discussed key issues such as terrorism and trade with Chinese President Xi Jinping in a \"comfortable\" atmosphere. There was no official reaction from the PM's team, but the timing of the map being shown on television could trigger disquiet among the visiting delegates. The controversial map cropped up within two days of a racist article in the state-run Global Times newspaper, which called Indians \"inferior\" and said Modi was playing tricks with the Chinese over the border dispute. The map was shared multiple times on Twitter and led to angry outbursts. However, besides the map controversy and the Global Times opinion piece, the Chinese state media has mostly been positive about Modi's visit. In fact, the Global Times carried out a survey on more than 2,100 people on Modi's visit, asking them for an opinion on Sino-India relations. More than 20% of the people interviewed said they did not want India to consider China as an \"imaginary enemy\". More than 24% said India should not trust the US and over 18% respondents said they wished that China and India could work together in various fields. However, over 66% of those surveyed said they thought that the current visit will not change much in Sino-India relations. People's Daily, organ of the Communist Party of China (CPC), published an article by the current Chinese ambassador to India, Lu Yucheng, which said \\the relationship between China and India would soon take off like a \"high speed rail\". Another state media article said \"Modi was trying to use Yoga-style diplomacy\" to improve relationship between the two countries. Read India-China border tussle: the Dragon is dreaming big China says border dispute with India contained Modi visit: India and China have many rivalries, some areas of cooperation Analysis: Three reasons why PM Modi matters to Chinese prez Xi Jinping Tags Narendra Modi's China visit India-China bilateral talks Modi in China Chinese media Indian map  ","source":"HINDUSTAN TIMES","id":"737dce55-fe33-4a42-8c48-647edf4cf7be","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"India Inc renews rate cut demand as inflation touches new low","link":"http://ibnlive.in.com/news/india-inc-renews-rate-cut-demand-as-inflation-touches-new-low/545645-7.html","description":"With inflation dropping to a new low in April, industry bodies have reaffirmed demand for a rate cut, saying it provides ample space for the RBI to slash the key policy rate to fuel investments and propel growth.","date":"Thu May 14 09:34:53 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/09_2013/rbi-finance-ministry-to-consider-cheaper-auto-home-loans-scheme_180913050228.jpg\" width=\"669px\" title=\"India Inc renews rate cut demand as inflation touches new low\" alt=\"India Inc renews rate cut demand as inflation touches new low\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/09_2013/rbi-finance-ministry-to-consider-cheaper-auto-home-loans-scheme_180913050228.jpg"},"content":"New Delhi: With inflation dropping to a new low in April, industry bodies have reaffirmed demand for a rate cut, saying it provides ample space for the RBI to slash the key policy rate to fuel investments and propel growth. \"The benign inflation outlook fuelled by soft commodity prices and the anti-inflationary policies of the government, should provide sufficient elbow room to the RBI to continue with growth inducing policy in its forthcoming monetary policy announcement,\" CII Director General Chandrajit Banerjee said. Deflationary pressure continued for the sixth month in a row with inflation dropping to a new low of (-) 2.65 per cent in April, mainly on account of decline in fuel prices and manufactured items even as food prices increased. The Reserve Bank had kept policy rate unchanged in its review on April 7. #rbi #india inc #inflation \"While a decline in inflation could create room for a more accommodative stance from the Reserve Bank of India in terms of rate cut in its next bi-monthly monetary policy, we would like to reiterate that a long term sequential drop of inflation of manufacturing products could adversely impact their pricing power,\" Assocham President Rana Kapoor said. The Reserve Bank had kept policy rate unchanged in its review on April 7. \"We look forward to another round of downward revision in the repo rate and subsequent transmission of same by the banks to encourage on-ground investments and build on the growth momentum,\" Ficci President Jyotsna Suri said. RBI Governor Raghuram Rajan, who surprised with two rate cuts of 0.25 per cent each outside the scheduled review meetings earlier this year, affirmed commitment to the accommodative stance and added that policy moves will be shaped by incoming data and transmission of rate cuts by banks will be his top-most priority. Inflation, as measured on the Wholesale Price Index (WPI), has been in the negative zone since November. In April 2014, it was 5.55 per cent. In April this year, the manufactured products segment witnessed deflation for the second consecutive month as prices dropped to a record low of (-) 0.52 per cent. Inflation in food articles category stood at 5.73 per cent from 6.31 per cent in March. For fuel and power, it was (-) 13.03 per cent in April.","source":"IBNLIVE","id":"88fff182-8aa9-4c93-85e0-2b1af044113d","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Monsoon likely to hit Kerala coast on May 30 but looming El Nino may cause below normal rains","link":"http://www.hindustantimes.com/india-news/monsoon-likey-to-hit-kerala-coast-on-may-30-looming-el-nino-to-cause-below-normal-rains/article1-1347222.aspx","description":"The Indian Meteorological Department on Thursday said that conditions are becoming favourable for advancement of southwest monsoon over the Andaman Sea and adjoining areas during the next 34 days","date":"Thu May 14 08:21:49 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.hindustantimes.com//images/2015/5/8293505f-24c2-4f6e-b031-dc7d41c66da1wallpaper1.jpg\">","sort":"http://www.hindustantimes.com//images/2015/5/8293505f-24c2-4f6e-b031-dc7d41c66da1wallpaper1.jpg"},"content":"Monsoon is likely to hit the southern Kerala coast on May 30, two days before its scheduled arrival in India, the weather office said on Thursday. But, the country stares at the possibility of below normal rains for a second consecutive year at a time farmers are worried about dry weather from an El Nino weather pattern this year. The Indian Meteorological Department (IMD) said conditions were becoming \"favourable\" for advancement of southwest monsoon over the Andaman Sea and adjoining areas during the next 3-4 days. Read: Changing monsoon patterns call for new farm practices \"The southwest monsoon is likely to set over Kerala on May 30 with a model error of ± 4 days,\" IMD said in a statement. The June-September monsoon season is vital for the country as half its croplands lack irrigation, but a forecast of less rain than usual due to the emergence of the El Nino has threatened to worsen rural distress. For millions of farmers whose winter-sown crops were damaged by unseasonal rains in February and March, the IMD prediction of a timely start to the monsoon may help them plan their sowing better. IMD considers a June 1 arrival as normal. Last year the annual rains hit the Kerala coast on June 6, leading to deficient rains that trimmed grain output.    \"A timely onset of monsoon will help ease threats of El Nino from the minds of farmers to some extent,\" said Sudhir Panwar, chief of farmers' lobby group Kisan Jagriti Manch. \"This could also lead to timely sowing of summer crops.\" The El Nino, or a warming of sea-surface temperatures in the Pacific, brought the worst drought in four decades to India in 2009. A repeat could severely hit farming, which accounts for 15% of the country's $2 trillion (almost Rs 127 lakh crore) economy and supports two-thirds of its 1.25 billion population. Any surge in food prices could fuel inflation and dent Prime Minister Narendra Modi's popularity in the countryside. \"There are instances in the past when the monsoon onset took place much ahead of the normal date but the season turned out to be dry as happened in 2009,\" IMD's chief forecaster DS Pai said. Tags Monsoon El Nino normal rains southwest  ","source":"HINDUSTAN TIMES","id":"55200205-9267-4de4-8f35-01ab80dfbf4a","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"No Comments on SC's Stay on Defamation Against Media Houses: Delhi Government","link":"http://www.newindianexpress.com/nation/No-Comments-on-SCs-Stay-on-Defamation-Against-Media-Houses-Delhi-Government/2015/05/14/article2814260.ece","description":"No Comments on SC's Stay on Defamation Against Media Houses: Delhi Government","date":"Thu May 14 10:52:26 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/Arvind-Kejriwal.jpg/2015/03/06/article2700607.ece/alternates/w620/Arvind%20Kejriwal.jpg\" alt=\"\">","sort":"http://media.newindianexpress.com/Arvind-Kejriwal.jpg/2015/03/06/article2700607.ece/alternates/w620/Arvind%20Kejriwal.jpg"},"content":"NEW DELHI: Delhi Government today refused to comment on the Supreme Court's stay order on its circular on filing of defamation cases against media houses for publishing or broadcasting news that damage the reputation of the Chief Minister, the council of ministers and the government. Asked about the government's reaction, a Delhi Government spokesperson said it's a Supreme Court order and \"we don't want to comment on it\".  The Supreme Court also issued notice to Delhi Chief Minister Arvind Kejriwal and sought his response on a plea of senior advocate Amit Sibal that the stay on the criminal defamation proceedings against the Aam Aadmi Party (AAP) leader be lifted. The court asked Kejriwal to also explain why such a circular was issued by his government while expressing surprise as to how the AAP leader could have opposite views on the same issue. According to the circular issued by the Directorate of Information and Publicity Department of Delhi Government on May 6, if any officer associated with the Delhi government feels that the published or aired news item damages his or the government's reputation, he should file a complaint with the Principal Secretary (Home). The circular stated that the Principal Secretary (Home) will then examine the matter and will also seek the opinion of the Director (prosecution) as to whether the prosecution under section 499/500 of the IPC is to be launched. If as per the opinion of the Director (prosecution), offence of defamation is made out the Principal Secretary will refer the matter to the Law Department for examining the matter and obtain the sanction of under section 199(4) of the CrPc.","source":"NEW INDIAN EXPRESS","id":"3006fae5-bef1-4fce-999e-e7948c9b1059","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"SC Refuses to Reject Criminal Charges Author for Penning Vulgar, Obscene Poem on Gandhi","link":"http://www.newindianexpress.com/nation/SC-Refuses-to-Reject-Criminal-Charges-Author-for-Penning-Vulgar-Obscene-Poem-on-Gandhi/2015/05/14/article2814256.ece","description":"Freedom of speech and expression cannot be 'absolute', SC said as it refused to reject criminal charges against an author for penning an alleged vulgar, obscene poem on Mahatma Gandhi in 1994.","date":"Thu May 14 10:39:20 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/Mahatma-Gandhi2.jpg/2015/01/04/article2603124.ece/alternates/w620/Mahatma%20Gandhi2.jpg\" alt=\"\">","sort":"http://media.newindianexpress.com/Mahatma-Gandhi2.jpg/2015/01/04/article2603124.ece/alternates/w620/Mahatma%20Gandhi2.jpg"},"content":"NEW DELHI: Freedom of speech and expression cannot be \"absolute\", the Supreme Court today said as it refused to reject criminal charges against an author for penning an alleged vulgar and obscene poem on Mahatma Gandhi in 1994. Putting vulgar and obscene words in the mouth of \"historically respected personalities\" like Gandhi cannot pass the \"contemporary community standards test\" meant to adjudge the obscenity of an alleged literary work, the apex court said. The observation came in a judgement by which the court quashed criminal charges against bank employee Devidas Ramchandra Tuljapurkar for publishing the \"vulgar and obscene\" poem on Gandhi in 1994 in an in-house magazine of which he was an editor. \"Freedom of speech and expression has to be given a broad canvas, but it has to have inherent limitations which are permissible within the constitutional parameters. We have already opined that freedom of speech and expression as enshrined under Article 19(1)(a) of the Constitution is not absolute in view of Article 19(2) of the Constitution. \"We reiterate the said right is a right of great value and transcends and with the passage of time and growth of culture, it has to pave the path of ascendancy, but it cannot be put in the compartment of absoluteness. There is constitutional limitation attached to it...,\" a bench of justices Dipak Misra and P C Pant said. The bench noted that the publisher published the poem \"Gandhi Mala Bhetala\" in 1994 and \"immediately\" after coming to know its impact, he tendered unconditional apology in the next issue of the magazine. \"Once he has tendered the unconditional apology even before the inception of the proceedings and almost more than two decades have passed, we are inclined to quash the charge framed against him as well as the printer. \"We are disposed to quash the charge against the printer, as it is submitted that he had printed as desired by the publisher. Hence, they stand discharged,\" the bench said. The apex court quashed the criminal proceedings against Tuljapurkar who had published the poem in a magazine 'Bulletin' for private circulation among the members of All India Bank Association Union. It, however, made it clear that it was not expressing any opinion on the charges framed against Marathi poet Vasant Dattatraya Gurjar, author of the poem, and it would be up to him to explain the \"manner and the context\" in which he used the words against Mahatma in the trial court.","source":"NEW INDIAN EXPRESS","id":"a75ebb81-1b2e-4c6c-b0b5-09b1ff8cfa59","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Nine held for Hyderabad youth’s killing in street-fight","link":"http://indianexpress.com/article/india/india-others/nine-held-for-hyderabad-youths-killing-in-street-fight/","description":"On the day of the incident, the group of friends gathered in Panjesha area and Owais had a fight with two other youths and defeated them.","date":"Thu May 14 10:34:31 GMT-05:00 2015","image":{"detail":null,"sort":"http://images.indianexpress.com/2015/05/nabeel1.jpg?w=209"},"content":"Seven youths were on Thursday arrested and two juveniles apprehended in connection with the death of a 17-year-old student, who was killed in Old City allegedly in a mock street-fight with another youth on May 3, police said. Mohd Awaiz alias Owais Patel and six others, some of them students, were arrested today while two juvenile boys were apprehended in connection with the killing of Nabil Mohammed, Deputy Commissioner of Police (South Zone) V Satyanarayana told reporters. According to police, the youths, including the deceased, were all close friends. Owais always tried to dominate his friends by way of his adamant behaviour. Related VIDEO: 17-year-old’s death; Police probe wrestling bout, six friends held in Hyderabad Teen beaten to death in fight over mobile charger Police on lookout for Nigerian dealer who supplied drugs to college students On the day of the incident, the group of friends gathered in Panjesha area and Owais had a fight with two other youths and defeated them. On instigation of Omer Baig and others, Owais and Nabil got prepared to fight, the DCP said. WATCH VIDEO During the “friendly” fight which was videographed, Owais attacked and punched Nabil on his body and particularly on his head, following which Nabil collapsed and died, the senior police officer said. The friends then got Nabil shifted to a nearby hospital where the doctors declared him dead, he said. In order to conceal the facts, all of them concocted a story on the instigation of Omer Baig that Nabil died in a bike accident while doing stunts and believing the version of the accused, Nabil’s family buried his body, police said. Later, Nabil’s father got some doubt about his death and lodged a complaint with Mirchowk police and a case of suspicious death was registered. In the meanwhile, the video footage recorded on a mobile phone by one of the youths went viral on social media and was also shown on TV news channels. Accordingly, on May 11, Nabil’s body was exhumed and a post-mortem was conducted. Based on preliminary report, it was revealed that Nabil’s body had multiple injuries including on his head, the DCP said. Based on the post-mortem report, the sections in the case were altered to 302 (murder), 201 (causing disappearance of evidence of offence, or giving false information to screen offender) and other relevant sections of IPC, he said. “The youths became vagabond (irresponsible) due to lack of parents’ supervision. Only due to their recklessness and personal ego, this incident occurred,” the DCP said. It is learnt that parents of some of the youths had information about the incident even before filing of the case and intentionally overlooked it and this amounts to wilful concealing of the facts, he added.","source":"INDIAN EXPRESS","id":"5c9074e2-8ba5-4539-837e-3c24886025fe","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Leopard killed in Bihar village by locals after it injures two","link":"http://indianexpress.com/article/india/india-others/leopard-killed-in-bihar-village-by-locals-after-it-injures-two/","description":"The leopard strayed into Bairgachhi-Araria locality and attacked a child and a police constable Surendra Kumar Bharti.","date":"Thu May 14 09:54:45 GMT-05:00 2015","image":{"detail":null,"sort":"http://images.indianexpress.com/2015/03/leopard-thumb.jpg?w=480"},"content":"A leopard was killed by mob after it injured a child and a constable in a locality under Bairgachhi police outpost in Araria, police said on Thursday. The leopard strayed into Bairgachhi-Araria locality and attacked a child and a police constable Surendra Kumar Bharti and injured the two severely, Additional Superintendent of Police (ASP) Rajiv Ranjan said. Soon, a mob gathered at the spot and an unidentified man shot at the animal killing it on the spot, Ranjan said. Related Briefly State: Heat wave in eastern UP Villagers clash with cops over factory wall in Bihar,3 killed Leopard killing: 'Police not helping in arresting accused' Both the victims were taken to Sadar hospital for treatment, the ASP said adding, the cop had risked his own life to rescue the child from the leopard. A forest team rushed to the spot to probe the killing of the leopard and a case was lodged against unidentified persons under provisions of the Wild Protection Act, 1972 for killing the leopard, Ranjan added.","source":"INDIAN EXPRESS","id":"b1fc22da-7a64-4a11-91d7-7e54160fc87d","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Poll affidavit: Petition in HC seeks action against PM","link":"http://timesofindia.feedsportal.com/c/33039/f/533916/s/46506600/sc/7/l/0Ltimesofindia0Bindiatimes0N0Cindia0CPoll0Eaffidavit0EPetition0Ein0EHC0Eseeks0Eaction0Eagainst0EPM0Carticleshow0C472865410Bcms/story01.htm","description":"A member of Aam Aadmi Party (AAP) has moved the Gujarat high court, seeking legal proceedings against Prime Minister Narendra Modi for filing an allegedly defective affidavit when he had contested the 2012 Assembly elections from Maninagar here.","date":"Thu May 14 09:49:22 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Poll affidavit: Petition in HC seeks action against PM\" title=\"Poll affidavit: Petition in HC seeks action against PM\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47286587,width-300,resizemode-4/Modi.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47286587,width-300,resizemode-4/Modi.jpg"},"content":"AHMEDABAD: A member of Aam Aadmi Party (AAP) has moved the Gujarat high court, seeking legal proceedings against Prime Minister Narendra Modi for filing an allegedly defective affidavit when he had contested the 2012 Assembly elections from Maninagar here. \"I have challenged the order of the district sessions court before the high court, seeking action against the Prime Minister and also the former returning officer of Maninagar constituency,\" said Nishant Verma, the petitioner. The petition, filed on May 6, is likely to come up for hearing in the second week of June. In February, the sessions court had rejected Verma's application seeking registration of a case against Modi for not disclosing his wife's name in the election affidavit. He also sought action against P K Jadeja, the then returning officer of Maninagar, for accepting the \"defective\" affidavit. In June 2014, a magistrate's court had dismissed his application, saying it had been filed more than one year after the election. As per Criminal Procedure Code section 468(2)(B), a complaint of violation of Representation of People Act has to be filed within one year of the alleged incident. Modi, then the chief ministerial candidate of BJP in Gujarat, had contested the assembly election from Maninagar in 2012. In the affidavit submitted with the nomination, he left the column regarding `spouse' blank, Verma says. Modi disclosed his marital status and the name of his wife (Jashodaben) for the first time when he filed nomination for Vadodara Lok Sabha seat last year, the petition adds. Section 125-A(3) of RP Act deals with penalty for concealing information while filing affidavit and provides for imprisonment for a term which may extend to six months.","source":"TimesOfIndia","id":"6e6f0c72-ab36-49ba-8dc2-0e08a0d29a4a","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Militancy on decline in J&K, needs time to end: CRPF","link":"http://timesofindia.feedsportal.com/c/33039/f/533916/s/46506606/sc/15/l/0Ltimesofindia0Bindiatimes0N0Cindia0CMilitancy0Eon0Edecline0Ein0EJK0Eneeds0Etime0Eto0Eend0ECRPF0Carticleshow0C472864510Bcms/story01.htm","description":"Militancy in Jammu & Kashmir is on the decline but it will take some more time to finish it completely, CRPF director general Prakash Mishra said here on Thursday.","date":"Thu May 14 09:40:44 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Militancy on decline in J&amp;K, needs time to end: CRPF\" title=\"Militancy on decline in J&amp;K, needs time to end: CRPF\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47286495,width-300,resizemode-4/Militancy-JK.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47286495,width-300,resizemode-4/Militancy-JK.jpg"},"content":"SRINAGAR: Militancy in Jammu &amp; Kashmir is on the decline but it will take some more time to finish it completely, CRPF director general Prakash Mishra said here on Thursday. \"The graph of militancy is on the decline in Jammu &amp; Kashmir, but it will take more time to finish it completely,\" the chief of the Central Reserve Police Force (CRPF) told the media on the sidelines of a CRPF recruits passing out parade here. He said there was growing enthusiasm among the local youth to join the CRPF which was quite \"encouraging\". Mishra said the CRPF would discharge its duties effectively in providing security during the forthcoming Amarnath Yatra together with the state police and other security agencies. The CRPF official also visited the spot in Anantnag district where two troopers were killed by guerrillas in a hit and run attack earlier this week.","source":"TimesOfIndia","id":"f482a19c-087b-4cca-90c5-08dcb35d8825","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"PM Narendra Modi, Xi Jinping Visit Giant Wild Goose Pagoda","link":"http://feedproxy.google.com/~r/ndtv/Lsgd/~3/qttZZRAGciM/story01.htm","description":"Prime Minister Narendra Modi and Chinese President Xi Jinping today visited the iconic Giant Wild Goose Pagoda built in 652 AD in recognition of monk Hiuen Tsang's 17-year-long journey to India and hi...","date":"Thu May 14 09:38:15 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"PM Narendra Modi, Xi Jinping Visit Giant Wild Goose Pagoda\" alt=\"PM Narendra Modi, Xi Jinping Visit Giant Wild Goose Pagoda\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-05/modi-xi-jinping_650x400_41431603724.jpg\">","sort":"http://i.ndtvimg.com/i/2015-05/modi-xi-jinping_650x400_41431603724.jpg"},"content":"Xi'an:  Prime Minister Narendra Modi and Chinese President Xi Jinping today visited the iconic Giant Wild Goose Pagoda built in 652 AD in recognition of monk Hiuen Tsang's 17-year-long journey to India and his efforts to popularise Buddhism in China. Mr Modi and Mr Xi visited the Pagoda after holding wide-ranging bilateral talks here. Prime Minister Modi also gifted a Bodhi sapling to the temple. In turn, the Abbot of the monastery gifted a figurine of Hiuen Tsang, also known as Xuan Zang, to Mr Modi. Mr Xi and Mr Modi also posed for the photographers while shaking hands in front of the monument. The Giant Wild Goose Pagoda is a Buddhist pagoda located in southern Xi'an. It was built in 652 AD, during the Tang dynasty and originally had five storeys. The structure was rebuilt in 704 AD during the reign of empress Wu Zetian and its exterior brick facade was renovated during the reign of emperor Gaozang of Tang (649-683). Today, it stands at a height of 64 metres. Hiuen Tsang undertook the journey to India through the ancient Silk Road and returned home after the 17-year sojourn with precious Buddhist scriptures. One of the Pagoda's many functions was to hold sutra and figurines of the Buddha that were brought to China from India by Hiuen Tsang.  ","source":"NDTV","id":"b61379f7-0ef6-4a38-9da4-0f63f9fa7eb2","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"During Modi's visit, Chinese state TV shows Indian map without Arunachal Pradesh and Jammu & Kashmir","link":"http://timesofindia.feedsportal.com/c/33039/f/533916/s/46501abc/sc/7/l/0Ltimesofindia0Bindiatimes0N0Cindia0CDuring0EModis0Evisit0EChinese0Estate0ETV0Eshows0EIndian0Emap0Ewithout0EArunachal0EPradesh0Eand0EJammu0EKashmir0Carticleshow0C47286370A0Bcms/story01.htm","description":"A controversy was kicked up on Thursday with China's state-owned television CCTV showing India's map without Jammu & Kashmir and Arunachal Pradesh while reporting on Prime Minister Narendra Modi's visit.","date":"Thu May 14 09:33:06 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"During Modi's visit, Chinese state TV shows Indian map without Arunachal Pradesh and Jammu &amp; Kashmir\" title=\"During Modi's visit, Chinese state TV shows Indian map without Arunachal Pradesh and Jammu &amp; Kashmir\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47286374,width-300,resizemode-4/India-China-Map-I.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47286374,width-300,resizemode-4/India-China-Map-I.jpg"},"content":"BEIJING/NEW DELHI: A controversy was kicked up on Thursday with China's state-owned television CCTV showing India's map without Jammu &amp; Kashmir and Arunachal Pradesh while reporting on Prime Minister Narendra Modi's visit. Complete coverage — PM Modi's China visit The wrong map was displayed during a bulletin when Modi was in Xi'an city where he held talks with Chinese President Xi Jinping in his hometown. China has been laying territorial claim over Arunachal Pradesh and parts of Jammu &amp; Kashmir but India has been strongly resisting it. READ ALSO: Modi, Xi discuss ways to strengthen trust between two countries The unresolved boundary issue has been a sticking point in the relations between the two major Asian countries and both are making efforts to settle it through special representatives' talks. The special representatives have held 18 rounds of discussions so far. As it happened: Modi in China — Day 1 China says the border dispute is confined only to 2,000 kms mostly in Arunachal Pradesh whereas India asserts that the dispute covered the western side of the border spanning to about 4,000km, especially the Aksai Chin area ceded to China by Pakistan.","source":"TimesOfIndia","id":"588ed528-9a56-4e92-aa79-3a7ed99db77b","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"President Pranab Mukherjee Greets Paraguay on Independence Day","link":"http://feedproxy.google.com/~r/ndtv/Lsgd/~3/QMIj600wyVg/story01.htm","description":"President Pranab Mukherjee on Thursday greeted the government and the people of Paraguay on the eve of the country's independence day.","date":"Thu May 14 09:30:21 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"President Pranab Mukherjee Greets Paraguay on Independence Day\" alt=\"President Pranab Mukherjee Greets Paraguay on Independence Day\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-04/pranab-mukherjee_650x400_81428795253.jpg\">","sort":"http://i.ndtvimg.com/i/2015-04/pranab-mukherjee_650x400_81428795253.jpg"},"content":"President Pranab Mukherjee on Thursday greeted the government and the people of Paraguay on the eve of the country's independence day. \"On behalf of the government and the people of India and on my own behalf, it gives me great pleasure to convey to you warm greetings and felicitations on the occasion of your independence day,\" the President said in his message to Paraguay's President Horacio Manuel Cartes Jara. \"India and Paraguay have always enjoyed warm and friendly relations. It is a matter of immense satisfaction to note that our mutually beneficial relationship continues to grow and diversify. I am confident that our relations will assume greater depth and substance in the years to come,\" he said. The landlocked South American country got its independence from Spain in 1811.","source":"NDTV","id":"a94a94dc-271e-463b-866d-febf07bbc751","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"New Delhi condemns Kabul attack","link":"http://www.thehindu.com/news/national/new-delhi-condemns-kabul-attack/article7206202.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"India on Thursday condemned the Taliban attack at a hotel in Afghanistan, which claimed the lives of four Indian nationals who were visiting Kabul on work. The attack, which left 15 people, includ...","date":"Thu May 14 09:32:45 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"India on Thursday condemned the Taliban attack at a hotel in Afghanistan, which claimed the lives of four Indian nationals who were visiting Kabul on work. The attack, which left 15 people, including one American and two Italians dead, and several injured, took place in Park Palace hotel in Kabul late on Wednesday. Prime Minister Narendra Modi who is visiting China, spoke to the Afghan President Ashraf Ghani to express condolence and assured him of India’s support in fighting terror. “Spoke to President @ashrafghani &amp; offered condolences on loss of lives due to the Kabul attack. We are one when it comes to fighting terror,” he tweeted. Even as initial reports indicated that the Indian Ambassador to Kabul, Amar Sinha was the target of the Taliban forces, an official at the Embassy said he was not scheduled to be present at the hotel, where a concert was planned. Among those who lost their lives are Dr. Martha Farrell, director of Participatory Research in Asia (PRIA), who was on an official assignment and Kochi resident Mathew George who had gone to the Indian Embassy in Kabul for auditing purposes. The names of two other victims of the attack are R.K. Bhatti from Chandigarh and Satish Chandra Nidumukkala from Andhra Pradesh who were also on work. The Embassy in Kabul issued a statement condoning the deaths: “We stand in solidarity and sympathy with the bereaved families and the injured, and convey our heartfelt condolences to the people who lost their lives.” While conveying the grief expressed by the Afghan leadership over the deaths, the Embassy said leaders in Kabul appreciate the contributions of Indians who are working there for the socio-economic development of the country. “The four brave Indians who lost their lives in the Park Palace attack will be remembered for their selfless contribution to friendship between our nations. The Mission also appreciates the Afghan Security forces for their valiant effort to evacuate the civilians from the hotel and for neutralising the terrorist in the yesterday’s attack,” the Embassy said in the statement. Keywords: Afghanistan, Kabul, Indians, Americans Post Comment 4 Indians killed in Afghan guest house siege: official sourcesMay 14, 2015 More In: National | News Tweet","source":"THEHINDU","id":"6886b20e-9f4f-4784-8a79-98d274abc391","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Rajnath Singh meets RSS chief Mohan Bhagwat, discusses national political scenario","link":"http://indianexpress.com/article/india/india-others/rajnath-singh-meets-rss-chief-mohan-bhagwat-discusses-national-political-scenario/","description":"Sources said that important issues including the land bill and Ram temple figured in the interaction.","date":"Thu May 14 09:28:38 GMT-05:00 2015","image":{"detail":"<img class=\"size-full wp-image-2341869\" src=\"http://images.indianexpress.com/2015/04/rajnath_759.jpg\" alt=\"Rajnath singh, RSS, Mohan Bhagwat\" width=\"759\" height=\"422\">","sort":"http://images.indianexpress.com/2015/04/rajnath_759.jpg"},"content":"Union Home Minister Rajnath Singh on Thursday met RSS chief Mohan Bhagwat at the Sangh headquarters here and discussed the national political scenario as the Narendra Modi government at the Centre is completing its first year in power. Though Singh declined to comment on what transpired at the two-hour closed door meeting with Bhagwat, sources said that important issues including the land bill figured in the interaction. Related Rajnath,RSS chief discuss BJP's future Strict action against those who praise Jinnah: Rajnath RSS will not interfere in internal matters of BJP: Bhagwat The meeting also assumed significance in the backdrop of Singh’s recent statement that the government has no plans to come out with a legislation on building Ram temple in Ayodhya since BJP does not have majority of its own in the Rajya Sabha and that the government would wait for Supreme Court verdict on the issue. When asked by reporters on the topics that figured during his discussion with the Sangh chief, Singh’s curt reply was “Our bonding will continue.” He mentioned that this was his first visit to Nagpur after becoming Home Minister and since he is a Swayayamsewak (RSS volunteer), he will keep visiting RSS leaders. The minister was tight-lipped over criticism by a section of saints who were irked with his take on the Ram temple issue.","source":"INDIAN EXPRESS","id":"00012bb5-1a86-4c84-9f5b-d0d11f5090fc","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"ISIS killed 39 Indian hostages, Iraq survivor says","link":"http://timesofindia.feedsportal.com/c/33039/f/533916/s/465003e7/sc/7/l/0Ltimesofindia0Bindiatimes0N0Cindia0CISIS0Ekilled0E390EIndian0Ehostages0EIraq0Esurvivor0Esays0Carticleshow0C472859470Bcms/story01.htm","description":"A man from Punjab who escaped from the clutches of the ISIS in June 2014 claimed on Thursday that 39 Indians taken hostage have been killed.","date":"Thu May 14 08:53:37 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"ISIS killed 39 Indian hostages, Iraq survivor says\" title=\"ISIS killed 39 Indian hostages, Iraq survivor says\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47285977,width-300,resizemode-4/ISIS-VI.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47285977,width-300,resizemode-4/ISIS-VI.jpg"},"content":"CHANDIGARH: A man from Punjab who escaped from the clutches of the ISIS in June 2014 claimed on Thursday that 39 Indians taken hostage have been killed. External affairs minister Sushma Swaraj said in New Delhi that she did not believe the claims and her own sources felt the Indian nationals were still alive. Harjit Masih, 25, told the media in Mohali town adjoining Chandigarh and claimed that the 39 Indians, mostly from Punjab, were attacked by the Islamic State (ISIS) jihadists and killed. \"The ISIS came and kidnapped us and took us to another place. We were 40 Indians and about 50 Bangladeshis. They assured us that our passports would come and we will be allowed to leave for India,\" Masih said. READ ALSO: Govt believes 39 Indians in ISIS captivity still alive \"They (ISIS) handed us over to another group (of terrorists) who took us to another place. Later, they put us in a room and started firing. Everyone around me fell. I kept lying there and later escaped,\" he said. In New Delhi, Sushma Swaraj disputed Masih's claims and said her sources had not indicated that the Indian nationals were dead. \"We are not sparing any efforts to find them. We are hopeful that we will be able to find them and bring them back home. I have eight different sources who are saying they are alive,\" Sushma Swaraj told the media after families of the hostages met her in New Delhi on Thursday. \"Harjit Masih left our protection on his own. He was not under detection,\" Sushma Swaraj said. READ ALSO: Sushma seeks Turkey's help for release of Indian hostages from ISIS custody The family of Masih had earlier claimed that he was kept under detention after his escape and return from Iraq. \"There is no reason to believe him. If we believe him, it will mean that we end our search. I don't want to give up hope on this and we are looking for proof,\" Sushma Swaraj said. The Indian nationals were taken hostage by the ISIS on June 11 last year in northern Iraq's Mosul town. Their families have met Sushma Swaraj and other leaders in New Delhi and Chandigarh to know the whereabouts of their kin stuck in Iraq.","source":"TimesOfIndia","id":"13944d72-c72f-46b8-a98c-dfe7f3a817d0","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Maharashtra receives approval letter for its first Indian Institute of Information Technology","link":"http://ibnlive.in.com/news/maharashtra-receives-approval-letter-for-its-first-indian-institute-of-information-technology/545629-37-64.html","description":"\"Glad to inform that Maharashtra gets its first Indian Institute of Information Technology (IIIT). It will be located at Nagpur,\" Chief Minister Devendra Fadnavis said.","date":"Thu May 14 08:25:37 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/10_2014/devendra_fadnavis_new_338x7.jpg\" width=\"669px\" title=\"Maharashtra receives approval letter for its first Indian Institute of Information Technology\" alt=\"Maharashtra receives approval letter for its first Indian Institute of Information Technology\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/10_2014/devendra_fadnavis_new_338x7.jpg"},"content":"Mumbai: Maharashtra government has received approval letter for the state's first Indian Institute of Information Technology (IIIT) to be set up in Nagpur. \"Glad to inform that Maharashtra gets its first Indian Institute of Information Technology (IIIT). It will be located at Nagpur,\" Chief Minister Devendra Fadnavis said. \"The Government of Maharashtra received the IIIT approval letter today. Thanks to Union HRD Ministry,\" Fadnavis tweeted on Wednesday night. Maharashtra has received approval letter for the state's first Indian Institute of Information Technology (IIIT) to be set up in Nagpur. #iiit in nagpur #devendra fadnavis #maharashtra government #smriti irani The Chief Minister also thanked Minister of Human Resource Development (MHRD) Smirti Irani for the approval. Earlier there were two options to set up the IIIT in Maharashtra, either in Pune or at Nagpur. In 2008, the HRD ministry decided to set up IIITs during the 11th Five Year Plan (2007-12) to address the challenges faced by the Indian IT-industry and growth of the domestic market in the sector. It was decided to set up 20 IIITs on private-public partnership (PPP) in the country where the Centre and state along with the industry would be stakeholders.","source":"IBNLIVE","id":"ca251c10-565d-40ad-8a20-a08bf8d6a6e9","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Two months after end of prohibition, Mizoram town’s vineyards enter industry-made liquor map","link":"http://indianexpress.com/article/india/india-others/two-months-after-end-of-prohibition-mizoram-towns-vineyards-enter-industry-made-liquor-map/","description":"Radiant Manufacturers CEO Bheeshma Chand said the grape juice concentrate will be used to make red sparkling wine.","date":"Thu May 14 08:41:49 GMT-05:00 2015","image":{"detail":null,"sort":"http://images.indianexpress.com/2015/02/m_id_277814_liquor_tax.jpg?w=759"},"content":"Just two months since the lifting of prohibition in Mizoram, an eastern town has entered the industry-produced liquor map by supplying 16,000 liters of grape juice concentrate as an initial consignment that will be used to make a well-known regional wine brand of the North-East. The consignment, produced by the Champhai Grape Grower’s Society and loaded into two trucks, was flagged off by Mizoram’s Horticulture Minister P C Lalthanliana from Champhai town on Thursday. The grape juice concentrate is headed towards the Guwahati distillery of Radiant Manufacturers, which has for close to a decade been making and selling the Vihno Porto port wine brand through the North-East region and Bhutan. The company entered into an agreement with the CGGS, which is made up of 279 families that own vineyards, back in January. According to the agreement, the society will supply 3.6 lakh liters to the alcohol manufacturer per year. Radiant Manufacturers CEO Bheeshma Chand, 29, said the grape juice concentrate will be used to make red sparkling wine and, in the future, perhaps brandy. Chand said his company has been using grape juice concentrate sourced from Goa, Maharashtra and Karnataka for their wine brand, but said the quality of grapes grown in Mizoram is of a better quality. The proximity between his facilities and the raw material (road travel by truck between Champhai and Guwahati is roughly three days). Champhai and the nearby village of Hnahlan, about 54 kms away, host the first and only vineyards in the whole of India’s North-East region. Both places set up wineries in the late-2000s and have been manufacturing two brands of port-wine under the brand names Zawlaidi and Zowine, which were and continue to be sold locally. They were for more than half a decade the only legal drinks available in Mizoram because of prohibition. But CGGS assistant-secretary C Zohmingliana admitted that with the lifting of prohibition in July last year and the formal opening of outlets this March, the brands have suffered a hit since perceived better IMFL brands from elsewhere began entering the state legally. He pegs the reduction in demand for their wine brands since then as more than half of what it used to be before.","source":"INDIAN EXPRESS","id":"9b42b01b-58c1-4656-a59e-df297a8de899","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Modi's Handwriting Takes a Hit Between His Visit in Seychelles and China","link":"http://www.newindianexpress.com/nation/Modis-Handwriting-Takes-a-Hit-Between-His-Visit-in-Seychelles-and-China/2015/05/14/article2814235.ece","description":"Prime Minister Narendra Modi's hectic shedule has reportedly had an affect on his handwriting as was evident from the latest Tweets by Ministry of External Affairs spokesperson Vikar Swarup.","date":"Thu May 14 08:41:03 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/modi_handwriting.JPG/2015/05/14/article2814245.ece/alternates/w620/modi_handwriting.JPG\" alt=\"\">","sort":"http://media.newindianexpress.com/modi_handwriting.JPG/2015/05/14/article2814245.ece/alternates/w620/modi_handwriting.JPG"},"content":"Prime Minister Narendra Modi's hectic shedule has reportedly had an affect on his handwriting as was evident from the latest Tweets by Ministry of External Affairs spokesperson Vikar Swarup. Modi's handwriting was clear and could be read when he wrote a message for people of Seychelles in Visitors Book at State House, Victoria.   People of Seychelles have made me feel as 1 of their own -PM @narendramodi in Visitors Book at State House, Victoria pic.twitter.com/QKrnMqCZXl— Vikas Swarup (@MEAIndia) March 11, 2015 But on the other his recent letter addressed to the letter Terracotta Museum during his current tour of China shows that his handwriting was considerably indecipherable.   Earlier at the Terracotta Museum, PM @narendramodi had a special message pic.twitter.com/3nGmiwte5Y— Vikas Swarup (@MEAIndia) May 14, 2015","source":"NEW INDIAN EXPRESS","id":"4d777689-6418-4f0a-b392-b0c2a06e0bf3","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Strengthen Party Base at Grassroots to Fight Communal Forces: JK Congress Chief","link":"http://www.newindianexpress.com/nation/Strengthen-Party-Base-at-Grassroots-to-Fight-Communal-Forces-JK-Congress-Chief/2015/05/14/article2814241.ece","description":"Congress is the largest party in the country having its presence in over six lakh villages, party's Jammu and Kashmir President Ghulam Ahmed Mir said.","date":"Thu May 14 08:27:58 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"JAMMU: Congress is the largest party in the country having its presence in over six lakh villages, party's Jammu and Kashmir President Ghulam Ahmed Mir said today and urged party leaders to strengthen its organisation at the grassroots level to \"fight the communal and divisive forces\". \"Congress is the largest party in the country having its flag and members in every nook and corner of the county. It has members in each over six Lakh villages in the country\" President of the Pradesh Congress Committee Ghulam Ahmed Mir said here today. He said the \"beauty of the Congress\" was that it has its strength in each and every section of the pluralistic society of India because of its secular policies. \"It is acceptable to people of each and every religion, section, caste, creed and color of our heterogeneous country. Unity in diversity is the beauty of this country, which is truly reflected in the fundamental policies of the Congress,\" he said. Mir was speaking at a meeting held to review the ongoing membership drive of the party in Jammu province at the party headquarters here. He asked party leaders and workers to intensify the campaign and make it a grand success. Mir urged the Congress men to expand the grassroots base of the party in order to strengthen the \"secular and democratic forces and to fight the communal and divisive forces in the state\". The Congress leader also reviewed preparations for the blood donation camp to be held in Jammu and Srinagar on the occasion of \"Balidan Divas\", the death anniversary of Rajiv Gandhi, on May 21. He asked party leaders and Youth Congress to mobilise more and more youths for the camp.","source":"NEW INDIAN EXPRESS","id":"e8d0d2c7-369a-4a90-b62e-dbc85c844899","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Melinda Gates 'optimist' after visiting rural India","link":"http://timesofindia.feedsportal.com/c/33039/f/533916/s/464ffcad/sc/31/l/0Ltimesofindia0Bindiatimes0N0Cindia0CMelinda0EGates0Eoptimist0Eafter0Evisiting0Erural0EIndia0Carticleshow0C472856120Bcms/story01.htm","description":"“I got impatient for progress when a group of mothers sitting with me on mats under a shady tree told me that almost every single one of them has lost a child to disease. It’s one thing to read about child mortality in a UN report. It’s something completely different to meet the mothers forced to bear its devastating realities.”","date":"Thu May 14 08:22:11 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://timesofindia.indiatimes.com/photo/34824568.cms"},"content":"RANCHI: \"I got impatient for progress when a group of mothers sitting with me on mats under a shady tree told me that almost every single one of them has lost a child to disease. It's one thing to read about child mortality in a UN report. It's something completely different to meet the mothers forced to bear its devastating realities.\" This is how Melinda Gates, co-chair Bill and Melinda Gates Foundation (BMGF), sums up her experience of visiting Jharkhand and Bihar villages recently. Sharing stories of three women, Beronika and Sabita of Jharkhand and Sister Sudha of Bihar, she explains why she prefers calling herself an impatient optimist. \"I left India even more convinced that investing in women and girls is the key to accelerating progress — and was more optimistic than ever,\" she admits. Melinda was in Jharkhand on April 19 spending time with the women in Sonadari village under Torpa block of Khunti to learn from them, the mantra of 'group-strength' (SHGs) as an agent of social change. Writing about the three women in her home page of social networking site, Melinda speaks about Sabita Devi who rarely left home. She spent her days isolated within the four mud walls and low ceiling of her house in rural Jharkhand, a developing state in eastern India. Like many women in the world's poorest places, she was isolated from society. Even in her own village, no one knew her name. Melinda writes adding, \"But then, on December 20, 2001, Sabita joined a self-help group (SHG) which worked on the principle : Bring women together to talk about ways they can improve life for themselves and their families, and it will unlock women's potential to drive progress for their communities—and things chaged.\" Melinda during her day long stay in the village observed that Sabita and her fellow group members started learning about ways to improve their crop yields and increase their incomes. \"When I met them, they told me they had just put in an application for the village's first toilets. And are gearing to take on the area's growing alcohol problem,\" she writes with a concluding remark -Now everyone knows Sabita. Mentioning about another woman, Beronika Herenj from the same district, Melinda writes that today the family has enough food to eat three meals a day, all year long and a significant surplus to sell. \"Beronika told me that for most of her life, she lived under the constant threat of hunger. Her family's plot produced only enough food to feed the family for half the year. After they ran out of crops to eat, she and her six sons would survive for months on nothing but the jackfruit they picked from the nearby forest. Eventually, the family fell into debt and had to mortgage their land.--But then, in 2009, Beronika, too, joined a self-help group. With the group's support, she began farming new, more lucrative crops like mangoes and watermelons,\" Melinda writes, describing the group- power as catalyst for the economic turnaround of the family. \"When I asked what they plan to do with the extra income from their harvest, Kiran told me that she will finally be able to afford her dream of going to nursing school,\" Melinda adds in her post. Pradan, the NGO coordinating with BMGF in India explained her visit as a—trip to learn. Binju Abraham of Pradan, who managed Melinda's visit and interactions with the villagers said that she was interested to replicate Indian model of SHGs in other developing countries like Africa. Melinda in her post has said that India is moving in the right direction. \"More children than ever before are surviving to their fifth birthday. More women are surviving childbirth, and more infants are surviving their first, riskiest days,\" she observed.","source":"TimesOfIndia","id":"1a2e528d-3b14-470a-a0aa-6602c6135773","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Coal scam: Court frames additional charge of cheating on JIPL","link":"http://indianexpress.com/article/india/india-others/coal-scam-court-frames-additional-charge-of-cheating-on-jipl/","description":"As the court framed separate charge against the firm, the JIPL counsel contended that the accused might be prejudiced by it.","date":"Thu May 14 08:20:13 GMT-05:00 2015","image":{"detail":"<img class=\"wp-image-2360877 size-full\" src=\"http://images.indianexpress.com/2015/05/coal1.jpg\" alt=\"Coal scam, Coal India\" width=\"759\" height=\"422\">","sort":"http://images.indianexpress.com/2015/05/coal1.jpg"},"content":"A special court on Thursday framed a “separate charge” for the alleged offence of cheating against accused firm Jharkhand Ispat Pvt Ltd (JIPL) in a coal blocks allocation scam case. The court said that at the time of framing of charges earlier against JIPL and its two directors, R C Rungta and R S Rungta, who are also accused in the case, no “substantive charge” for offence under section 420 (cheating) of IPC was framed against the firm “even though the same was prima facie made out from the facts and circumstances of the case”. “Keeping in view the overall facts and circumstances of the case, a separate charge for the offence under section 420 IPC has been framed against accused M/s JIPL to which the AR (authorised representative) of the company pleaded not guilty and claimed trial,” Special CBI Judge Bharat Parashar said. Related Coal scam: Congress leader Naveen Jindal, Madhu Koda, 13 others summoned as accused SC asks CBI if it probed diversion of coal by companies Can't file any final report in coal cases: CBI to court The court noted that earlier charges for alleged offences under sections 120-B (criminal conspiracy), 467 (forgery of a valuable security), 468 (forgery for the purpose of cheating), 420 (cheating) and 471 (using as genuine a forged document) of IPC were framed against all the accused persons. As the court framed separate charge against the firm, the counsel, appearing for JIPL, contended that the accused might be prejudiced by it. The court, however, clarified, “it is directed that the accused shall be at liberty to point out as to in what manner, if any, they stand prejudiced by this addition of charge and thereafter the said issue will be decided as per law as and when raised”. JIPL’s counsel also said that the court should exercise its power under CrPC to amend the charge of conspiracy framed against the firm earlier. To this, the court said, “such a contention does not arise at all now” as this issue has already been dealt with by it. The case has been fixed for commencement of recording of prosecution evidence from June 3. JIPL and its two directors are accused of securing allotment of North Dhadu coal block in Jharkhand allegedly on the basis of false and forged documents. During the proceedings today, the court also allowed the separate applications filed by CBI seeking its permission to place on record certain documents related to the case and also to include three more names in the list of witnesses. “At the outset, I may state that undoubtedly CBI ought to have been careful in placing on record all the relevant and relied upon documents while filing the charge sheet,” the judge said. “However, if for one or the other reason some documents have not been placed on record then in the absence of there being no specific provision debarring CBI to file additional documents, such a right cannot be denied to them,” the court said. It also asked the agency to supply the copies of these documents to the accused. Both the Rungtas’ were granted bail by the court earlier after they had …continued »","source":"INDIAN EXPRESS","id":"c520b37e-5d67-4ff7-b6ed-cbb96055fc5c","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Delhi Government Ads With CM Kejriwal to be Removed","link":"http://www.newindianexpress.com/nation/Delhi-Government-Ads-With-CM-Kejriwal-to-be-Removed/2015/05/14/article2814232.ece","description":"The Delhi government's advertisements, featuring Chief Minister Arvind Kejriwal, seen across the national capital are soon to be taken out in pursuance of the Supreme Court order on government ads.","date":"Thu May 14 08:07:35 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"NEW DELHI: The Delhi government's advertisements, featuring Chief Minister Arvind Kejriwal, seen across the national capital are soon to be taken out in pursuance of the Supreme Court order on government ads. The ads, in print and one on TV released yesterday, have Kejriwal in them asking people to fight against bribery and corruption. Supreme Court had yesterday barred publication of photos of leaders in government advertisements except those of the President, Prime Minister and  the Chief Justice of India. \"We will comply with Supreme Court guideline and remove advertisements carrying picture of Chief Minister or any other Minister. All the print ads will be removed. We are yet to read the guideline on broadcast of TV commercials, but even they will be removed if they comes under it,\" a senior government official said. Delhi government has put up several banner advertisements of the recently launched anti-corruption helpline - 1031 - across the city which also carries pictures of Kejriwal. Government is likely to remove these ads today. Yesterday, a 39-second long TV commercial had been released in which Kejriwal speaks about how his government was able to pay higher compensation to farmers hit by unseasonal rains, due to check in corruption. \"This year unseasonal rain damaged crops of farmers and our government announced compensation of Rs 50,000 per hectare. How did we do it when other parties are saying that government does not have money? \"This is result of decline in corruption in Delhi and the money we saved through it was used for paying compensation to farmers,\" Kejriwal said in the video. Asking people to join him in the fight, Kejriwal said, \"I need you support in the fight against corruption. Today, let's swear that neither will we take bribe nor give bribe.\" However, the government may pull out this advertisement too, the official suggested.","source":"NEW INDIAN EXPRESS","id":"155d78a2-beb2-4ef6-8d49-ab5e303fec15","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Foreign Secretary S Jaishankar talks about Modi, Jinping meet","link":"http://ibnlive.in.com/news/foreign-secretary-s-jaishankar-talks-about-modi-jinping-meet/545619-3.html","description":"PM Modi visit to China included the hour long talks about the border issues and how to develop counter terrorism co-operation against terrorism as both the countries needed lot of discussion on strenghtening and increasing convergance.","date":"Thu May 14 08:01:53 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/ibnhome/article_new/facebook-icon-bt.png\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/ibnhome/article_new/facebook-icon-bt.png"},"content":"PM Modi visit to China included the hour long talks about the border issues and how to develop counter terrorism co-operation against terrorism as both the countries needed lot of discussion on strenghtening and increasing convergance.","source":"IBNLIVE","id":"80906051-3c70-4844-a077-fd05408a2ad7","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Two die in road accident","link":"http://www.thehindu.com/news/cities/Hyderabad/two-die-in-road-accident/article7205975.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Two youngsters died in the early hours of Thursday when the bike they were riding on rammed into a tree at Monikunta Hill in Hayathnagar on the city outskirts. The victims, Venkata Narayana and Ra...","date":"Thu May 14 07:58:19 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"Two youngsters died in the early hours of Thursday when the bike they were riding on rammed into a tree at Monikunta Hill in Hayathnagar on the city outskirts. The victims, Venkata Narayana and Rambabu, both below 21 years of age, were working as waiters in Dolphin Hotel in Ramoji Film City, Hayathnagar, Sub-Inspector of Police G. Manmadh Kumar said. The duo was returning to their quarters in Omarkhanguda from Koheda when the accident occurred at around 1 a.m. “Apparently, they failed to notice the tree located at a turn and hit it. Both suffered head injuries. Death was instant,” the SI said. Post Comment More In: Hyderabad | Telangana | National Tweet","source":"THEHINDU","id":"f3d7e8b4-f19e-42ee-b743-1b75beb1fcc9","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Three drown in Swarnamukhi river","link":"http://www.thehindu.com/news/national/andhra-pradesh/three-drown-in-swarnamukhi-river/article7205949.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"A pal of gloom descended on Lakshmipuram of Sitanagaram mandal of Vizianagaram District on Thursday with the confirmation of deaths of three persons who got drowned in Swarnamukhi River. ...","date":"Thu May 14 07:52:42 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"A pal of gloom descended on Lakshmipuram of Sitanagaram mandal of Vizianagaram District on Thursday with the confirmation of deaths of three persons who got drowned in Swarnamukhi River. The deceased were identified as Krishna (42) and his relatives Mahendra (9) and Nagendra (7). According to the police, both kids who came to Lakshmipuram for summer vacation went for swimming along with their uncle. They thought that there was not much depth and nothing would happen while swimming. The kids got drowned and Krishna also lost his life while trying to save them. Sitanagaram police sent bodies for postmortem and registered a case. Post Comment More In: Andhra Pradesh | National | Visakhapatnam Tweet","source":"THEHINDU","id":"540a2578-c308-4502-98d8-9734ecd4db8c","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Naxalite violence has come down in last decade: Rajnath","link":"http://timesofindia.feedsportal.com/c/33039/f/533916/s/464f9f7d/sc/7/l/0Ltimesofindia0Bindiatimes0N0Cindia0CNaxalite0Eviolence0Ehas0Ecome0Edown0Ein0Elast0Edecade0ERajnath0Carticleshow0C472852120Bcms/story01.htm","description":"Stating that there has been a 20-25 per cent drop in Naxalite violence in the rebel-affected areas in last 10 to 12 years, Union home minister Rajnath Singh on Thursday said though the government wants to resolve the vexed issue by giving a thrust to development, the ultras pose a hindrance in the process.","date":"Thu May 14 07:50:30 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Naxalite violence has come down in last decade: Rajnath\" title=\"Naxalite violence has come down in last decade: Rajnath\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47285226,width-300,resizemode-4/Rajnath-Singh.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47285226,width-300,resizemode-4/Rajnath-Singh.jpg"},"content":"NAGPUR: Stating that there has been a 20-25 per cent drop in Naxalite violence in the rebel-affected areas in last 10 to 12 years, Union home minister Rajnath Singh on Thursday said though the government wants to resolve the vexed issue by giving a thrust to development, the ultras pose a hindrance in the process. \"There has been a steady drop in number of Naxalite-related incidents over a period of time and the government is serious in tackling the issue,\" Singh told reporters here after reviewing anti-Naxalite operations of eastern Vidarbha region in Maharashtra. The government is keen to resolve the issue by giving thrust to development of affected regions, but the Naxalites are a big obstacle in the process, he said. The government has accepted Naxaliteism as a challenge and will provide all assistance in dealing with the outlawed Maoists, he said. Refusing to reveal the details of the strategy to tackle the Naxalite menace, he said the government was working on an integrated action plan. Singh reviewed with senior police officials the anti-Naxalite operations and preparedness of the security forces at the state guest house Ravi Bhawan. Maharashtra director general of police Sanjeev Dayal, former DG, CRPF, advisor to Home Ministry Vijay Kymar, a number of IGs, DIGs and SPs of Naxalite-affected districts were present at the meeting.","source":"TimesOfIndia","id":"2f85ecb8-0b34-47ca-9e44-ea58eb555849","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Cheap Flight Tickets: Book Jet Airways flight tickets at Rs 1,280","link":"http://www.oneindia.com/india/book-jet-airways-flight-tickets-at-rs-1280-cheap-fligt-tickets-limited-offer-1747021.html","description":"New Delhi, May 14: Jet Airways has come up with another interesting offer. The domestic carrier has been offering flight tickets at Rs 1,280. The offer is available only on advance bookings for select flights within India. Jet Airways has","date":"Thu May 14 07:45:12 GMT-05:00 2015","image":{"detail":null,"sort":"http://www.oneindia.com/img/2015/05/14-1431607484-jet-airways-600.jpg"},"content":"New Delhi, May 14: Jet Airways has come up with another interesting offer. The domestic carrier has been offering flight tickets at Rs 1,280. The offer is available only on advance bookings for select flights within India. Jet Airways has set a few rules for the interested people who want to avail the offer. According to the rules set by the airline, tickets must be purchased a minimum of 60 days prior departure. Meanwhile, AirAsia too has announced that flight tickets of the airline will be available at Rs 1,290. While AirAsia's Bangalore to Kochi flight ticket will cost a passenger Rs 1,290, Bangalore to Delhi flight ticket, under the same scheme, will cost the traveller Rs3,790. OneIndia News","source":"ONEINDIA","id":"27ca4c62-8cb7-441b-bf84-69927a8f9046","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Bihar shocker! Couple burnt alive allegedly on village panchayat's order for eloping","link":"http://www.oneindia.com/india/bihar-shocker-couple-burnt-alive-allegedly-on-village-panchayat-order-eloping-1747020.html","description":"Gaya, May 14: In yet another shocking incident, a man and a teenager were set on fire as the villagers stood as mute spectators in Bihar's Gaya. As per a NDTV report, the man and teenager (girl) had eloped","date":"Thu May 14 07:39:44 GMT-05:00 2015","image":{"detail":null,"sort":"http://www.oneindia.com/img/2015/05/14-1431607029-bihar.jpg"},"content":"Gaya, May 14: In yet another shocking incident, a man and a teenager were set on fire as the villagers stood as mute spectators in Bihar's Gaya. As per a NDTV report, the man and teenager (girl) had eloped and were hunted down by the girl's family. Later, the two were beaten mercilessly and set on fire, killed allegedly on the the orders of the village panchayat. While all this was happening, no one called the police, but the incident was later reported by a neigbouring village. Also read: Chhattisgarh shocker: Newly-wed couple burns nephew, niece alive for disturbing their privacy As per the report, \"The man was allegedly married and a father of three children, and used to come to the village frequently to visit his in-laws. That is how he had reportedly met the teenager.\" In yet another incident which shocked everyone, a newly married couple in Chhattisgarh's Durg district allegedly burnt their niece and nephew alive, just because they were disturbing their privacy. Police have reportedly arrested the couple, who now face murder charges. Both the kids were burnt to death by the uncle and aunt. OneIndia News (With inputs from agencies)","source":"ONEINDIA","id":"3c161a3a-3ee8-4a7a-bfe2-3c0da0b96549","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"This is the place where world's happiest children live!","link":"http://www.oneindia.com/india/this-is-the-place-where-world-s-happiest-children-live-1747056.html","description":"Berlin, May 14: Children are generally happy worldwide, but those in European countries are more satisfied with their friendships while kids in Africa are happier with their school lives, a study conducted across 15 countries has found. The study of","date":"Thu May 14 07:05:52 GMT-05:00 2015","image":{"detail":null,"sort":"http://www.oneindia.com/img/2015/05/14-1431608095-happiness.jpg"},"content":"Berlin, May 14: Children are generally happy worldwide, but those in European countries are more satisfied with their friendships while kids in Africa are happier with their school lives, a study conducted across 15 countries has found. The study of 50,000 children by Goethe University in Frankfurt also found that children in northern European countries are particularly dissatisfied with their appearance and self-confidence. The survey was undertaken in 2013 and 2014 in 15 countries - Algeria, Colombia, Estonia, Ethiopia, Germany, Israel, Nepal, Norway, Poland, Romania, South Africa, South Korea, Spain, Turkey and the UK. Also read: India slips on World Happiness Index, ranks 117 out of 158 nations Most of the children in the study rated their satisfaction with life as a whole (on a scale from zero to ten) positively, but the percentage of children with very high well-being (10 out of 10) varied from around 78 per cent in Turkey and 77 per cent in Romania and Colombia to around 40 per cent in South Korea. The percentage with low well-being (less than 5 out of 10) varied from less than 2 per cent in Romania and Colombia to over 7 per cent in South Korea and South Africa. The survey asked children about all key aspects of their lives including their family and home life, friendships, money and possessions, school life, local area, time use, personal well-being, views on children's rights, and their overall happiness. Children's well-being decreased between the ages of 10 and 12 in many European countries and in South Korea, while there was no age pattern in other countries such as Israel and Ethiopia. Also read: Switzerland tops in world's happiest country list Overall happiness did not vary between girls and boys, but there were significant gender differences in satisfaction with oneself (body, appearance and self-confidence) in Europe and South Korea, but not in the other countries in the survey in Asia, Africa and South America. The study found substantial differences between countries in how children spent their time. For example, children tended to report spending much more time on homework in Estonia and Poland than in South Korea and England. Children in Poland, Norway and Israel spent the most time playing sports and exercising. Children in some countries (including Algeria, Nepal and South Africa) spent much more time caring for siblings and other family members than in other countries (such as Germany, Turkey and South Korea). PTI ","source":"ONEINDIA","id":"a92d1972-4f8d-4556-a258-453e8fd1f887","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"1984 riot victims protest demanding increased compensation","link":"http://www.oneindia.com/india/1984-riot-victims-protest-demanding-increased-compensation-1747020.html","description":"New Delhi, May 14: Victims of 1984 anti-Sikh riots today staged a protest at Jantar Mantar here demanding increased compensation from the Centre and Delhi government. A peace march was taken out by the protestors, including dozens of women who","date":"Thu May 14 06:55:56 GMT-05:00 2015","image":{"detail":null,"sort":"http://www.oneindia.com/img/2015/05/14-1431607123-newdelhi.jpg"},"content":"New Delhi, May 14: Victims of 1984 anti-Sikh riots today staged a protest at Jantar Mantar here demanding increased compensation from the Centre and Delhi government. A peace march was taken out by the protestors, including dozens of women who were widowed in the riots, from Gurdwara Bangla Sahib to Jantar Mantar. The government had announced additional compensation of Rs 5 lakh to the victims and in December last year the Union Home Minister Rajnath Singh had distributed cheques to 17 affected families, said Atma Singh Lubana, head of Victims of 1984 Anti Sikh Riots Society. Later, 2,500 other victims submitted their forms but they were yet to receive the increased compensation, he said. A delegation led by Lubana later met the Home Ministry officials to submit their memorandum pointing that \"Delhi government was not paying them increased compensation on the pretext that they had no budget for it\". \"The officials assured us that Home Ministry will write to the Delhi government for expediting payment of compensation,\" Lubana said. PTI ","source":"ONEINDIA","id":"1618d2f9-6463-4aa4-bdfc-c4d18ea797e1","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Complaint against Smriti Irani to be heard on June 1","link":"http://www.oneindia.com/india/complaint-against-smriti-irani-to-be-heard-on-june-1-1747038.html","description":"New Delhi, May 14: A court here on Thursday fixed June 1 to hear a complaint against Human Resource Development Minister Smriti Irani for allegedly misrepresenting facts in her election affidavit while imposing a cost of Rs.1,000 on the complainant for","date":"Thu May 14 06:54:02 GMT-05:00 2015","image":{"detail":null,"sort":"http://www.oneindia.com/img/2015/05/14-1431608044-smritiirani.jpg"},"content":"New Delhi, May 14: A court here on Thursday fixed June 1 to hear a complaint against Human Resource Development Minister Smriti Irani for allegedly misrepresenting facts in her election affidavit while imposing a cost of Rs.1,000 on the complainant for his non-appearance. Metropolitan Magistrate Akash Jain asked complainant Ahmer Khan to pay Rs.1,000 to Delhi Legal Service Authority after he failed to appear in the court. Khan, who could not appear as he was out of Delhi, had sought exemption from personal appearance. The court allowed his exemption application but still slapped the cost. Khan has filed a complaint last month seeking action against the minister for lying on oath about her educational qualification. According to the complaint, Irani, in an affidavit filed for the 2004 Lok Sabha election, declared herself to be a 1996 batch B.A. graduate from Delhi University but in her 2014 Lok Sabha election affidavit, stated she had done B.Com Part 1 in 1994 from Delhi University. \"It is evident from the contents of the affidavits filed by Irani that at best, only one of the depositions by her on oath in respect of her educational qualifications is correct,\" said the petitioner's counsel K.K. Manan. The petition further added that Irani also lied on oath about her assets and it also sought action against her for offences under the Representation of the People Act. IANS","source":"ONEINDIA","id":"8ff921e2-f592-491d-9ae6-cd4ddc0a686f","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Bidar school achieves 100% results in SSLC exams","link":"http://www.thehindu.com/news/national/karnataka/bidar-school-achieves-100-results-in-sslc-exams/article7205948.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Dr. Channabasava Pattaddevaru High Sschool in Kamal Nagar has achieved 100 per cent results in SSLC examinations. As many as 12 of the students have scored more than 90 per cent marks, 3...","date":"Thu May 14 07:51:26 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"Dr. Channabasava Pattaddevaru High Sschool in Kamal Nagar has achieved 100 per cent results in SSLC examinations. As many as 12 of the students have scored more than 90 per cent marks, 31 above 80 per cent, and 18 in first class. Trust president Sri Basavalinga Pattaddevaru, and others have congratulated the students. This is the eighth year of 100 per cent results, said a release by principal Prakash Mankari. Post Comment More In: Karnataka | National Tweet","source":"THEHINDU","id":"92e35689-cff2-4ba4-a258-373c40028211","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Hiremath releases documents on BDA’s exchange deeds","link":"http://www.thehindu.com/news/national/karnataka/hiremath-releases-documents-on-bdas-exchange-deeds/article7205938.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Seeks suspension of Shyam Bhat, demands inquiry","date":"Thu May 14 07:48:33 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"Seeks suspension of Shyam Bhat, demands inquiry Releasing documents on the ‘exchange deeds’ by BDA under Commissioner Shyam Bhat, Founder-President of Samaj Parivartan Samudaya (SPS) S.R. Hiremath alleged that Mr. Bhat had executed the deeds despite Additional Advocate General’s (AAG) advise against the execution. The deeds had been executed in the name of one Mr. Nagaraj. Addressing presspersons here on Thursday, Mr. Hiremath pointed out that Mr. Bhat’s predecessor Bharatlal Meena had rejected Mr. Nagaraj’s request for seeking alternate sites (for total 4.13 acres) in Arkavati Layout instead of Kempe Gowda Layout. Quoting the legal opinion given to BDA by AAG K.M. Nataraj, Mr. Hiremath said, “A power of attorney is, as is well known, a document of convenience and not document of conveyance. Under GPA no transfer can be affected to create any right of title in favour of the power of Attorney Holder and the power of Attorney holder can only execute the documents for and on behalf of the allottee and no land can be allotted in his name”. However, despite the clear legal opinion, Mr. Shyam Bhat had not only allotted alternate sites in the name of Mr. Nagaraj instead of the allottees, but also executed as many as four exchange deeds to allot sites with better road connectivity to benefit Mr. Nagaraj, which clearly spoke about the extent of illegalities and irregularities committed by the BDA commissioner, Mr. Hiremath said. Mr. Hiremath demanded immediate suspension of Mr. Shyam Bhat and urged the Chief Minister to hand over the issue for investigation to Justice Santosh Hegde. Post Comment More In: Karnataka | National Tweet","source":"THEHINDU","id":"8e86ebdb-bdfb-4e99-8004-ed6fa66caeff","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"More parties now opposing land bill: Congress","link":"http://indianexpress.com/article/india/india-others/more-parties-now-opposing-land-bill-congress/","description":"By now, the number of opposition parties including those which are not in the opposition, has swelled, said Azad.","date":"Thu May 14 07:47:18 GMT-05:00 2015","image":{"detail":"<img class=\"wp-image-2285539 size-full\" src=\"http://images.indianexpress.com/2015/02/ghulam-nabi-azad_759.jpg\" alt=\"Land bill, Congress, Congress Land bill Land acquisition bill, \" width=\"759\" height=\"422\">","sort":"http://images.indianexpress.com/2015/02/ghulam-nabi-azad_759.jpg"},"content":"The number of parties opposing the controversial land bill has “swelled” with some from the treasury benches joining the opposition bandwagon, Congress said on Thursday indicating that the government’s problems were far from over despite the bill being sent to a Joint Committee. “By now, the number of opposition parties including those which are not in the opposition, has swelled… They are not with government on the land bill,” Leader of the Opposition in the Rajya Sabha Ghulam Nabi Azad said. Addressing a press conference, along with Leader of Congress in the Lok Sabha Mallikarjun Kharge, Azad said earlier leaders of 14 opposition parties had marched to the Rashtrapati Bhavan on the issue. Related GST, land bills may go to House panels Land bill: Govt to prorogue parliament after March 20 to push land ordinance UPA land law fine, BJP was on board, so we will resist ordinance: Ghulam Nabi Azad Asked whether Congress was in favour of re-promulgation of the land ordinance, Azad said it was a matter for the government to decide after considering legal aspects. Dismissing speculation that there were differences within the Congress over participation in the Joint Committee, Azad said it would have been ideal if the Act brought by the UPA government had been allowed to continue. “As the government is adamant, let us go to parliamentary scrutiny,” he said. Noting that Congress President Sonia Gandhi and Vice President Rahul Gandhi guided the party in the just-concluded Budget Session, Kharge said they spoke on various issues ranging from farmers’ plight to net neutrality and transparency in government functioning. Seeking to dismiss government claims that the opposition put brakes on legislation-making initiatives, Kharge charged the Modi dispensation with “bulldozing” all bills through the Lok Sabha using its “brute majority” as the Congress was just 44 in a House of 543. This is “undemocratic” behaviour, he said. Both Kharge and Azad charged the government with making attempts to “escape” parliamentary scrutiny. Kharge said this was evident from the fact that out of a total of 55 bills only five or six have been referred to the standing committee. These bills, he said, included four bills which were referred yesterday, last day of the Budget Session. Azad said the tactics the government used for the passage of bills in the Rajya Sabha where it does not have a majority were by turning “normal” bills into “money” bills, so that the Upper House cannot go against such measures. He complimented all opposition parties for remaining “vigilant and alert” against the tactic of turning non-money bills into money bills to escape the scrutiny of the Rajya Sabha. Whatever happens in the Lok Sabha is as per the wishes of the BJP, Azad said, parrying a direct question whether Congress was critical of the Speaker for declaring certain bills as money bills. He remained ambivalent to a question whether Congress would continue the campaign for removal of Union Minister Nitin Gadkari in the wake of the CAG report on alleged financial irregularities in his family linked …continued »","source":"INDIAN EXPRESS","id":"645b5458-cce1-4237-af68-e6634c42cf2c","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Lack of 'adequate financial model' challenge for many media houses: Arun Jaitley","link":"http://ibnlive.in.com/news/lack-of-adequate-financial-model-challenge-for-many-media-houses-arun-jaitley/545611-37-64.html","description":"Absence of an \"adequate financial model\" is a real challenge faced by many media organisations, Information and Broadcasting Minister Arun Jaitley on Thursday said, adding that this situation not only affects news content but may even lead to ills like paid news.","date":"Thu May 14 07:17:30 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/11_2014/dc-asks-official-to-probe-model-code-violation-by-arun-jaitley_111114112153.jpg\" width=\"669px\" title=\"Lack of 'adequate financial model' challenge for many media houses: Arun Jaitley\" alt=\"Lack of 'adequate financial model' challenge for many media houses: Arun Jaitley\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/11_2014/dc-asks-official-to-probe-model-code-violation-by-arun-jaitley_111114112153.jpg"},"content":"New Delhi: Absence of an \"adequate financial model\" is a real challenge faced by many media organisations, Information and Broadcasting Minister Arun Jaitley on Thursday said, adding that this situation not only affects news content but may even lead to ills like paid news. \"What is the financial model behind the digital medium, it's still struggling for it. The aberration in the electronic media is that the cost of distribution is more than the cost of content,\" Jaitley said. Speaking further, he said that with cost of distribution being so high, there is an obvious compromise on the cost of content as the quantum of advertising available is almost stagnant or maybe growing marginally. Jaitley said that Supreme Court in a judgement decided that commercial speech is also free speech. #arun jaitley #adequate financial model #information and broadcasting minister #supreme court He said that in this situation, news organisations may begin competing for eyeballs, resulting in hype and \"shrillness\". In a shrill debate, he added, the other side of the picture is not known. He further said that while a large number of organisations will maintain priorities, some others may compromise and that is how the problem of paid news may arise, which particularly during elections seems highly prevalent. \"Is there a way we can check it or the Broadcasting (Content) Complaints Council can check it? I have very serious doubts,\" Jaitley said. He said that a decade-and-a-half ago, Supreme Court in a judgement decided that commercial speech is also free speech. \"So those who market paid news might find this interpretation of the Supreme Court coming to their aid if the Broadcasting Complaints Council were to proceed against paid news because that is commercial speech,\" he said, adding that the particular judgement was in the context of advertising. The minister averred that the viewer or reader can dissect various versions of news and see which is the closest to reality and here was an opportunity for conventionalists to hit back. The I&amp;B minister was speaking at a seminar organised by the Indian Institute of Mass Communication (IIMC) on the 'Establishment of a Communication University', where BCCC chief Justice Mukul Mudgal and I&amp;B secretary Bimal Julka were also present.","source":"IBNLIVE","id":"69373441-7e33-4af3-9e86-50d44bb95901","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"All-Veg Chinese Dinner for PM Modi in President Xi's Hometown","link":"http://feedproxy.google.com/~r/ndtv/Lsgd/~3/Dmq_HIxg-WM/story01.htm","description":"It's Chinese tonight for dinner in Xian and there is no chilly paneer or crisp honey potatoes. Prime Minister Narendra Modi will be treated to a vegetarian repast that includes sour and spicy soup wit...","date":"Thu May 14 07:13:19 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"All-Veg Chinese Dinner for PM Modi in President Xi's Hometown\" alt=\"All-Veg Chinese Dinner for PM Modi in President Xi's Hometown\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-05/modi-dinner_650x920_61431605802.jpg\">","sort":"http://i.ndtvimg.com/i/2015-05/modi-dinner_650x920_61431605802.jpg"},"content":"Beijing:  It's Chinese tonight for dinner in Xian and there is no chilly paneer or crisp honey potatoes. Prime Minister Narendra Modi will be treated to a vegetarian repast that starts with hors d'oeuvre and a spicy soup followed by assorted vegetables with pancake and red bean rice and beancurd with mushroom. Also on the menu - now being retweeted - is water chestnut in bean sauce and braised asparagus and bamboo fungus with lotus root. There is noodle, dumpling and pancake and a light fruits and sorbet for dessert. Ministry of external affairs spokesperson Vikas Swarup tweeted the menu, saying: Chinese specials tonight. Banquet dinner in the honour of PM @narendramodi in Xian pic.twitter.com/T28h4PuV5p - Vikas Swarup (@MEAIndia) May 14, 2015 Xian is Chinese president Xi Jinping's hometown and he is hosting the banquet for PM Modi. It was preceded by a traditional Tang dynasty welcome for the Indian Prime Minister, which involved song and dance by people in spectacular costumes. PM Modi is the first world leader to be hosted outside Beijing. President Xi is reciprocating the Indian Prime Minister's gesture of hosting him in Ahmedabad in the latter's home state Gujarat, when he visited India last September.      In Ahmedabad, the two leaders had dined under a massive white Swiss tent on the Sabarmati riverfront. PM Modi had served a 150-dish Gujarati banquet, with traditional delicacies like Khaman and Dhokla.","source":"NDTV","id":"262ee9ad-23d7-4f7b-9af2-5957ed635a13","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Arms Act Case: Actor Salman Khan's Plea Rejected","link":"http://feedproxy.google.com/~r/ndtv/Lsgd/~3/LbiicnLdxVg/story01.htm","description":"A court in Jodhpur today rejected the revision petition of actor Salman Khan seeking permission to summon five witnesses in the Arms Act case against him in connection with the black bucks poaching ca...","date":"Thu May 14 07:08:33 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"Arms Act Case: Actor Salman Khan's Plea Rejected\" alt=\"Arms Act Case: Actor Salman Khan's Plea Rejected\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-05/salman-khan_640x480_41430932689.jpg\">","sort":"http://i.ndtvimg.com/i/2015-05/salman-khan_640x480_41430932689.jpg"},"content":"Jodhpur:  A court in Jodhpur today rejected the revision petition of actor Salman Khan seeking permission to summon five witnesses in the Arms Act case against him in connection with the black bucks poaching case. Mr Khan's counsel HM Saraswat said they were awaiting the detailed order to find out the grounds on basis of which the court turned down the petition. He, however, said the option of moving the high court is open. \"But we will reach a final decision only after perusal of the order,\" said Saraswat. Sessions Judge Manoj Kumar Vyas had completed the hearing of the petition last week and had reserved the order for today. Earlier, the trial court had rejected the petition following which Saraswat had moved sessions court. The five witnesses mentioned in Mr Khan's petition were prosecution witnesses and had already been examined. But after the trial court allowed the prosecution to summon four new witnesses in pursuance of the four undecided applications moved in 2006, the defence also made a plea to call these witnesses again. The case pertains to contravention of the Arms Act by using expired licence guns to allegedly poach black bucks in Jodhpur on October 1, 1998.    ","source":"NDTV","id":"73709762-becf-431d-a8dc-76fa05e7de16","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Child from continuance of valid marriage is legitimate: Bombay High Court","link":"http://ibnlive.in.com/news/child-from-continuance-of-valid-marriage-is-legitimate-bombay-high-court/545609-3-237.html","description":"Observing that a child born during continuance of a valid marriage or even within a year after its dissolution is conclusive proof that it is legitimate, the Bombay High Court has refused to direct a woman and her teenage daughter to undergo DNA tests to prove parentage.","date":"Thu May 14 07:10:40 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2013/bombay_high_courtnew.jpg\" width=\"669px\" title=\"Child from continuance of valid marriage is legitimate: Bombay High Court\" alt=\"Child from continuance of valid marriage is legitimate: Bombay High Court\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2013/bombay_high_courtnew.jpg"},"content":"Mumbai: Observing that a child born during continuance of a valid marriage or even within a year after its dissolution is conclusive proof that it is legitimate, the Bombay High Court has refused to direct a woman and her teenage daughter to undergo DNA tests to prove parentage. Justice Sadhana Jadhav dismissed a petition filed by Layyapa Patil seeking direction to his wife Mirabai and their 16-year-old daughter to undergo DNA and blood tests to ascertain if he is the father. Patil also sought Mirabai's cousin Ashok Godhe to undergo the tests as he has alleged that his wife and Ashok had illicit relations and that the girl was his daughter. The birth of a child during continuance of a marriage or dissolution proves the legitimacy. #bombay high court #legitimate child #marriage Layyapa and Mirabai got married in June 1994. Layyapa works in the merchant navy and hence was on ship most of the time. However, between September 1996 to December 1996 he was living with his wife. A girl was born to Mirabai in June 1997. Relations between Layyapa and Mirabai soured following which they decided to dissolve the marriage. However, when Mirabai sought maintenance for herself and their daughter, Layyapa refused and alleged that he is not the father to the girl. Layyapa initially filed a suit before a civil court in Sangli seeking a declaration that he is not the biological father. When the court rejected his plea, he approached the high court. \"The birth of a child during continuance of a valid marriage or even within 280 days after its dissolution is conclusive proof that child was legitimate unless the husband and wife had no access to each other at any time when conception took place,\" Justice Jadhav said. \"In the present case, there is no good ground to hold that the parties (Layyapa and Mirabai) had no access with each other, at least, till June 1997. It is pertinent to note that for the first time the said contention about questioning the paternity was raised only after filing of the maintenance petition by the wife,\" the high court said.","source":"IBNLIVE","id":"bc8c7edb-bb94-48e0-8f6c-c6ac420f7486","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Supreme Court delays decision on jailed Sahara chief Subrata Roy","link":"http://ibnlive.in.com/news/supreme-court-delays-decision-on-jailed-sahara-chief-subrata-roy/545607-3.html","description":"The Supreme Court on Thursday deferred a decision on conglomerate Sahara's bid for bail for its jailed boss in a long-running dispute over illegal bonds.","date":"Thu May 14 07:08:17 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/subrata_99999.jpg\" width=\"669px\" title=\"Supreme Court delays decision on jailed Sahara chief Subrata Roy\" alt=\"Supreme Court delays decision on jailed Sahara chief Subrata Roy\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/subrata_99999.jpg"},"content":"New Delhi: The Supreme Court on Thursday deferred a decision on conglomerate Sahara's bid for bail for its jailed boss in a long-running dispute over illegal bonds. It gave no date for a decision. Subrata Roy has been held in jail for more than a year, after Sahara failed to comply with a court order to refund money it had raised from millions of small investors by selling bonds that were later ruled to be illegal. The Supreme Court on Thursday deferred a decision on conglomerate Sahara's bid for bail for its jailed boss in a long-running dispute over illegal bonds. #sahara chief #supreme court #subrata roy A lawyer for the group said last week Sahara had agreed to pay the full $1.6 billion the court had asked for to release Roy on bail, but the group has yet to publicly outline that plan.","source":"IBNLIVE","id":"4652e48d-7cc0-4331-8f14-8268086a8a0a","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"In This City, Yamraj, God of Death, Doubles Up as Traffic Cop","link":"http://feedproxy.google.com/~r/ndtv/Lsgd/~3/sthxbWCzAu4/story01.htm","description":"In Jharkhand's capital Ranchi, which is notorious for unruly traffic, a policeman has been stopping and lecturing drivers at major intersections. He won't be ignored - he is dressed as the god of deat...","date":"Thu May 14 06:49:56 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"In This City, Yamraj, God of Death, Doubles Up as Traffic Cop\" alt=\"In This City, Yamraj, God of Death, Doubles Up as Traffic Cop\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-05/yamraj-traffic-cop-ranchi_650x400_61431604689.jpg\">","sort":"http://i.ndtvimg.com/i/2015-05/yamraj-traffic-cop-ranchi_650x400_61431604689.jpg"},"content":"Ranchi:  In Jharkhand's capital Ranchi, which is notorious for unruly traffic, a policeman has been stopping and lecturing drivers at major intersections. He can't be ignored - he is dressed as the god of death, Yamraj. Fed up of the ever increasing chaos on the roads, the Ranchi Traffic Police have decided that no one can be a better brand ambassador than Death himself. \"Yamraj\" the traffic policeman has been seen at various parts of the city this week, complete with a black costume, fake moustache, a mace and a whip. And holding challans or traffic violation tickets. Besides a fine, drivers caught violating traffic rules are told by Yamraj how their recklessness could lead them straight to him. Anand Jyoti Minz, the deputy in-charge of the city's traffic, says enlisting Yamraj became necessary when everything else failed. \"We first tried Gandhigiri. My men used to hand out flowers to violators. But everyone just had a good time, they used to smile and walk away. Besides, we were wasting Rs 15 on each bunch of flowers. Then we decided on something a little more impactful,\" he said. It may just work. Priyanshu Pratap was driving a two-wheeler without a helmet when he was caught and given a dressing down. \"I think Yamraj's scolding has worked for me. I will take care the next time,\" he said, looking chastised. The traffic police say they have been issuing challans to at least 2,000 people daily in the last 10 days, as part of a special drive. They are hoping that the presence of Yamraj will bolster their campaign. If the experiment is a success, it may be replicated in other parts of the state, say police officers.","source":"NDTV","id":"9c9dbd64-d74b-43e3-a5eb-99d05fb84b63","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"PM Modi to visit Mathura on NDA's first anniversary: Sources","link":"http://ibnlive.in.com/news/pm-modi-to-visit-mathura-on-ndas-first-anniversary-sources/545600-37-64.html","description":"Prime Minister Narendra Modi is likely to visit Nagla Chandrabhan village, birth place of late Bhartiya Jan Sangh president Deen Dayal Upadhyay, on the eve of the first anniversary of NDA government.","date":"Thu May 14 06:57:19 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/narendra-modi-may122015.jpg\" width=\"669px\" title=\"PM Modi to visit Mathura on NDA's first anniversary: Sources\" alt=\"PM Modi to visit Mathura on NDA's first anniversary: Sources\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/narendra-modi-may122015.jpg"},"content":"Mathura: Prime Minister Narendra Modi is likely to visit Nagla Chandrabhan village, birth place of late Bhartiya Jan Sangh president Deen Dayal Upadhyay, on the eve of the first anniversary of NDA government. According to party sources, the Prime Minister would visit Nagla Chandrabhan (Farah) village in Mathura on May 25. \"Efforts are on to bring the Prime Minister to Nagla Chandrabhan, the birthplace of late Deen Dayal Upadhyay, on May 25,\" the source said. According to party sources, the Prime Minister would visit Nagla Chandrabhan (Farah) village in Mathura on May 25. #pm modi #mathura #nda #bhartiya jan sangh \"We are also making arrangements for a public meeting by Modi as the people of Brij want the Prime Minister to address them,\" he said. \"We are also expecting declaration of few welfare schemes on the occasion by Modi, that would be a befitting tribute to the departed soul of Deen Dayal Upadhyay,\" he added.","source":"IBNLIVE","id":"ca91b531-a676-40af-8551-1c1fa9b9e1e9","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Glares on please Modi photo which broke the internet today","link":"http://www.hindustantimes.com/india-news/the-modi-photo-which-broke-the-internet-today/article1-1347183.aspx","description":"Photos and memes of Prime Minister Narendra Modi sporting shades and checking out terracotta statues at a museum in China went viral on the internet on Thursday","date":"Thu May 14 06:06:08 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.hindustantimes.com//images/2015/5/018cf160-cc18-4662-9b93-28c64b5e7ef8wallpaper1.jpg\">","sort":"http://www.hindustantimes.com//images/2015/5/018cf160-cc18-4662-9b93-28c64b5e7ef8wallpaper1.jpg"},"content":"Photos and memes of Prime Minister Narendra Modi sporting shades and checking out terracotta statues at a museum in China went viral on the internet on Thursday. But of all the photos, there was one which got shared the most. In the photo a leaning Modi, dressed in a white kurta-pyjama with a shawl thrown over his shoulder, is seen closely inspecting a statue at the museum. Social media users reacted at this photograph with witty tweets and provoking memes. Here are the top tweets with the photograph: Walking with Warriors. pic.twitter.com/J1wo6kTW3Q— Vikas Swarup (@MEAIndia) May 14, 2015 \"Tell me, Mr. Anderson, what good is an opinion when you are unable to....tweet?\" pic.twitter.com/yUuuDOTa4k— Gabbbar (@GabbbarSingh) May 14, 2015 Checking whether the 'Made in China' tag can be changed to 'Make in India' #ModiinChina pic.twitter.com/sdcz5FbU1M— Mark Idhar Hai (@MainTejaHuun) May 14, 2015 A lesson for those who mess with our territory. I'll turn you to stone. pic.twitter.com/WNo93dCcNe— Rupa Subramanya (@rupasubramanya) May 14, 2015 When bae comes home late so u do a hickey check. #ModiInChina pic.twitter.com/etHsDdgdga— Imaan Sheikh (@SheikhImaan) May 14, 2015 @RegaJha pic.twitter.com/yUlYaAcgUc— Nandan Boal (@nboal) May 14, 2015 Some of the other photographs from Modi's museum visit were turned into memes by the Twitterati. Here are two of them: PM Modi and Rahul Gandhi about to start their debate on LAB pic.twitter.com/1eSGRKn4mZ— Divya (@divya_16_) May 14, 2015 Modi : Tell me.. Did you bleed? Superman : Wait... What???? Modi : YOU WILL ! #ModiInChina pic.twitter.com/ikBOI0dBGz— दूसरा DK (@DiwakarKothari_) May 14, 2015 Tags PM Narendra Modi Modi's China visit Modi at museum  ","source":"HINDUSTAN TIMES","id":"9207f2de-c95b-45e2-877f-6fb4f0951a28","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"},{"title":"Malaria Control Software to be in operation by May-end","link":"http://www.thehindu.com/news/cities/Mangalore/malaria-control-software-to-be-in-operation-by-mayend/article7205704.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"By the end of this month, health workers will be seen with tabs enabled with the Malaria Control Software to detect the source of Malaria and act against it within the stipulated time. T...","date":"Thu May 14 06:31:52 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/PSX_20150514_12382_2405997f.jpg\" class=\"main-image\" alt=\"Naren Kodvattat of I Point, speaking at a meeting on Malaria detecting software at DC Office in Mangaluru. Photo: H.S.Manjunath.\" width=\"636\" height=\"477\" title=\"Naren Kodvattat of I Point, speaking at a meeting on Malaria detecting software at DC Office in Mangaluru. Photo: H.S.Manjunath.\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/PSX_20150514_12382_2405997f.jpg"},"content":"By the end of this month, health workers will be seen with tabs enabled with the Malaria Control Software to detect the source of Malaria and act against it within the stipulated time. The software, which has already had trial runs, will be operational by the last week of May. The then Mayor of Mangaluru, Mahabala Marla had initiated the work of preparation of the software, which was found necessary as majority of cases of Malaria in the state were from Mangaluru. This software will be used in the tabs given to the 50-odd Multi-Purpose Workers (MPW) of the Mangaluru City Corporation involved in source identification and destruction. Mangalore Medical Relief Society took up the task and the company I Point was entrusted with development of the software. In a meeting to review Malaria Control programme held at the office of the Deputy Commissioner, the Managing Director of I Point Naren Koduvattat said that the software has been enabled to spot places where mosquito carrying Malaria parasite breeds, report cases of Malaria and follow-up action. He said each of the 80-odd laboratories that have been set-up, will be reporting cases of Malaria that will be reflected on a separate website being developed for the purpose. Soon after it is reported, message goes to the concerned MPW, who has to report the source of Malaria around the victim’s house and destroy it. A set of officials will be monitoring the whole process on a daily basis. The software allows a citizen also to report cases of Malaria. Post Comment More In: Mangaluru | Karnataka | National Tweet","source":"THEHINDU","id":"cb6e6a0b-e38f-4d3a-b359-65d78a922505","category":"INDIA","order":null,"colorCode":"#E85137","displayName":"INDIA"}],"lastupdated":1431620108811,"category":"INDIA","refreshInt":5,"colorCode":"#E85137","displayName":"INDIA"}