{"feed":[{"title":"UK names BRICs economist Jim O'Neill as junior finance minister","link":"http://economictimes.indiatimes.com/news/international/business/uk-names-brics-economist-jim-oneill-as-junior-finance-minister/articleshow/47287347.cms","description":"O'Neill was put in charge of an international commission to investigate global antimicrobial resistance by British Prime Minister David Cameron.","date":"Thu May 14 10:47:36 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47287477,width-310,resizemode-4/ji.jpg\" alt=\"O'Neill was put in charge of an international commission to investigate global antimicrobial resistance by British Prime Minister David Cameron.\" title=\"O'Neill was put in charge of an international commission to investigate global antimicrobial resistance by British Prime Minister David Cameron.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47287477,width-310,resizemode-4/ji.jpg"},"content":"LONDON: The economist who coined the terms BRICs to describe the world's leading emerging nations is turning his sights closer to home after he was appointed by British finance minister George Osborne to work for him. Former Goldman Sachs chief economist Jim O'Neill will be commercial secretary to the Treasury, a junior ministerial role which includes responsibility for boosting infrastructure and improving competition policy. He will also play a role in the government's push to devolve more powers to British cities and create more growth in the north of England to counterbalance the might of London, according to the text of a speech by Osborne on Thursday. Last year, O'Neill was put in charge of an international commission to investigate global antimicrobial resistance by British Prime Minister David Cameron. Manchester-born O'Neill chaired the Cities Growth Commission in Britain until October 2014. The commission's recommendations have influenced Osborne's thinking on devolution of powers to cities.","source":"THEECONOMICTIMES","id":"33321282-1b43-4c0e-bd3b-1433c6fc59c7","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Singapore Telecom Q4 net profit rises 4.5 per cent","link":"http://economictimes.indiatimes.com/news/international/business/singapore-telecom-q4-net-profit-rises-4-5-per-cent/articleshow/47286996.cms","description":"Net profit totalled USD 709.4 million) in the three months to March, compared with 898 million Singapore dollars in the same period last year.","date":"Thu May 14 10:20:35 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47287011,width-310,resizemode-4/growth9_bccl.jpg\" alt=\"Net profit&nbsp;totalled&nbsp;USD 709.4 million) in the three months to March, compared with 898 million Singapore dollars in the same period last year.\" title=\"Net profit&nbsp;totalled&nbsp;USD 709.4 million) in the three months to March, compared with 898 million Singapore dollars in the same period last year.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47287011,width-310,resizemode-4/growth9_bccl.jpg"},"content":"SINGAPORE: Singapore Telecom (Singtel) said today fourth-quarter net profit rose 4.5 per cent year-on-year, boosted by strong performances in the home market and regional associates as its digital business expands. Net profit totalled USD 709.4 million) in the three months to March, compared with 898 million Singapore dollars in the same period last year, Southeast Asia's biggest telecom firm by revenue said in a statement. Revenue rose 5.1 percent to 4.34 billion Singapore dollars from 4.13 billion Singapore dollars. For the full year to March, net profit jumped 3.5 percent to 3.78 billion Singapore dollars while group revenue gained 2.2 per cent to 17.22 billion Singapore dollars. \"The group and its associates successfully captured the strong growth in mobile data services, with strategic investments in networks, distribution, customer initiatives and support,\" Singtel said in the statement. \"To capitalise on the potential of mobile data services in the emerging markets, the regional mobile associates continued to invest in spectrum and build next generation data networks.\" Shares in the firm were up 0.46 percent at 4.38 Singapore dollars on Singapore's stock exchange Thursday. The firm said revenue from its consumer business in at home in Singapore as well as from its fully owned Australian subsidiary Optus \"rose strongly, driven by higher mobile data uptake and equipment sales\". Apart from Optus, Singtel also owns substantial stakes in India's Bharti Airtel, Indonesia's Telkomsel, Thailand's Advanced Info Service, the Philippines' Globe Telecom and Pacific Bangladesh Telecom. In April, Singtel said it was buying almost all of US cybersecurity firm Trustwave for USD 810 million. Singtel chief executive Chua Sock Koong said in the statement that the acquisition signalled the firm's aspiration \"to be a significant global player in cyber security\". \"In the digital space, we are sharpening our focus in three key areas -- digital marketing, regional premium video and advanced analytics,\" she said. Singtel last year allocated 2.0 billion Singapore dollars for digital investments until the 2016 financial year. In January, it entered into a joint venture with Sony Pictures and Warner Brothers to set up HOOQ, a new video-streaming service for Asia in the mould of Netflix. And in April, it launched its own mobile chat app Wavee. In June last year, its fully owned digital advertising firm Amobee bought two mobile advertising firms for a total 385 million Singapore dollars. Singtel bought US-based Amobee for 321 million Singapore dollars in 2012.","source":"THEECONOMICTIMES","id":"8738f88d-e511-49b5-bc56-5d60f04f8c49","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Russia's woes to hit Central Asia, Caucasus economies in 2015: EBRD","link":"http://economictimes.indiatimes.com/news/international/business/russias-woes-to-hit-central-asia-caucasus-economies-in-2015-ebrd/articleshow/47286846.cms","description":"Russia's economic contraction will curb the growth prospects this year for ex-Soviet republics in central Asia and the Caucasus, the EBRD said on Thursday.","date":"Thu May 14 10:11:32 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47286872,width-310,resizemode-4/russias-woes-to-hit-central-asia-caucasus-economies-in-2015-ebrd.jpg\" alt=\"Russia's economic contraction will curb the growth prospects this year for ex-Soviet republics in central Asia and the Caucasus, the&nbsp;EBRD&nbsp;said on Thursday.\" title=\"Russia's economic contraction will curb the growth prospects this year for ex-Soviet republics in central Asia and the Caucasus, the&nbsp;EBRD&nbsp;said on Thursday.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47286872,width-310,resizemode-4/russias-woes-to-hit-central-asia-caucasus-economies-in-2015-ebrd.jpg"},"content":"TBILISI: Russia's economic contraction will curb the growth prospects this year for ex-Soviet republics in central Asia and the Caucasus, the European Bank for Reconstruction and Development (EBRD) said on Thursday. Declining remittances from migrant workers in Russia will take a heavy toll on countries from Armenia to Tajikistan, while oil producers such as Kazakhstan and Azerbaijan also have to wrestle with sharply lower global crude prices. The EBRD released forecasts for the region during its annual meeting, held this year in the Georgian capital Tbilisi. \"As the Russian economy has declined, remittances from Russia to Central Asia and to eastern Europe and the Caucasus have been declining at an alarming rate,\" the EBRD said. Data from the first quarter of 2015 suggest the remittances -- which account for as much as 42 per cent of the Tajik economy -- might be declining even faster than during the 2009 global financial crisis, it said in a report. \"This trend is likely to continue in the following three quarters.\" Russia's economy, buffeted by the slump in oil prices and by Western sanctions imposed over Moscow's role in the Ukraine crisis, is expected to contract by 4.5 per cent this year. Oil-rich Kazakhstan, the largest Central Asian nation by territory, will see growth slow to 1.5 per cent from 4.3 per cent last year and then pick up to 2 per cent in 2016, the EBRD said. Uzbekistan, the region's most populous country with 30 million people, is seen expanding this year by 7 per cent and by 7.2 per cent next year, down from 8.1 per cent in 2014. MIGRANT WORKERS Estimates put the number of Uzbek migrant workers at between two million and five million people. Roughly half of the workforce in Kyrgyzstan and Tajikistan are also estimated to be working abroad, mainly in Russia, where the rouble shed up to 40 per cent of its value versus the dollar last year before recouping some losses. It is now down about a third since the Ukraine crisis erupted in early 2014. About one million Kyrgyz and 1.2 million Tajiks -- roughly half of the two countries' workforce - were estimated to be working abroad, mainly in Russia, before the rouble's plunge. The Kyrgyz economy is projected to grow by 3 per cent in 2015 and 3.1 per cent in 2016, down from 3.6 per cent last year. Tajik growth is forecast at 3.8 per cent both this year and in 2016, down from 6.7 per cent in 2014, the EBRD said. Turkmenistan, holder of the world's fourth largest natural gas reserves and a major exporter of the commodity to China, is expected to grow by a still-robust 9.5 per cent in 2015 and by 10 per cent next year, down slightly from 10.3 per cent in 2014. The Caucasus region is also vulnerable to Russia's woes. Growth in Georgia, which is criss-crossed by pipelines carrying Caspian oil and gas from Azerbaijan to Europe, is put at 2.3 per cent for 2015, down from an earlier forecast of 4.2 per cent, and at 2.6 per cent next year, the EBRD said. Azerbaijan, where oil and gas generate 75 per cent of state revenues, is seen growing by 1.5 per cent this year and next. Neighbouring Armenia, heavily dependent on aid and Russian investment, will contract by 1.5 per cent this year and grow by 1 per cent in 2016, the EBRD predicted.","source":"THEECONOMICTIMES","id":"dc22613d-d356-4ae4-90f0-81f7c1d32509","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Oklahoma school concerned over dancing dead cats video","link":"http://timesofindia.feedsportal.com/c/33039/f/533917/s/46508a68/sc/16/l/0Ltimesofindia0Bindiatimes0N0Cworld0Cmad0Emad0Eworld0COklahoma0Eschool0Econcerned0Eover0Edancing0Edead0Ecats0Evideo0Carticleshow0C472868330Bcms/story01.htm","description":"An Oklahoma school expressed concern and disappointment on Wednesday over a video that went viral showing students in a biology class performing a choreographed dance routine with dead cats.","date":"Thu May 14 10:10:30 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://timesofindia.indiatimes.com/photo/34824568.cms"},"content":"OKLAHOMA CITY: An Oklahoma school expressed concern and disappointment on Wednesday over a video that went viral showing students in a biology class performing a choreographed dance routine with dead cats. In the video, students dressed in lab coats at Oklahoma City's Harding Charter Preparatory High School hold dead cats that were to be used for dissection and manipulate the animals in a set of moves to music used in a cat food jingle. \"Animals should be treated and handled with respect and dignity, a standard that was not upheld in this instance,\" the school said in a statement. \"These students made a mistake and they will most likely make other mistakes in their lives,\" it said. The video was made by former students in the fall of 2013, the school said. It went viral this week after it was posted on social media by an animal rights group.","source":"TimesOfIndia","id":"c2a3a824-430e-4d15-a35a-09bce1103ffd","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Police Say Over 700 Britons Have Travelled to Syria, Half Now Home","link":"http://feedproxy.google.com/~r/ndtv/TqgX/~3/gv3LGFtEPQk/story01.htm","description":"More than 700 Britons are thought to have travelled to Syria and over a half have since returned home where they now pose a significant terrorism threat, British police said on Thursday.","date":"Thu May 14 09:54:09 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"Police Say Over 700 Britons Have Travelled to Syria, Half Now Home\" alt=\"Police Say Over 700 Britons Have Travelled to Syria, Half Now Home\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-05/mark-rowley_650x400_61431615919.jpg\">","sort":"http://i.ndtvimg.com/i/2015-05/mark-rowley_650x400_61431615919.jpg"},"content":"London:  More than 700 Britons are thought to have travelled to Syria and over a half have since returned home where they now pose a significant terrorism threat, British police said on Thursday. Mark Rowley, the lead officer on counter-terrorism, also said there had been a record 338 arrests for terrorism-related offences last year, up by a third from 2013, with almost a half related to the conflict in Syria. Rowley said of the 700 Britons who were believed to have gone, \"a significant proportion\" were thought to have tried to join Islamic State (IS) militants who have taken over swathes of Syria and Iraq. About a half of those who had gone to the region were now thought to be back in Britain. \"(IS) and other terrorist groups are trying to direct attacks in the UK; encouraging British citizens to travel to Syria to fight and train; and are seeking, through propaganda, to provoke individuals in the UK to carry out violent attacks here,\" Rowley said in a statement. He said the threat ranged from \"lone actors intent on carrying out crude and violent attacks\" to more sophisticated and ambitious coordinated plots by organised networks. Of those arrested last year, 11 percent were women and 17 percent were aged under 20. Last August, Britain raised its terrorism threat alert to the second-highest level of \"severe\", meaning an attack was considered highly likely with security chiefs repeatedly warning about the danger posed by battle-hardened veterans of fighting in Syria returning home. Among those Britons who have joined the conflict is Kuwaiti-born Londoner Mohammed Emwazi, dubbed \"Jihadi John\" by media, who has appeared in several Islamic State videos showing the beheading of Western hostages. The authorities say they have thwarted major plots every year since four young British Islamists killed 52 people in suicide bomb attacks on London's transport network in 2005. In February, a British teenager was convicted of plotting to behead a soldier after becoming influenced by the brutal killing of Afghan war veteran Lee Rigby by two Muslim converts on a London street in 2013, the last deadly Islamist attack in Britain. The police figures come a day after Prime Minister David Cameron announced plans for new laws to curb organisations and individuals who promote militant ideologies at home and recruit young people to radical Islamist groups abroad. © Thomson Reuters 2015","source":"NDTV","id":"43d689be-f75f-49d9-bdeb-07e0ba2afd24","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Fighting flares after Burundi army chief says coup attempt failed","link":"http://feeds.reuters.com/~r/reuters/INworldNews/~3/gF2un9TC1ws/story01.htm","description":"BUJUMBURA (Reuters) - The head of Burundi's army said on Thursday that an attempted coup had failed and forces loyal to President Pierre Nkurunziza were in control, but heavy gunfire in the capital suggested the battle for power was not yet over.","date":"Thu May 14 09:23:35 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://s3.reutersmedia.net/resources_v2/images/masthead-logo.gif"},"content":"BUJUMBURA The head of Burundi's army said on Thursday that an attempted coup had failed and forces loyal to President Pierre Nkurunziza were in control, but heavy gunfire in the capital suggested the battle for power was not yet over.","source":"REUTERS","id":"f5d1b57e-5cfd-4412-96fc-683d6ad87718","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Saudi Arabia promises to match Iran in nuclear capability","link":"http://timesofindia.feedsportal.com/c/33039/f/533917/s/4650875d/sc/7/l/0Ltimesofindia0Bindiatimes0N0Cworld0Cmiddle0Eeast0CSaudi0EArabia0Epromises0Eto0Ematch0EIran0Ein0Enuclear0Ecapability0Carticleshow0C472865160Bcms/story01.htm","description":"Saudi Arabia and many of the smaller Arab states are vowing to match whatever nuclear enrichment capability Iran is permitted to retain.","date":"Thu May 14 09:47:05 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Saudi Arabia promises to match Iran in nuclear capability\" title=\"Saudi Arabia promises to match Iran in nuclear capability\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47286617,width-300,resizemode-4/Turki-bin-Faisal.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47286617,width-300,resizemode-4/Turki-bin-Faisal.jpg"},"content":"WASHINGTON: When President Barack Obama began making the case for a deal with Iran that would delay its ability to assemble an atomic weapon, his first argument was that a nuclear-armed Iran would set off a \"free-for-all\" of proliferation in the Arab world. \"It is almost certain that other players in the region would feel it necessary to get their own nuclear weapons,\" he said in 2012. Now, as he gathered Arab leaders over dinner at the White House on Wednesday and prepared to meet with them at Camp David on Thursday, he faced a perverse consequence: Saudi Arabia and many of the smaller Arab states are vowing to match whatever nuclear-enrichment capability Iran is permitted to retain. \"We can't sit back and be nowhere as Iran is allowed to retain much of its capability and amass its research,\" one of the Arab leaders preparing to meet Obama said Monday, declining to be named until he made his case directly to the president. Prince Turki bin Faisal, the 70-year-old former Saudi intelligence chief, has been touring the world with the same message. READ ALSO: World 'closer than ever' to Iran nuclear deal, Kerry says \"Whatever the Iranians have, we will have, too,\" he said at a recent conference in Seoul, South Korea. For a president who came to office vowing to move toward the elimination of nuclear weapons, the Iran deal has presented a new dilemma. If the agreement is sealed successfully next month — still far from guaranteed — Obama will be able to claim to have bought another decade, maybe longer, before Iran can credibly threaten to have a nuclear weapon. But by leaving 5,000 centrifuges and a growing research and development program in place — the features of the proposed deal that Israel and the Arab states oppose virulently — Obama is essentially recognizing Iran's right to continue enrichment of uranium, one of the two pathways to a nuclear weapon. Leaders of the Sunni Arab states are arguing that if Iran goes down that road, Washington cannot credibly argue they should not follow down the same one, even if their technological abilities are years behind Iran's. \"With or without a deal, there will be pressure for nuclear proliferation in the Middle East,\" said Gary Samore, Obama's top nuclear adviser during the first term and now the executive director of the Belfer Center for Science and International Affairs at Harvard. \"The question is one of capabilities. How would the Saudis do this without help from the outside?\" In fact, the Arab states may find it is not as easy as it sounds. The members of the Nuclear Suppliers Group, a loose affiliation of nations that make the crucial components for nuclear energy and, by extension, weapons projects, have a long list of components they will not ship to the Middle East. For the Saudis, and other Arab states, that leaves only North Korea and Pakistan, two countries that appear to have mastered nuclear enrichment, as possible sources. READ ALSO: Khamenei says Iran nuclear weapons are a 'myth' It is doubtful that any of the US allies being hosted by Obama this week would turn to North Korea, although it supplied Syria with the components of a nuclear reactor that Israel destroyed in 2007. Pakistan is another story. The Saudis have a natural if unacknowledged claim on the technology: They financed much of the work done by AQ Khan, a Pakistani nuclear scientist who ended up peddling his nuclear wares abroad. It is widely presumed that Pakistan would provide Saudi Arabia with the technology, if not a weapon itself. The Arab leader interviewed on Monday said that countries in the Gulf Cooperation Council, all to be represented at the Camp David meeting, had discussed a collective program of their own — couched, as Iran's is, as a peaceful effort to develop nuclear energy. The United Arab Emirates signed a deal with the United States several years ago to build nuclear power plants, but it is prohibited under that plan from enriching its own uranium. Over the past decade, the Saudi government has financed nuclear research projects but there is no evidence that they have ever tried to build or buy facilities of the kind Iran has assembled to master the fuel cycle, the independent production of the makings of a weapon. Still, the Saudis have given the subject of nuclear armament more than passing thought. In the 1980s they bought a type of Chinese missile, called a DF-3, that could be used effectively only to deliver a nuclear weapon because the missiles were too large and inaccurate for any other purpose. US officials, led by Robert Gates, then the director of the CIA, protested. There is no evidence the Saudis ever obtained warheads to fit atop the missiles. Obama met in the Oval Office on Wednesday with Saudi Crown Prince Mohammed bin Nayef and deputy crown prince Mohammed bin Salman — who will most likely moderate their criticisms of his administration while talking directly to the president. Obama is expected to offer Saudi Arabia and the other Arab states some security assurances, although not as explicit or legally binding as the kind that protect US treaty allies, from Nato to Japan to South Korea. READ ALSO: Iran nuclear deal runs into Israel headwind But Obama will have a difficult time overcoming the deep suspicions that the Saudis, and other Arab leaders, harbor about the Iran deal. Several of them have said that the critical problem with the tentative agreements, as described by the White House and secretary of state John Kerry, is that they assure nothing on a permanent basis. Prince Turki, while in Seoul, went further. \"He did go behind the backs of the traditional allies of the US to strike the deal,\" he said of Obama during a presentation to the Asan Institute for Policy Studies, a South Korean research organization. Although \"the small print of the deal is still unknown,\" he added, it \"opens the door to nuclear proliferation, not closes it, as was the initial intention.\" Prince Turki argued that the United States was making a \"pivot to Iran\" that was ill advised and that the United States had failed to learn from North Korea's violations of its nuclear deals. \"We were America's best friend in the Arab world for 50 years,\" he said, using the past tense.","source":"TimesOfIndia","id":"94821765-cacb-4698-9aa8-487317283ea8","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"PM Narendra Modi, Xi Jinping Visit Giant Wild Goose Pagoda","link":"http://feedproxy.google.com/~r/ndtv/TqgX/~3/ZLwmkYPRWAQ/story01.htm","description":"Prime Minister Narendra Modi and Chinese President Xi Jinping today visited the iconic Giant Wild Goose Pagoda built in 652 AD in recognition of monk Hiuen Tsang's 17-year-long journey to India and hi...","date":"Thu May 14 09:38:15 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"PM Narendra Modi, Xi Jinping Visit Giant Wild Goose Pagoda\" alt=\"PM Narendra Modi, Xi Jinping Visit Giant Wild Goose Pagoda\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-05/modi-xi-jinping_650x400_41431603724.jpg\">","sort":"http://i.ndtvimg.com/i/2015-05/modi-xi-jinping_650x400_41431603724.jpg"},"content":"Xi'an:  Prime Minister Narendra Modi and Chinese President Xi Jinping today visited the iconic Giant Wild Goose Pagoda built in 652 AD in recognition of monk Hiuen Tsang's 17-year-long journey to India and his efforts to popularise Buddhism in China. Mr Modi and Mr Xi visited the Pagoda after holding wide-ranging bilateral talks here. Prime Minister Modi also gifted a Bodhi sapling to the temple. In turn, the Abbot of the monastery gifted a figurine of Hiuen Tsang, also known as Xuan Zang, to Mr Modi. Mr Xi and Mr Modi also posed for the photographers while shaking hands in front of the monument. The Giant Wild Goose Pagoda is a Buddhist pagoda located in southern Xi'an. It was built in 652 AD, during the Tang dynasty and originally had five storeys. The structure was rebuilt in 704 AD during the reign of empress Wu Zetian and its exterior brick facade was renovated during the reign of emperor Gaozang of Tang (649-683). Today, it stands at a height of 64 metres. Hiuen Tsang undertook the journey to India through the ancient Silk Road and returned home after the 17-year sojourn with precious Buddhist scriptures. One of the Pagoda's many functions was to hold sutra and figurines of the Buddha that were brought to China from India by Hiuen Tsang.  ","source":"NDTV","id":"ed1f3ed1-eb47-456b-b73e-dedf2571d305","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"China serves traditional vegetarian delights for PM Narendra Modi","link":"http://ibnlive.in.com/news/china-serves-traditional-vegetarian-delights-for-pm-narendra-modi/545635-2.html","description":"\"Chinese specials tonight. Banquet dinner in the honour of Prime Minister @narendramodi in Xian,\" External Affairs Ministry spokesperson Vikas Swarup tweeted.","date":"Thu May 14 09:23:47 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/modi_meetingxi2.jpg\" width=\"669px\" title=\"China serves traditional vegetarian delights for PM Narendra Modi\" alt=\"China serves traditional vegetarian delights for PM Narendra Modi\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/modi_meetingxi2.jpg"},"content":"Xi'an: Traditional Chinese delicacies including bean curd with mushroom, water chestnut in bean sauce, and braised asparagus are among some of the gourmet delights on the fully vegetarian menu for the banquet dinner for Prime Minister Narendra Modi on Thursday. \"Chinese specials tonight. Banquet dinner in the honour of Prime Minister @narendramodi in Xian,\" External Affairs Ministry spokesperson Vikas Swarup tweeted. The entire menu list tweeted by Swarup included hors d' oeuvres, sour and spicy soup with fired dough, assorted vegetables with pancake and red bean rice, bean curd with mushroom, water chestnut in bean sauce, braised asparagus and bamboo fungus with lotus root, noodle dumpling and pancake, fruits and sorbet. \"Chinese specials tonight. Banquet dinner in the honour of Prime Minister @narendramodi in Xian,\" External Affairs Ministry spokesperson Vikas Swarup tweeted. #modi in china #narendra modi #india #china Modi arrived in Xi'an, the capital of Shaanxi province and the hometown of Chinese President Xi Jingping, earlier in the day to begin his three-day official visit to China. Chinese specials tonight. Banquet dinner in the honour of PM @narendramodi in Xian pic.twitter.com/T28h4PuV5p— Vikas Swarup (@MEAIndia) May 14, 2015","source":"IBNLIVE","id":"e609c183-07ef-4cbc-ab39-c132d3606229","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"1 dead, hundreds disrupted in New Zealand flooding","link":"http://timesofindia.feedsportal.com/c/33039/f/533917/s/465017e6/sc/16/l/0Ltimesofindia0Bindiatimes0N0Cworld0Crest0Eof0Eworld0C10Edead0Ehundreds0Edisrupted0Ein0ENew0EZealand0Eflooding0Carticleshow0C472862620Bcms/story01.htm","description":"One man is dead while hundreds of commuters suffered disruptions in New Zealand's capital Wellington after heavy rainfall caused flooding and mudslides across the region.","date":"Thu May 14 09:21:40 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"1 dead, hundreds disrupted in New Zealand flooding\" title=\"1 dead, hundreds disrupted in New Zealand flooding\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47286273,width-300,resizemode-4/NewZealand-flood.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47286273,width-300,resizemode-4/NewZealand-flood.jpg"},"content":"WELLINGTON: One man is dead while hundreds of commuters suffered disruptions in New Zealand's capital Wellington after heavy rainfall caused flooding and mudslides across the region. Crews struggled to clear highways on Thursday and the city's train services were shut down, causing long delays for many. Wellington's Mayor Celia Wade-Brown urged people to find alternative accommodation in the city for the night rather than trying to make it home and even opened the downtown library for those who wanted to stay. Police said they found the body of an 80-year-old man in Petone near Wellington in floodwater near his abandoned car, which was partially submerged with the keys in the ignition. Several areas around Wellington recorded rainfall of over 10 centimeters (4 inches) on Thursday. The region is home to about 450,000 people.","source":"TimesOfIndia","id":"d3e936c8-0990-4cc1-8461-0641ff8435fa","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Exclusive - Poland to lobby NATO for more forces to deter Kremlin: document","link":"http://feeds.reuters.com/~r/reuters/INworldNews/~3/yP98KI5nCOA/story01.htm","description":"WARSAW (Reuters) - Poland and the Baltic states said on Thursday they were seeking permanent NATO deployments on their soil to counter increased Russian military activity, and a Polish internal document suggested the matter may be raised at a Warsaw summit next year.","date":"Thu May 14 09:20:37 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://s3.reutersmedia.net/resources_v2/images/masthead-logo.gif"},"content":"WARSAW Poland and the Baltic states said on Thursday they were seeking permanent NATO deployments on their soil to counter increased Russian military activity, and a Polish internal document suggested the matter may be raised at a Warsaw summit next year.","source":"REUTERS","id":"beadae81-be1a-4ef5-93aa-339a8dd046c4","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Nowhere to go as Asian boatpeople are turned away amid growing crisis at sea","link":"http://feeds.reuters.com/~r/reuters/INworldNews/~3/Ar93VVZb4pI/story01.htm","description":"KUALA LUMPUR/BANGKOK (Reuters) - Thousands of migrants adrift in Southeast Asian seas have nowhere to go after Thailand declined permission for a boat to land on Thursday and Malaysia said it would push boatpeople back out to sea.","date":"Thu May 14 09:17:14 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://s3.reutersmedia.net/resources_v2/images/masthead-logo.gif"},"content":"KUALA LUMPUR/BANGKOK Thousands of migrants adrift in Southeast Asian seas have nowhere to go after Thailand declined permission for a boat to land on Thursday and Malaysia said it would push boatpeople back out to sea.","source":"REUTERS","id":"d0efc920-74f6-429f-a43f-94ab648cad7f","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Islamic State at Gates of Syria's Palmyra Raising Fears for Ancient City","link":"http://feedproxy.google.com/~r/ndtv/TqgX/~3/F-eXdq8z7Rk/story01.htm","description":"Islamic State group fighters advanced to the gates of ancient Palmyra Thursday, raising fears the Syrian world heritage site could face destruction of the kind the jihadists have already wreaked in Ir...","date":"Thu May 14 09:11:37 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"Islamic State at Gates of Syria's Palmyra Raising Fears for Ancient City\" alt=\"Islamic State at Gates of Syria's Palmyra Raising Fears for Ancient City\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-04/isis_650x400_51430014894.jpg\">","sort":"http://i.ndtvimg.com/i/2015-04/isis_650x400_51430014894.jpg"},"content":"Beirut:  Islamic State group fighters advanced to the gates of ancient Palmyra Thursday, raising fears the Syrian world heritage site could face destruction of the kind the jihadists have already wreaked in Iraq. IS fighters were battling Syrian troops less than two kilometres (barely a mile) from the remains of one of the most important cultural centres of the ancient world, Syria's director of antiquities said. The jihadists reached the oasis town after a lightning advance across the desert in which they overran government forces in fierce fighting that cost the lives of 110 combatants, the Syrian Observatory for Human Rights said. \"Palmyra is under threat,\" said Observatory director Rami Abdel Rahman. Antiquities director Mamoun Abdulkarim said he was in touch with colleagues still in Palmyra every half hour \"IS has not entered the city yet, and we hope these barbarians will never enter,\" Abdulkarim told AFP. UNESCO describes Palmyra as a heritage site of \"outstanding universal value\". The ancient city stood on a caravan route at the crossroads of several civilisations and its 1st and 2nd century temples and colonnaded streets mark a unique blend of Graeco-Roman and Persian influences. The jihadist advance on the well-preserved remains came as an international conference was under way in Cairo to address the destruction already wreaked by IS on the ancient sites of Nimrud and Hatra in Iraq. 'International catastrophe' Foreign affairs and antiquities officials from 11 Arab countries gathered in Egypt to condemn the jihadists' demolition of Iraq's heritage, with sledgehammers, bulldozers and high explosives. Abdulkarim said Syria had not been invited to the conference and that he had not been contacted by any of those attending about the threat to Palmyra. He told AFP that antiquities officials would try to ensure the safety of artefacts found in archaeological digs over the years which are housed in an adjacent museum. \"We can protect the statues and artefacts, but we cannot protect the architecture, the temples,\" he said. \"IS will just destroy it from the outside.\" Abdulkarim said he had no doubt that if Palmyra fell to the jihadists, it would suffer a similar fate to ancient Nimrud, which they blew up earlier this year. \"If IS enters Palmyra, it will spell its destruction. \"If the ancient city falls, it will be an international catastrophe. It will be a repetition of the barbarism and savagery which we saw in Nimrud, Hatra and Mosul.\" It would not be the first time that government troops have lost control of Palmyra. Rebels held the site from February to September 2013 before government troops recaptured it. One of the ancient city's masterpieces, the Temple of Baal, suffered some damage during the accompanying artillery exchanges. But those rebels did not share the fanatical devotion of IS to demolishing all of the region's pre-Islamic heritage. There was ferocious fighting as the jihadists overran the town of Al-Suknah on Wednesday in their drive across the desert towards Palmyra. Provincial governor Talal Barazi said that 1,800 families who had fled the advancing jihadists were being sheltered in reception centres in the adjacent modern town of Tadmur. Both sides suffered heavy losses in the battle for Al-Suknah, including senior commanders, the Observatory said. The army lost 70 men, including six officers. IS lost 40 men, including two commanders, one of them the leader of the offensive. Jihadist websites named him as Abu Malik Anas al-Nashwan, who appeared in an IS video showing the beheadings of 28 Ethiopian and Eritrean Christians in Libya last month.","source":"NDTV","id":"7c1b3778-7116-40c7-a6c3-457a5614d6a4","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Modi treated to a grand feast at Xi's hometown, see how","link":"http://www.oneindia.com/international/narendra-modi-china-visit-international-xi-jinping-1747178.html","description":"Beijing, May 14: It was no Gujarati cuisine that Indian Prime Minister Narendra Modi feasted upon, but authentic Chinese vegetarian dishes. With a traditional grand Tang dynasty welcome, Modi was treated to some of the best Chinese cuisines. The starters","date":"Thu May 14 09:02:49 GMT-05:00 2015","image":{"detail":null,"sort":"http://www.oneindia.com/img/2015/05/14-1431612016-modi4.jpg"},"content":"Beijing, May 14: It was no Gujarati cuisine that Indian Prime Minister Narendra Modi feasted upon, but authentic Chinese vegetarian dishes. With a traditional grand Tang dynasty welcome, Modi was treated to some of the best Chinese cuisines. The starters included hors d'oeuvre and a spicy soup. This was followed by assorted vegetables with pancake and red bean rice and beancurd with mushroom. Some of the other items on the menu card included water chestnut in bean sauce and braised asparagus and bamboo fungus with lotus root. There is noodle, dumpling and pancake and a light fruits and sorbet for dessert. As a gesture to reciprocate Modi's hosting of Xi at his hometown-Ahmedabad, the latter hosted him outside Beijing, in his hometown Xian. The two leaders had dined last September on the banks of the Sabarmati river and Modi had served Xi with 150 Gujarati delicacies, which included Khaman and Dhokla. PM Modi is the first world leader to be hosted outside Beijing. OneIndia News","source":"ONEINDIA","id":"037d9ce4-066e-482c-9c81-e970b0b34284","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Lloyds considers options for returning capital to investors","link":"http://economictimes.indiatimes.com/news/international/business/lloyds-considers-options-for-returning-capital-to-investors/articleshow/47286005.cms","description":"Lloyds Banking Group may consider other ways of returning capital to shareholders in the future, having announced its first dividend for six-and-a-half years in February, its chairman told shareholders.","date":"Thu May 14 09:00:07 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47286010,width-310,resizemode-4/lloyds-considers-options-for-returning-capital-to-investors.jpg\" alt=\"Lloyds Banking Group may consider other ways of returning capital to shareholders in the future, having announced its first dividend for six-and-a-half years in February, its chairman told shareholders\" title=\"Lloyds Banking Group may consider other ways of returning capital to shareholders in the future, having announced its first dividend for six-and-a-half years in February, its chairman told shareholders\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47286010,width-310,resizemode-4/lloyds-considers-options-for-returning-capital-to-investors.jpg"},"content":"EDINBURGH: Lloyds Banking Group may consider other ways of returning capital to shareholders in the future, having announced its first dividend for six-and-a-half years in February, its chairman told shareholders. Norman Blackwell also confirmed to the bank's annual meeting that the bank planned to announce a dividend alongside both its half-year and full-year results this year. \"The resumption reflects the transformation of the business over the past four years,\" Blackwell said. In the medium term, Lloyds has said it plans to return at least 50 percent of its sustainable earnings to shareholders. That could include extra one-off dividends or buying back the bank's shares. \"Going forward we will think about all the options open to us if we're in the wonderful position of having excess capital,\" Blackwell told the meeting. Lloyds, part state-owned, also said 97.67 percent of shareholders at its annual meeting approved its pay plan for 2014, avoiding a significant revolt over the issue. Shareholder advisory group Pirc had recommended shareholders should reject the bank's remuneration policy, saying pay for Chief Executive Antonio Horta-Osorio was \"highly excessive\". Horta-Osorio, who was handed a package worth 11.5 million pounds ($18.2 million) in 2014, told the meeting the bank was well placed to benefit from the continued strength of Britain's economy, enabling it to return value to shareholders. \"I'm not concerned if he's delivering. If he wasn't delivering then it would be a different story,\" an individual shareholder told Reuters at the meeting. The Treasury this week reduced its Lloyds stake by a further 1 percentage point to 19.93 percent. It has now raised more than 10 billion pounds through the sale of more than half its stake in the bailed-out bank. ($1 = 0.6331 pounds)","source":"THEECONOMICTIMES","id":"45bec43e-41d5-4d8b-8be2-cc266545ae1a","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Iran leaders blast Saudi over Yemen, stress support for Assad","link":"http://timesofindia.feedsportal.com/c/33039/f/533917/s/464ff49d/sc/20/l/0Ltimesofindia0Bindiatimes0N0Cworld0Cmiddle0Eeast0CIran0Eleaders0Eblast0ESaudi0Eover0EYemen0Estress0Esupport0Efor0EAssad0Carticleshow0C472859990Bcms/story01.htm","description":"A senior Iranian official branded Saudi Arabia's King Salman a traitor to Islam on Thursday and equated the Gulf state's military assault on Iranian-allied fighters in Yemen with Israeli actions against Palestinians.","date":"Thu May 14 08:59:40 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Iran leaders blast Saudi over Yemen, stress support for Assad\" title=\"Iran leaders blast Saudi over Yemen, stress support for Assad\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47286060,width-300,resizemode-4/Ayatollah-Ali-Khamenei.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47286060,width-300,resizemode-4/Ayatollah-Ali-Khamenei.jpg"},"content":"DAMASCUS: A senior Iranian official branded Saudi Arabia's King Salman a traitor to Islam on Thursday and equated the Gulf state's military assault on Iranian-allied fighters in Yemen with Israeli actions against Palestinians. Alaeddin Boroujerdi, head of Iran's national security and foreign policy committee, was speaking a day after Iran's supreme leader Ayatollah Ali Khamenei accused the kingdom of \"crimes\" and the deputy head of Iran's military warned Riyadh of \"war\" if it attacked an Iran aid ship heading towards Yemen. \"The Saudis made a huge mistake in Yemen and the impacts of the crimes they have committed will certainly backfire on them,\" Khamenei told visiting Iraqi President Fouad Massoum on Wednesday, the official IRNA news agency reported. An alliance of Gulf Arab nations led by Saudi Arabia has been bombing the Houthi militia and allied army units that control much of Yemen since March 26 in what they say is an attempt to restore exiled President Abd-Rabbu Mansour Hadi. Iran says it will not allow Saudi-led naval forces to inspect a cargo ship bound for Yemen under military escort, following the entry into force of a truce on Tuesday. Deputy chief of Iran's Armed Forces brigader general Massoud Jazayeri told Iran's Arabic language al Alam TV on Wednesday that \"attacking Iran's Red Crescent aid ship will spark war in the region and this fire may not be put out or brought under control\". \"If this cargo ship does not reach the target, problem makers should expect Iran's reaction, America and Saudi Arabia should know that Iran's self-restraint has a limited.\" Revenge Iran's defence ministry said the United States and Saudi Arabia would be responsible for the consequences of any provocative moves,\" Iran's Students News Agency reported. Speaking in Damascus, Boroujerdi, said \"God would take revenge\" against the Saudi monarch for serving what he called US-Israeli interests in the war against the Houthi rebels. \"He should be called the traitor of the noble Haramayn and the Islamic nation and against all the teachings they are killing children in Yemen with American weapons and replicating the crimes of the Zionist entity,\" he said. Saudi Arabia is the birthplace of Islam and home of its holiest sites in Mecca and Medina — referred to in Arabic as the Haramayn. \"They will have to expect heavenly revenge,\" he said. His comments in Farsi were translated into Arabic. Boroujerdi reiterated Iran's support for Syria's government, which is battling an insurgency backed by Saudi Arabia. Shi'ite Islamist Iran has been a vital ally for Syrian President Bashar al-Assad during the four-year Syrian war, providing crucial military and economic support. \"We are here to announced anew that our support for Syria — government and nation — is solid and continuous, and we are proud of this support,\" Boroujerdi said, according to a report on the Syrian state news agency SANA. Saudi Arabia and its allies believe the Houthis are a proxy for arch-rival Iran in a regional power struggle that has helped exacerbate sectarian tensions across the Middle East. Riyadh says Iranian support for militias in Lebanon, Syria, Iraq as well as Yemen undermines strong government and boosts Sunni Muslim militants. It accused Tehran of arming the Houthis, charges the Islamic Republic denies. Israel says its military measures against Palestinians are solely intended to safeguard its own security.","source":"TimesOfIndia","id":"dc667a85-bd9c-4560-a4da-ae773bbe2f92","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Taliban claim attack on Afghan guesthouse that killed 14","link":"http://feeds.reuters.com/~r/reuters/INsouthAsiaNews/~3/huJ2K8DODBM/afghanistan-attack-idINKBN0NZ0MC20150514","description":"KABUL (Reuters) - The Afghan Taliban claimed responsibility on Thursday for an attack on a popular guesthouse in Kabul that killed at least 14 people, including foreigners attending a dinner and arriving for a concert.","date":"Thu May 14 08:59:06 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://s3.reutersmedia.net/resources_v2/images/masthead-logo.gif"},"content":"KABUL The Afghan Taliban claimed responsibility on Thursday for an attack on a popular guesthouse in Kabul that killed at least 14 people, including foreigners attending a dinner and arriving for a concert.","source":"REUTERS","id":"12b025a3-673c-4073-a7ae-b80a5de6cdc3","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"As recession fades, economist Olivier Blanchard leaving IMF: Report","link":"http://economictimes.indiatimes.com/news/international/business/as-recession-fades-economist-olivier-blanchard-leaving-imf-report/articleshow/47285692.cms","description":"Blanchard, who helped steer the Fund since 2008 and guided it through the global economic recession, told the newspaper he needs to digest the issues he's grappled with during that time.","date":"Thu May 14 08:29:36 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47285732,width-310,resizemode-4/blanchard_reuters.jpg\" alt=\"Blanchard, who helped steer the Fund since 2008 and guided it through the global economic recession, told the newspaper he needs to digest the issues he's grappled with during that time.\" title=\"Blanchard, who helped steer the Fund since 2008 and guided it through the global economic recession, told the newspaper he needs to digest the issues he's grappled with during that time.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47285732,width-310,resizemode-4/blanchard_reuters.jpg"},"content":"WASHINGTON: The International Monetary Fund's chief economist Olivier Blanchard is leaving the IMF, the Wall Street Journal reported on Thursday, saying it was not yet clear who would replace him. Blanchard, who helped steer the Fund since 2008 and guided it through the global economic recession, told the newspaper he needs to digest the issues he's grappled with during that time. He will start a new position in October as a senior fellow at the Peterson Institute for International Economics, a nonprofit think tank in Washington, the Journal reported. \"Over the past eight years, I have had to think about too many issues, with too little time to think deeply about them,\" Blanchard told the WSJ. \"It has been a fascinating eight years, but I now want to sit down and take the time.\" Reuters could not immediately confirm the report, and representatives for the IMF could not be immediately reached. The WSJ said the IMF has not said who Blanchard's possible successor may be, and that its search process has not been launched officially.","source":"THEECONOMICTIMES","id":"5936a75b-31b7-4a9f-b2d1-8d80f7109f4d","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Choppers and drone hunt for missing U.S. Huey, Nepal quake toll rises","link":"http://feeds.reuters.com/~r/reuters/INsouthAsiaNews/~3/LhJGiL1x6iQ/quake-nepal-idINKBN0NZ0FD20150514","description":"CHARIKOT, Nepal (Reuters) - Military helicopters flew over eastern Nepal and a team sent up a drone on Thursday to search for a missing U.S. Marines Huey chopper, as the death toll rose from the Himalayan country's second big earthquake in less than three weeks.","date":"Thu May 14 08:15:38 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://s3.reutersmedia.net/resources_v2/images/masthead-logo.gif"},"content":"CHARIKOT, Nepal Military helicopters flew over eastern Nepal and a team sent up a drone on Thursday to search for a missing U.S. Marines Huey chopper, as the death toll rose from the Himalayan country's second big earthquake in less than three weeks.","source":"REUTERS","id":"257b5b66-cea0-4ed8-87f9-6c8511f38a82","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"US producer prices resume downward trend in April","link":"http://economictimes.indiatimes.com/news/international/business/us-producer-prices-resume-downward-trend-in-april/articleshow/47285520.cms","description":"US producer prices resumed their downward trend in April as cost of energy fell and a strong dollar kept underlying inflation pressures benign.","date":"Thu May 14 08:15:18 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47285528,width-310,resizemode-4/loss-fall-down1_bccl.jpg\" alt=\"US producer prices resumed their downward trend in April as cost of energy fell and a strong dollar kept underlying inflation pressures benign.\" title=\"US producer prices resumed their downward trend in April as cost of energy fell and a strong dollar kept underlying inflation pressures benign.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47285528,width-310,resizemode-4/loss-fall-down1_bccl.jpg"},"content":"WASHINGTON: US producer prices resumed their downward trend in April as the cost of energy fell and a strong dollar kept underlying inflation pressures benign, supporting views that the Federal Reserve will only raise interest rates later in the year. The Labor Department said on Thursday its producer price index for final demand fell 0.4 per cent last month, declining for the third time this year. The PPI increased 0.2 per cent in March. In the 12 months through April, producer prices fell 1.3 per cent, the biggest year-on-year decline since 2010, after declining 0.8 per cent in March. Economists had forecast the PPI rising 0.2 per cent last month and falling 0.8 per cent from a year ago. A drop of 0.7 per cent in the index for final demand goods accounted for more than 70 per cent of the decline in the PPI last month. Energy prices fell 2.9 per cent after rising 1.5 per cent in March. Food prices fell for a fifth straight month. The dollar, which has gained about 11 per cent against the currencies of the United States' main trading partners since June, and lower energy prices are keeping inflation subdued. That, together with signs of a modest rebound in economic growth after a dismal first quarter, suggest the Fed should be in no rush to start tightening monetary policy. Most economists do not expect the US central bank to hike rates before September. The Fed, which has a 2 per cent inflation target, has kept its key short-term interest rate near zero since December 2008. Last month, the volatile trade services component, which mostly reflects profit margins at retailers and wholesalers, fell 0.8 per cent after slipping 0.2 per cent in the prior month. A key measure of underlying producer price pressures that excludes food, energy and trade services ticked up 0.1 per cent after rising 0.2 per cent in March.","source":"THEECONOMICTIMES","id":"451d2524-62a1-454b-ad41-446aa2e7b840","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"General Motors to invest $1 bn in renovating Michigan tech centre","link":"http://economictimes.indiatimes.com/news/international/business/general-motors-to-invest-1-bn-in-renovating-michigan-tech-centre/articleshow/47285205.cms","description":"GM said the investment will create about 2,600 jobs in core areas, including product engineering, information technology and design.","date":"Thu May 14 07:50:02 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47285214,width-310,resizemode-4/general-motors-to-invest-1-bn-in-renovating-michigan-tech-center.jpg\" alt=\"GM said the investment will create about 2,600 jobs in core areas, including product engineering, information technology and design.\" title=\"GM said the investment will create about 2,600 jobs in core areas, including product engineering, information technology and design.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47285214,width-310,resizemode-4/general-motors-to-invest-1-bn-in-renovating-michigan-tech-center.jpg"},"content":"General Motors Co said it will invest $1 billion to expand and renovate its sprawling 60-year-old technical centre in Warren, Michigan. GM said the investment will create about 2,600 jobs in core areas, including product engineering, information technology and design. The Technical Center campus currently has more than 19,000 employees and has been the nerve center of GM's engineering efforts since it was inaugurated in 1956. The 710-acre Tech Center, which is just north of Detroit, includes 38 buildings, 38.3 acres of lakes and pools and 174 acres of parking space. \"I am very excited about the investment in the GM Tech Center in Warren, which means more jobs and new revenue for police and fire services,\" Warren's Mayor Jim Fouts said. The renovation project will start this month and run through 2018, GM said.","source":"THEECONOMICTIMES","id":"e7c76a1a-a9d4-4da4-ad66-48aaaee200e9","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"US jobless claims fall; 4-week average at 15-year low","link":"http://economictimes.indiatimes.com/news/international/business/us-jobless-claims-fall-4-week-average-at-15-year-low/articleshow/47285095.cms","description":"The number of Americans filing new claims for unemployment benefits unexpectedly fell last week, indicating the jobs market was on solid footing.","date":"Thu May 14 07:38:44 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47285147,width-310,resizemode-4/us-jobless-claims-fall-4-week-average-at-15-year-low.jpg\" alt=\"The number of Americans filing new claims for unemployment benefits unexpectedly fell last week, indicating the jobs market was on solid footing.\" title=\"The number of Americans filing new claims for unemployment benefits unexpectedly fell last week, indicating the jobs market was on solid footing.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47285147,width-310,resizemode-4/us-jobless-claims-fall-4-week-average-at-15-year-low.jpg"},"content":"WASHINGTON: The number of Americans filing new claims for unemployment benefits unexpectedly fell last week, indicating the jobs market was on solid footing even as the economy struggles to regain momentum after abruptly slowing in the first quarter. Initial claims for state unemployment benefits slipped 1,000 to a seasonally adjusted 264,000 for the week ended May 9, the Labor Department said on Thursday, within a whisker of a 15-year low reached two weeks ago. Claims for the prior week were unrevised. They have been below 300,000, a threshold associated with a strengthening labor market, for 10 straight weeks. Economists polled by Reuters had forecast claims rising to 275,000 last week. A Labor Department analyst said there was nothing unusual in the state-level data and no states had been estimated. The four-week moving average of claims, considered a better measure of labor market trends as it irons out week-to-week volatility, fell 7,750 last week to 271,750. That was the lowest level since April 2000. The economy barely grew in the first quarter, held back by a range of factors, including a strong dollar, bad weather and port disruptions. Retail sales and manufacturing data suggest that while activity is picking up, the pace remains modest. The government reported last week that nonfarm payrolls increased 223,000 in April, with the unemployment rate falling to near a seven-year low of 5.4 percent. Thursday's claims report showed the number of people still receiving benefits after an initial week of aid was unchanged at 2.23 million in the week ended May 2.","source":"THEECONOMICTIMES","id":"06063ea9-a0fd-4ecf-8529-e7f1444745fa","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"European officials sing 'we are the world' at Nato meeting","link":"http://timesofindia.feedsportal.com/c/33039/f/533917/s/465003f2/sc/24/l/0Ltimesofindia0Bindiatimes0N0Cworld0Ceurope0CEuropean0Eofficials0Esing0Ewe0Eare0Ethe0Eworld0Eat0ENato0Emeeting0Carticleshow0C4728590A30Bcms/story01.htm","description":"In a distinctly different note for a military alliance meeting, European officials ended a Nato meeting with a spirited rendition of \"we are the world.\"","date":"Thu May 14 08:47:35 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://timesofindia.indiatimes.com/photo/34824568.cms"},"content":"ANTALYA (Turkey): In a distinctly different note for a military alliance meeting, European officials ended a Nato meeting with a spirited rendition of \"we are the world.\" Taking a break from issues such as the war in Ukraine and instability in the Middle East, Nato and other officials accepted an invitation by a Turkish band to sing a \"last song for peace\" at a dinner Wednesday hosted by Turkey as the alliance's foreign ministers met near the Mediterranean city of Antalya. The foreign ministers of Greece and Turkey — Mevlut Cavusoglu and Nikos Kotzias — were seen singing and swaying arm-in-arm to the tune of the 1985 charity song. Nato secretary-general Jens Stoltenberg, EU foreign policy chief Federica Mogherini and others also joined in the sing-along.","source":"TimesOfIndia","id":"6e458ce1-0978-4c9a-bd08-fe5aa43e5914","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Malaysia turns away 800 boat people; Thailand spots 3rd boat","link":"http://timesofindia.feedsportal.com/c/33039/f/533917/s/465003f1/sc/31/l/0Ltimesofindia0Bindiatimes0N0Cworld0Csouth0Easia0CMalaysia0Eturns0Eaway0E80A0A0Eboat0Epeople0EThailand0Espots0E3rd0Eboat0Carticleshow0C472857990Bcms/story01.htm","description":"Rohingya and Bangladeshis migrants abandoned at sea by human traffickers had nowhere to go Thursday as Malaysia turned away two crammed boats, and Thailand kept at bay a large vessel with hundreds of hungry people.","date":"Thu May 14 08:38:24 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Malaysia turns away 800 boat people; Thailand spots 3rd boat\" title=\"Malaysia turns away 800 boat people; Thailand spots 3rd boat\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47285830,width-300,resizemode-4/Malaysia-boat.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47285830,width-300,resizemode-4/Malaysia-boat.jpg"},"content":"LANGKAWI (Malaysia): Rohingya and Bangladeshis migrants abandoned at sea by human traffickers had nowhere to go Thursday as Malaysia turned away two crammed boats, and Thailand kept at bay a large vessel with hundreds of hungry people. \"What do you expect us to do?\" Malaysian deputy home minister Wan Junaidi Jafaar said. \"We have been very nice to the people who broke into our border. We have treated them humanely but they cannot be flooding our shores like this.\" \"We have to send the right message that they are not welcome here,\" he told The Associated Press. Four days earlier, about 1,000 refugees landed on the shores of Langkawi, a resort island in northern Malaysia near Thailand. Another 600 have arrived surreptitiously in Indonesia. Thai Prime Minister Gen Prayuth Chan-ocha also made it clear that his government does not have resources to host refugees. \"If we take them all in, then anyone who wants to come will come freely. I am asking if Thailand will be able to take care of them all. Where will the budget come from?\" Prayuth said. \"No one wants them. Everyone wants a transit country like us to take responsibility. Is it fair?\" he said. Southeast Asia for years tried to quietly ignore the plight of Myanmar's 1.3 million Rohingya but finds itself caught in a spiraling humanitarian crisis that in many ways it helped create. In the last three years, more than 120,000 members of the Muslim minority, who are intensely persecuted in Buddhist-majority Myanmar, have boarded ships to flee to other countries, paying huge sums to human traffickers. But faced with a regional crackdown, the smugglers have abandoned the ships, leaving an estimated 6,000 refugees to fend for themselves, according to reliable aid workers and human rights groups. \"This is a grave humanitarian crisis demanding an immediate response,\" said Matthew Smith, executive director of nonprofit human rights group Fortify Rights. \"Lives are on the line.\" Despite appeals by the UN and aid groups, no government in the region — Thai, Indonesian or Malaysian — appears willing to take the refugees, fearing that accepting a few would result in an unstoppable flow of poor, uneducated migrants. Wan Junaidi said about 500 people on a boat found Wednesday off northern Penang state were given provisions and sent on their way. Another boat carrying about 300 migrants was turned away near Langkawi island overnight, according to two Malaysian officials who declined to be identified because they weren't authorized to speak to the press. Meanwhile, a boat carrying 300 Rohingya was spotted at the Thai-Malaysian maritime border in Satun province, Thailand's deputy government spokesman Maj. Gen. Sansern Kaewkamnerd said. The Thai navy contacted the migrants, who said they \"wanted to travel to a third country and asked for help in repairing their boat and asked for food and water,\" Sansern said. \"None of them wanted to go to the Thai shore but wanted to travel to a third country,\" he said. \"Thai sailors have given them what they wanted by providing food and water for them. Currently, they are in the process of repairing the broken engine.\" The repairs will finish tonight, he said. Malaysia, which is not a signatory of international conventions on refugees, is host to more than 150,000 refugees and asylum seekers, the majority of whom are from Myanmar. More than 45,000 of them are Rohingya, according to the UN refugee agency, many more than almost any other country. But because they have no legal status, job opportunities are limited. They also have little or no access to basic services like education and health care, and are vulnerable to arrests and deportation. A small number are resettled to third countries. Phil Robertson of Human Rights Watch Asia accused Indonesia, Thailand and Malaysia of playing \"a three-way game of human ping pong.\" At the same time, the three countries and others in Southeast Asia have for years bowed to the wishes of Myanmar at regional conferences, avoiding all discussions of state-sponsored discrimination against the Rohingya. Denied citizenship by national law, members of the Rohingya minority are effectively stateless. They have limited access to education or adequate health care and cannot move around freely. They have been attacked by the military and chased from their homes and land by extremist Buddhist mobs in a country that regards them as illegal settlers. Wan Junaidi, the deputy home minister, said it was time to put pressure on Myanmar to address the Rohingya crisis. \"You talk about democracy, but don't treat your citizens like trash, like criminals, until they need to run away to our country,\" he said. Increasingly over the years, Rohingya boarding boats in the Bay of Bengal have been joined by Bangladeshis seeking an escape from poverty. Their first stop until recently was Thailand, where migrants were held in jungle camps until their families could raise hefty ransoms so they could continue onward. The smugglers changed tactics after recent crackdowns and began holding people on large ships offshore. Initially migrants were shuttled to shore in groups on smaller boats after their \"ransoms\" were paid. But as agents and brokers on land got spooked by arrests — not just of traffickers but also police and politicians — they went into hiding. That created a bottleneck, with migrants stuck on boats for days and weeks.","source":"TimesOfIndia","id":"a9968062-c71d-48b4-845f-2eb088a68091","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Yemen aid starts to flow as truce mostly holds","link":"http://feeds.reuters.com/~r/reuters/INworldNews/~3/eQVa0Wtn9dk/story01.htm","description":"RIYADH (Reuters) - Relief agencies on Thursday used a five-day humanitarian truce in Yemen to expand aid distribution to some of the millions deprived of food, fuel and medicine by weeks of fighting and air strikes.","date":"Thu May 14 08:34:34 GMT-05:00 2015","image":{"detail":"<img src=\"http://s3.reutersmedia.net/resources/r/?m=02&amp;d=20150514&amp;t=2&amp;i=1048316544&amp;w=644&amp;fh=&amp;fw=&amp;ll=&amp;pl=&amp;r=LYNXMPEB4D0N5\" border=\"0\" alt=\"A UNHCR employee arranges aid at Dubai International Humanitarian city in Dubai, United Arab Emirates, before shipping them to Yemen May 14, 2015. REUTERS/Lara Sukhtian\">","sort":"http://s3.reutersmedia.net/resources/r/?m=02&d=20150514&t=2&i=1048316544&w=644&fh=&fw=&ll=&pl=&r=LYNXMPEB4D0N5"},"content":"RIYADH Relief agencies on Thursday used a five-day humanitarian truce in Yemen to expand aid distribution to some of the millions deprived of food, fuel and medicine by weeks of fighting and air strikes.","source":"REUTERS","id":"af1fa850-907c-4c6d-b919-7334db967342","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Al-Qaeda-linked Belmokhtar group in N Africa claims allegiance to ISIS: report","link":"http://indianexpress.com/article/world/middle-east-africa/al-qaeda-linked-belmokhtar-group-in-n-africa-claims-allegiance-to-isis-report/","description":"Al-Akhbar said it had identified the voice in the recording as that of Saharaoui.","date":"Thu May 14 08:31:05 GMT-05:00 2015","image":{"detail":"<img class=\"size-full wp-image-2356992\" src=\"http://images.indianexpress.com/2015/05/islamic-state-l.jpg\" alt=\"Islamic State, Indian Islamic State group, Indian Islamic State module, Indian Islamic State volunteers, Islamic State jihadist, india news, nation news\" width=\"759\" height=\"422\">","sort":"http://images.indianexpress.com/2015/05/islamic-state-l.jpg"},"content":"The Al-Qaeda-linked group of notorious one-eyed Algerian militant Mokhtar Belmokhtar has pledged allegiance to the Islamic State group, according to an audio recording broadcasted by private Mauritanian agency Al-Akhbar. “The Al-Murabitoun movement pledges its allegiance to the caliph of Muslims Abu Bakr al-Baghdadi, thereby banishing divisions and dissent within the nation,” said Adnan Abou Walid Sahraoui, a leading member of the group, in the recording. Al-Akhbar said it had identified the voice in the recording as that of Saharaoui. AFP was unable to obtain immediate confirmation from other sources.","source":"INDIAN EXPRESS","id":"e52bd5a2-85d2-45de-b468-886cd66b14bb","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Luxembourg PM to Become Second Serving Leader to Wed Gay Partner","link":"http://feedproxy.google.com/~r/ndtv/TqgX/~3/XCA-9euAejI/story01.htm","description":"Luxembourg's prime minister on Friday becomes the first serving leader in the European Union to marry someone of the same sex, and only the second worldwide -- and all in a tiny, mostly Catholic count...","date":"Thu May 14 08:30:33 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"Luxembourg PM to Become Second Serving Leader to Wed Gay Partner\" alt=\"Luxembourg PM to Become Second Serving Leader to Wed Gay Partner\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-05/prime-minister-xavier-bettel_650x400_71431611525.jpg\">","sort":"http://i.ndtvimg.com/i/2015-05/prime-minister-xavier-bettel_650x400_71431611525.jpg"},"content":"Luxembourg:  Luxembourg's prime minister on Friday becomes the first serving leader in the European Union to marry someone of the same sex, and only the second worldwide -- and all in a tiny, mostly Catholic country often considered rather conservative. Xavier Bettel, 42, and his civil partner Gauthier Destenay are among the first gay men to exercise their right to wed since the Grand Duchy in January become the latest EU state to extend full rights to same-sex marriages. \"Everyone's warm and positive,\" broadcaster Stephane Bern, a long-time friend who will be a guest at the quiet civil ceremony, was quoted as saying by the Luxemburger Wort newspaper. \"It won't be a flashy ceremony but the symbolism's very strong.\" A lawyer who became mayor of the city of Luxembourg at 38, Bettel has long been open about his sexuality and plays down its significance. He notes that his coalition deputy is also gay. Five years ago, Johanna Sigurdardottir, then the prime minister of Iceland, became the first serving leader in the world to marry a same-sex partner. Bettel took power 18 months ago after his centre-right party won elections that ended 19 years in power for Jean-Claude Juncker, who now heads the European Commission in Brussels. Shortly after Luxembourg's parliament last year became the ninth EU legislature to clear the way for gay marriage, Bettel told the Los Angeles Times that Destenay, a Belgian architect who has been his civil partner since 2010, had proposed. \"I said 'Yes',\" he said. \"I have just one life and I don't want to hide my life.\" © Thomson Reuters 2015","source":"NDTV","id":"32461bab-20f7-4f65-aaba-b267187696c5","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Boat crammed with Rohingya migrants found adrift in Thai waters","link":"http://timesofindia.feedsportal.com/c/33039/f/533917/s/464fb1cc/sc/31/l/0Ltimesofindia0Bindiatimes0N0Cworld0Crest0Eof0Eworld0CBoat0Ecrammed0Ewith0ERohingya0Emigrants0Efound0Eadrift0Ein0EThai0Ewaters0Carticleshow0C472854580Bcms/story01.htm","description":"Dozens of visibly weak-looking people were on the deck of the stricken vessel, which was found adrift several kilometres (miles) off the southern Thai island of Koh Lipe, in the Andaman Sea, according to AFP correspondents at the scene.","date":"Thu May 14 08:10:15 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Boat crammed with Rohingya migrants found adrift in Thai waters\" title=\"Boat crammed with Rohingya migrants found adrift in Thai waters\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47285508,width-300,resizemode-4/Rohingya-VIII.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47285508,width-300,resizemode-4/Rohingya-VIII.jpg"},"content":"(OFF KOH LIPE) Thailand: A boat crammed with scores of Rohingya migrants, including many young children, was found drifting in Thai waters on Thursday, with passengers telling AFP that several fellow boatpeople had died over the past few days. Dozens of visibly weak-looking people were on the deck of the stricken vessel, which was found adrift several kilometres off the southern Thai island of Koh Lipe, in the Andaman Sea, according to AFP correspondents at the scene. \"About 10 people died during the journey. We threw their bodies into the water,\" one migrant shouted in Rohingya to a boat carrying reporters. \"There are 300 of us ... we have been at sea for two months. We want to go to Malaysia but we have not reached there yet.\" READ ALSO: Malaysia to push back Rohingya unless boats are sinking A group of women wearing headscarves who were huddled on the deck cried as reporters approached, one AFP correspondent said, many with young children and toddlers in their arms. \"My children are sick and we haven't had anything to eat for a week,\" a mother of four who gave her first name as Sajida shouted out. The words \"We are Myanmar Rohingya\" were daubed in English on a black flag tethered to the wooden boat, while a large tarpaulin had been erected to protect the stricken and weak migrants from the blazing tropical sun. Many of the male migrants were topless and wearing only stained lungi cloth wraps. Initially there was no immediate sign of Thai authorities who have apparently been scouring the area for a number of vessels laden with migrants adrift in the area. Eventually a Thai navy helicopter dropped food packages into the sea and was later joined by other boats. Desperate scenes followed as several emaciated men jumped into the sea to retrieve the packages, one of them eating handfuls of raw instant noodles in the water before swimming back to the boat. READ ALSO: Around 6,000 Rohingya migrants stranded at sea Rights groups fear hundreds, possibly thousands, of Rohingya have been cast adrift on rickety boats in the Andaman Sea in recent days, abandoned by smuggling gangs spooked by a belated crackdown on the thriving people-smuggling trade in southern Thailand. Both the UN's refugee agency and the International Organization for Migration have called for a coordinated search and rescue effort, something regional nations have so far resisted. Instead Malaysia and Indonesia have vowed to bar boats bearing desperate migrants from Myanmar and Bangladesh after nearly 2,000 boatpeople were rescued or swum to shore earlier this week. A Malaysian official, speaking on condition on anonymity, told AFP on Thursday two vessels carrying a combined 600 migrants had been turned away. Thailand has long practised a policy of encouraging migrants to continue their journeys towards Malaysia. \"They want to go to Malaysia but the ship has no engine, it was scuttled by their broker,\" navy Lieutenant Commander Veerapong Nakprasit said, referring to the latest vessel. \"We will send a technician to fix the engine so they can go to their destination.\" READ ALSO: 500 Rohingya Muslims from Myanmar wash to shore in Indonesia Major General Sunsern Kaewkumnerd, a junta spokesman, said Prime Minister Chan-O-Cha had been made aware of the boat. He said Thailand was willing to provide humanitarian assistance but if the migrants aim for Thailand they will be treated as \"illegal immigrants\". \"The refugees want to go to a third country,\" he said, adding that navy officials expected the engine to be fixed later on Thursday.","source":"TimesOfIndia","id":"675665b9-6940-4912-8119-9a214229a76b","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Modi's gift diplomacy continues! PM gifts Buddhist relics, Buddha statue to President Xi Jinping","link":"http://www.oneindia.com/international/modi-s-gift-diplomacy-continues-pm-gifts-buddhist-relics-buddha-statue-to-xi-jinping-1747073.html","description":"Beijing, May 14: In yet another example that shows how skilled Prime Minister Narendra Modi is when it comes to selecting gifts for the heads of the states he visits, PM Modi today presented Chinese President Xi Jinping replicas of a","date":"Thu May 14 08:09:48 GMT-05:00 2015","image":{"detail":null,"sort":"http://www.oneindia.com/img/2015/05/14-1431608801-modigifttoxijinping.jpg"},"content":"Beijing, May 14: In yet another example that shows how skilled Prime Minister Narendra Modi is when it comes to selecting gifts for the heads of the states he visits, PM Modi today presented Chinese President Xi Jinping replicas of a stone casket of Buddhist relics and a stone statue of Buddha to tie the neighbouring countries with the common thread of Buddhist culture. By gifting these antiques, excavated from a 3rd-4th century AD stupa at Dev-ni-Mori - a site 80 kms east of Vadnagar, Gujarat - in 1957, a PIB communique said. In addition, PM Modi presented archaeological drawings of excavations at Vadnagar which was one of the places visited by the great Chinese traveller Xuanzang - also known as Hieun Tsang - around 641 AD.  Also read: PM Narendra Modi &amp; President Xi Jinping speak on key issues  PM Modi had earlier won hearts of US President Barack Obama, French President Francois Hollande, Pakistan's PM Nawaz Sharif, his Australian counterpart Tony Abbott, and various others through his unique choice of gifts. The site is referred to as Anandpur in Xuanzang's writings and recent excavations point to the existence of a thriving Buddhist centre at Vadnagar way back in 2nd century AD. PM gifted replicas of a stone casket of Buddhist relics &amp; a stone statue of Buddha to Chinese President Mr.Xi Jinping pic.twitter.com/9aIWk7FWB1— PIB India (@PIB_India) May 14, 2015    The Prime Minister visited the Giant Wild Goose Pagoda today where Xuanzang worked for years to translate the sutras that he brought to China from India. Recent excavations at Vadnagar have revealed a burnt brick structure that has been identified as a Buddhist monastery on the basis of its peculiar plan and the antiquities recovered from it, which include a red sandstone broken head of Buddha, stylistically datable to 2nd century AD, a votive tablet with foot impression, and a crescent-shaped stone tray depicting the scene of a monkey offering honey to Buddha. In his writings, Xuanzang had recorded that there were more than 1000 monks of the Sammitiya School or Little Vehicle in ten monasteries at Vadnagar, suggesting that Vadnagar was an important centre of Buddhist learning in western India during that period. In ancient times, Vadnagar was situated at a strategic location where two major ancient trade routes crossed each other. One of them was from central India to Sindh and to further northwest whiles the other from the port towns on the Gujarat coast to Rajasthan and north India. Therefore, it could have been a city of ample opportunities until these routes remained vibrant. Prime Minister Narendra Modi today began a three-day visit to China from this north west city, the hometown of Chinese President Xi Jinping with whom he held \"very substantive\" discussions focussing on strengthening of mutual trust and the boundary issue. On his first visit to China since assuming office last year, Modi was warmly greeted by Xi, who set aside protocol to receive a foreign dignitary outside Beijing in replay of the Indian leader's gesture in September last when he welcomed the Chinese President in his hometown Ahmedabad. OneIndia News","source":"ONEINDIA","id":"79318446-3bcb-4d3b-818b-755bf640b987","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Nepal PM lends helicopter to woman badly hurt in earthquake","link":"http://timesofindia.feedsportal.com/c/33039/f/533993/s/464fb1c9/sc/16/l/0Ltimesofindia0Bindiatimes0N0Cworld0Csouth0Easia0CNepal0EPM0Elends0Ehelicopter0Eto0Ewoman0Ebadly0Ehurt0Ein0Eearthquake0Carticleshow0C472853860Bcms/story01.htm","description":"A Nepali woman seriously injured by falling debris in Tuesday's earthquake was airlifted to a Kathmandu hospital today in the Prime Minister's helicopter, after two British paramedics pleaded with officials to help save her life.","date":"Thu May 14 08:05:22 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Nepal PM lends helicopter to woman badly hurt in earthquake\" title=\"Nepal PM lends helicopter to woman badly hurt in earthquake\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47285451,width-300,resizemode-4/nepalQuake-Army.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47285451,width-300,resizemode-4/nepalQuake-Army.jpg"},"content":"CHARIKOT (NEPAL): A Nepali woman seriously injured by falling debris in Tuesday's earthquake was airlifted to a Kathmandu hospital on Thursday in the Prime Minister's helicopter, after two British paramedics pleaded with officials to help save her life. Prime Minister Sushil Koirala was on a visit to Charikot town in Dolakha district, around 70km east of Kathmandu and one of the areas worst affected by the latest tremor to hit the Himalayan nation still reeling from a massive quake last month. READ ALSO: Earthquake shakes Nepal again, people spend night in open As Koirala sat in an army tent where he was being briefed on the rescue effort, a few metres away two advanced paramedics were hand-pumping oxygen into an elderly woman at a makeshift medical camp, keeping her alive. The woman had been taken to Charikot from her village on Thursday morning after being hit on the head by falling debris during this week's quake. Her family said her condition had deteriorated. The paramedics told Reuters they had spent an hour pleading with army officials to tell Koirala that his helicopter was needed to transport the woman to a hospital in the capital. \"I said 'If I stop doing this, this lady will die. Do you understand?',\" paramedic Phil Llewellyn, who arrived on May 5 to help the Nepal Red Cross Society, recalled telling a Nepalese army official. The paramedics eventually spoke to the helicopter's pilot, who informed the Prime Minister. In this photograph taken on May 13, 2015, Nepalese residents walk past destroyed buildings after two earthquakes in three weeks shook the country in Chautara in north-eastern Nepal. (AFP photo) READ ALSO: Another strong earthquake hits Nepal, close to Everest Mercy flight Within seconds, soldiers dashed out of the tent where they had been briefing Koirala, loaded the woman on to a stretcher and put her on board the helicopter, along with the paramedics. The helicopter landed at an army hospital in Kathmandu where paramedics kept her breathing. A 70-year-old woman, later named by army doctors as Manamaya B K, underwent emergency surgery lasting several hours. She was then moved to an intensive care unit and put on a ventilator. Her prognosis was unclear. \"We can only hope for the best,\" the doctor said. Full coverage: Nepal-India earthquake It was not possible to confirm that Manamaya was the woman evacuated on Koirala's helicopter. However, a paramedic who was meeting helicopters at the army hospital said that only one chopper had come from Charikot on Thursday. The Nepali government has been criticised by some for being slow to react to the April 25 earthquake which killed more than 8,000 people and destroyed hundreds of thousands of buildings. More than 100 died in a second big tremor that struck on Tuesday, causing further damage and landslides. Back in Charikot, the two British paramedics returned to the prime minister, who was waiting to board his chopper. READ ALSO: Nepal, India struck by another powerful earthquake \"Thank you for the helicopter. You saved her life,\" paramedic Ed Hullah told Koirala. \"It's our duty ... We do the maximum. We leave no stone unturned,\" Koirala said before boarding. Nepalese army soldiers cover themselves as helicopter carrying PM Sushil Koirala arrives at Charikot, the administrative center of the hardly hit Dolakha district, Nepal on May 14. (AP photo)","source":"TimesOfIndia","id":"764a7610-5c50-420b-868d-5aa86497167e","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Foreign Secretary S Jaishankar talks about Modi, Jinping meet","link":"http://ibnlive.in.com/news/foreign-secretary-s-jaishankar-talks-about-modi-jinping-meet/545619-3.html","description":"PM Modi visit to China included the hour long talks about the border issues and how to develop counter terrorism co-operation against terrorism as both the countries needed lot of discussion on strenghtening and increasing convergance.","date":"Thu May 14 08:01:53 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/ibnhome/article_new/facebook-icon-bt.png\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/ibnhome/article_new/facebook-icon-bt.png"},"content":"PM Modi visit to China included the hour long talks about the border issues and how to develop counter terrorism co-operation against terrorism as both the countries needed lot of discussion on strenghtening and increasing convergance.","source":"IBNLIVE","id":"c136001c-869d-4495-b4a0-44ec48bf387f","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"9 killed in Boko Haram clash in NE Nigeria: sources","link":"http://indianexpress.com/article/world/middle-east-africa/9-killed-in-boko-haram-clash-in-ne-nigeria-sources/","description":"The assault was the first on Maiduguri for three months and came after sweeping offensives against Boko Haram strongholds.","date":"Thu May 14 07:56:36 GMT-05:00 2015","image":{"detail":"<img class=\"size-full wp-image-2299121\" src=\"http://images.indianexpress.com/2015/02/boko-haram-l1.jpg\" alt=\"This offensive by Boko Haram comes as Nigerians prepare for a closely contested presidential election on March 28. (Source: AP)\" width=\"759\" height=\"422\">","sort":"http://images.indianexpress.com/2015/02/boko-haram-l1.jpg"},"content":"At least three soldiers, six vigilantes and dozens of Boko Haram insurgents have been killed during clashes in the restive northeast Nigerian city of Maiduguri, sources said today. The militants launched an attack on the Borno state capital yesterday evening but were repelled by Nigerian troops after intense fighting, residents and the army said. The assault was the first on Maiduguri for three months and came after sweeping offensives against Boko Haram strongholds by a regional military coalition of Nigeria, Niger, Chad and Cameroon. “Three soldiers were killed during a fight with the terrorists while six of our members were killed by three female suicide bombers,” civilian vigilante official Yusuf Sani said. Related Nigeria army rescues 300 girls from Boko Haram stronghold, none from Chibok Boko Haram attacks Nigerian town, kills 11 Nigerian, Chad jets bomb Boko Haram in North-east offensive “The terrorists suffered serious casualties,” he said, without specifying a figure, adding that 12 vigilantes were injured by the shrapnel of the detonated bombs. An army official, who did not want to be identified, confirmed Sani’s account. “We rounded them and killed many of them… I cannot tell you the number of we killed them,” he added. The army imposed a dusk-to-dawn curfew today in the aftermath of the attack. Streets were deserted and only soldiers and police were seen patrolling. Schools, markets and public buildings, including hospitals, were also closed. Army spokesman Colonel Tanko Gusau said the lock-down was ordered “to protect lives and properties of innocent and law-abiding people of Maiduguri”. The attack saw dozens of militants armed with heavy guns and rocket-propelled grenades storm the northern outskirts of the city near the Giwa military base. Shots were fired and explosives detonated indiscriminately, locals said. The army said female suicide bombers had detonated explosives before the attack. Sources said the assailants had made attempts to overrun the military facility, which was attacked on March 14 last year, freeing hundreds of detained Boko Haram suspects. A member of the civilian vigilantes, who assist the military with security and intelligence, said the attack could have been a reprisal for losses incurred in today’s offensive on their camp some 40 kilometres (25 miles) outside Maiduguri.","source":"INDIAN EXPRESS","id":"b82be69f-c236-4396-853f-c7ad6673d58a","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Burundi state radio off air: Witness","link":"http://timesofindia.feedsportal.com/c/33039/f/533917/s/464f8d6a/sc/23/l/0Ltimesofindia0Bindiatimes0N0Cworld0Crest0Eof0Eworld0CBurundi0Estate0Eradio0Eoff0Eair0EWitness0Carticleshow0C472851120Bcms/story01.htm","description":"State-run radio in Burundi went off the air today, an AFP correspondent and a station director said, after pro-coup troops launched a major assault on the state broadcaster.","date":"Thu May 14 07:40:20 GMT-05:00 2015","image":{"detail":"<img pg=\"\" vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" width=\"300\" border=\"0\" alt=\"Burundi state radio off air: Witness\" title=\"Burundi state radio off air: Witness\" src=\"http://timesofindia.indiatimes.com/thumb/msid-47285157,width-300,resizemode-4/Burundi.jpg\">","sort":"http://timesofindia.indiatimes.com/thumb/msid-47285157,width-300,resizemode-4/Burundi.jpg"},"content":"BUJUMBURA (BURUNDI): State-run radio in Burundi went off the air on Thursday, an AFP correspondent and a station director said, after pro-coup troops launched a major assault on the state broadcaster. \"We are being attacked. It is very heavy. The transmitter has been cut. We cannot transmit,\" a station director told AFP by telephone from inside the building. The attack came after state radio broadcast a message from the president, who is out of the country. The struggle for control of the broadcaster came after pro-Nkurunziza loyalists destroyed several independent radio stations which had been used by the rebel troops to broadcast their messages. Before broadcasts were halted, a general supporting the coup told AFP that the main units fighting to oust the president had been ordered to seize the station, and vowed \"this should be done quickly because we have the means\". Heavy fighting between rival Burundian troops erupted in the capital on Thursday, the day after a top general launched a coup to oust the central African nation's president. The attempted coup capped weeks of deadly civil unrest sparked by the president's controversial bid to stand for a third term, which the opposition says is unconstitutional and against the peace deal that ended a civil war in 2006.","source":"TimesOfIndia","id":"7772deaa-e23c-4962-94eb-e452be4506c1","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Indian Scientist Find Rare Plant with Potential Anti-Cancer Properties","link":"http://www.newindianexpress.com/world/Indian-Scientist-Find-Rare-Plant-with-Potential-Anti-Cancer-Properties/2015/05/14/article2814222.ece","description":"he plant, with botanical name Miquelia dentate Bedd, is a small climbing shrub producing anti-cancer alkaloid, Camptothecine (CPT)","date":"Thu May 14 07:27:58 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"BANGALORE: A team of Indian scientists has discovered in the Western Ghats a rare plant which could open up possibilities for cancer treatment. The plant, with botanical name Miquelia dentate Bedd, is a small climbing shrub producing anti-cancer alkaloid -- Camptothecine (CPT). It occurs sparsely in Madikeri Forests in Kodagu in Karnataka, the researchers reported. The team of scientists from Ashoka Trust for Research in Ecology and Environment, Bengaluru and University of Agricultural Sciences, Bengaluru and Dharwad, who found the plant is now working on its commercial cultivation. \"We plan to introduce this plant in coffee plantations and in arecanut gardens. We have been doing some experiments in this regard with some of the planters in collaboration with Forestry College Sirsi as well as University of Agricultural Sciences, Bengaluru,\" said one of the lead study authors G. Ravikanth. \"The challenge however is to mass multiply this plant,\" Ravikanth, fellow at Suri Sehgal Centre for Biodiversity and Conservation under Ashoka Trust for Research in Ecology and Environment, Bengaluru, noted. Camptothecine is an important anti-cancer compound extracted from several plant species belonging to Asterid clade. It is a potent inhibitor of the intra-nuclear enzyme topoisomerase-I, which is required in DNA replication and transcription. Several semi-synthetic drugs such as Hycamtin (topotecan) and Camptostar (irinotecan or CPT 11) are derived from CPT and are currently in clinical use against ovarian, small lung and refractory ovarian cancer. \"Our aim is to see that we (India) also produce in Campthothecine both for our own use as well as for the global market,\" Ravikanth noted. Several plant species producing CPT have been found in India. But the demand for CPT has resulted in extensive felling of the woody trees and plants like Nothapodytes nimmoniana, which is now on the verge of extinction and declared vulnerable. The findings were detailed in the latest edition of Indian Journal on Biotechnology.","source":"NEW INDIAN EXPRESS","id":"29146c22-8283-4ccf-be39-4309e581f573","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Border, Trade Deficit Figure in Modi-Xi Summit Talks","link":"http://www.newindianexpress.com/world/Border-Trade-Deficit-Figure-in-Modi-Xi-Summit-Talks/2015/05/14/article2814213.ece","description":"Foreign Secretary said the two leaders spoke of the need to strengthen cooperation on countering terrorism and strengthening mutual trust.","date":"Thu May 14 07:20:52 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/Narendra-Modi_China-1.jpg/2015/05/14/article2814211.ece/alternates/w620/Narendra%20Modi_China%201.jpg\" alt=\"India's Prime Minister Narendra Modi (L) and China's President Xi Jinping shake hands. |AFP\">","sort":"http://media.newindianexpress.com/Narendra-Modi_China-1.jpg/2015/05/14/article2814211.ece/alternates/w620/Narendra%20Modi_China%201.jpg"},"content":"XI'AN: Prime Minister Narendra Modi and Chinese President Xi Jinping held \"substantive\" summit level talks here on Thursday during which the border issue, trade deficit and connectivity issues were discussed. The two leaders, who held talks at the Shaanxi Guest House for about 90 minutes, later visited the Wild Goose Pagoda together. Modi, who arrived here in the morning, was warmly welcomed by Xi at the guest house and the two leaders shook hands for photographs. The prime minister said he was humbled by the welcome he received at Xi'an and termed it an honour for 1.25 crore Indians he was representing. Modi, attired in a black bandhgala suit, spoke in Hindi, while Xi spoke in Chinese. The Chinese president recalled his visit to Ahmedabad in September last year, during which Modi received him and also presented a colourful event for Xi and his wife at the Sabarmati river front, in a break from usual practice. \"You received me very warmly in your hometown. I am very glad to receive you in my hometown,\" Xi said. \"That left me with deep and good impression,\" the Chinese president said. Foreign Secretary S. Jaishankar, briefing the media on the talks, said the two leaders spoke of the need to strengthen cooperation on countering terrorism and strengthening mutual trust. The talks were on \"strengthening trust and increasing convergences\", Jaishankar said. The border issue, especially maintaining peace and tranquillity on the border, were also discussed, he said. The trade deficit and the investment climate came up, as well as connectivity issues, the foreign secretary said. Xi said it was the first time he was meeting a foreign leader outside Beijing. Jaishankar said the two leaders also discussed sharing information on trans-border rivers. \"The talks were wide ranging, and regional, global issues came up. The talks were very substantive and the atmosphere was very comfortable. Both leaders built on the chemistry that started last September during the visit of Xi to India,\" he said. He said the Chinese president spoke of the \"miracle of Gujarat\" under Modi and said the prime minister was \"trying to do it at the national level\". \"Terrorism naturally came up,\" Jaishankar said, and added that both discussed the need to strengthen anti-terror cooperation. He said there was reference to the terror attack in Kabul and Karachi. Four Indians were among 14 people killed in a Taliban attack at a guest house in Afghanistan's capital city of Kabul overnight on Wednesday. On Wednesday, at least 45 people were killed and 20 injured in a terror attack in Karachi. \"There was talk of Nepal. How India and China responded (to the earthquake),\" he said. \"UNSC reforms came up and India's membership of NSG (Nuclear Suppliers Group) came up,\" he added. Later, Modi and Xi visited the Wild Goose Pagoda, a sacred Buddhist place for worship. Xi took Modi around the pagoda, which was built in 652 A.D. during the Tang dynasty and originally had five storeys. Modi handed over a Bodhi sapling to a priest and lit incense at the Buddhist temple. One of the pagoda's many functions was to hold sutras and figurines of the Buddha that were brought to China from India by Buddhist translator and traveller Xuan Zang or Hieun Tsang.","source":"NEW INDIAN EXPRESS","id":"d9e1017e-d27c-4aa8-aa95-a757169d5ce3","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"US nominates new army and navy chiefs","link":"http://ibnlive.in.com/news/us-nominates-new-army-and-navy-chiefs/545620-2.html","description":"US President Barack Obama has nominated General Mark Milley as the next Army chief of staff and Admiral John Richardson as the next chief of naval operations, Defense Secretary Ashton Carter said on Thursday.","date":"Thu May 14 07:16:10 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/03_2014/obama-to-propose-ending-nsa-bulk-collection-of-phone-records_250314114547.jpg\" width=\"669px\" title=\"US nominates new army and navy chiefs\" alt=\"US nominates new army and navy chiefs\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/03_2014/obama-to-propose-ending-nsa-bulk-collection-of-phone-records_250314114547.jpg"},"content":"Washington: US President Barack Obama has nominated General Mark Milley as the next Army chief of staff and Admiral John Richardson as the next chief of naval operations, Defense Secretary Ashton Carter said on Thursday. \"Both Ray and John have been tremendous leaders for their respective services over these last four years: four years that have been critical for our military and for the country, marked by an ever- changing security environment and persistent budget turbulence, but also by magnificent performance by these two services under their leadership,\" Carter said. They would replace General Ray Odierno, and Admiral John Greenert respectively. Carter said General Milley is a warrior and a statesman. \"Both Ray and John have been tremendous leaders for their respective services over these last four years: four years that have been critical for our military and for the country.\" Carter said. #barack obama #ashton carter #us #us defence \"He not only has plenty of operational and joint experience in Afghanistan and Iraq and on the joint staff, but he also has the intellect and vision to lead change throughout the Army,\" he said. \"When he was in Afghanistan as commanding general of ISAF joint command, I had a lot of opportunities to observe Mark on the ground leading our coalition of allies and partners and helping the Afghan people prepare to take responsibility for their own security,\" he said. Admiral John Richardson was a clear choice, Carter said. \"He's a bold thinker, a tremendous leader, and the go-to officer for many of the Navy's tough issues in recent years, from preparing for the Ohio- class replacement ballistic missile submarine to handling problems of integrity and ethics,\" he said. \"The President has chosen a phenomenal leader in General Mark Milley as the 39th Chief of Staff of the Army. General Milley is an experienced combat tested, and caring leader,\" Odierno said in a statement.","source":"IBNLIVE","id":"de0f9822-70a1-415e-8de4-9266a1e99b09","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"In Talks With President Xi, PM Modi Raised Stapled Visa Row","link":"http://feedproxy.google.com/~r/ndtv/TqgX/~3/eFFkztU7sfQ/story01.htm","description":"During his 90-minute talks with Chinese President Xi Jinping today, Prime Minister Narendra Modi raised a series of stress points for their countries, including how China issues visas to applicants fr...","date":"Thu May 14 07:07:18 GMT-05:00 2015","image":{"detail":"<img itemprop=\"image\" title=\"PM Narendra Modi Raises Stapled Visas in China, State-Run TV Shows Distorted India Map\" alt=\"PM Narendra Modi Raises Stapled Visas in China, State-Run TV Shows Distorted India Map\" id=\"story_image_main\" src=\"http://i.ndtvimg.com/i/2015-05/modi-and-xi-at-xian-afp_650x400_71431606598.jpg\">","sort":"http://i.ndtvimg.com/i/2015-05/modi-and-xi-at-xian-afp_650x400_71431606598.jpg"},"content":"Beijing:  During his 90-minute talks with Chinese President Xi Jinping today, Prime Minister Narendra Modi raised a series of stress points for their countries, including how China issues visas to applicants from Arunachal Pradesh, which it claims as Southern Tibet.   Sources said the PM raised India's objections to visas being stapled to the passports of Arunachal residents, instead of stamps within.   A map of India carried on state-run China television channel CCTV removed Kashmir and Arunachal Pradesh, raising a controversy on Twitter.     Sources tell NDTV Mr Modi also shared concerns with President Xi about the $46 billion economic corridor that China is building through Pakistan-Occupied Kashmir. Sources say that on the contentious issues, there was a free and candid exchange of views. \"It was very substantive and I would say the atmosphere was very comfortable, so in a sense it was building on the chemistry between the two of them that started last September... on the political side, there was a lot of discussion on strengthening trust and increasing convergence. Political issues were discussed, boundary issues were discussed, including peace and tranquility on the border,\" said Foreign Secretary S Jaishankar. In a major departure from protocol by the Chinese leadership,  the PM  became the first world leader to be hosted outside Beijing  -  at President Jinping's hometown of Xi'an. In his opening remarks, PM Modi, wearing a black bandhgala suit, expressed his appreciation for the President's gesture. \"This is an honour to 125 crore Indians whom I am representing as Prime Minister,\" he said.   Last year, when President Xi visited India, he met with the PM in his home state of Gujarat, an encounter that was referred to today. \"You received me very warmly in your hometown. I am very glad to receive you in my hometown,\" said the Chinese leader.    The focus now shifts to Beijing tomorrow where the PM 's talks are expected to yield trade agreements worth $10 billion.  ","source":"NDTV","id":"d388de27-5c31-4868-87f7-eecb532f0a0c","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"14-year-old Indian-American boy wins National Geographic Bee","link":"http://ibnlive.in.com/news/14yearold-indianamerican-boy-wins-national-geographic-bee/545604-2.html","description":"Karan Menon, a 14-year-old Indian-American student, has won the prestigious National Geographic Bee competition in the US, in which the top three positions were bagged by Indian-origin contestants. Menon, an eighth grader from New Jersey, competed against 10 finalists from across the US to win the 2015 National Geographic Bee championship held yesterday at National Geographic headquarters here. Of the 10 finalists, seven were of Indian-origin.","date":"Thu May 14 07:04:54 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/karan_menon_ap.jpg\" width=\"669px\" title=\"14-year-old Indian-American boy wins National Geographic Bee\" alt=\"14-year-old Indian-American boy wins National Geographic Bee\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/karan_menon_ap.jpg"},"content":"Washington: Karan Menon, a 14-year-old Indian-American student, has won the prestigious National Geographic Bee competition in the US, in which the top three positions were bagged by Indian-origin contestants. Menon, an eighth grader from New Jersey, competed against 10 finalists from across the US to win the 2015 National Geographic Bee championship held yesterday at National Geographic headquarters. Of the 10 finalists, seven were of Indian-origin. In addition to winning the title of National Geographic Bee champion, Menon received a $85,000 college scholarship, lifetime membership in the National Geographic Society and an expedition for two to the Galapagos Islands aboard the Lindblad ship National Geographic Endeavour. Menon has added his name to a long list of Indian-origin kids who have made their mark over the years in the similarly coveted spelling bee championships in the US. The first-runner up and recipient of a $25,000 college scholarship was 11-year-old Shriya Yarlagadda of Michigan. Karan Menon has added his name to a long list of Indian-origin kids who have made their mark over the years in the similarly coveted spelling bee championships in the US. #us #karan menon #national geographic bee #galapagos islands The third place and a $10,000 college scholarship went to Sojas Wagle of Arkansas, a 13-year-old eighth grader. Menon answered all seven championship-round questions correctly to win the title. The final question, which clinched the win for Menon, was: \"If completed, the proposed Grand Inga Dam would become the world's largest hydropower plant. This dam would be built near Inga Falls on which African river?\" The Congo River was the correct answer. Yarlagadda missed just the first question: \"Mariupol, a city located at the mouth of the Kalmius River, is located on what sea that is an arm of the Black Sea?\" The correct answer was Sea of Azov. Seven other finalists, who each won $500, were Kapil Nathan, a 10-year-old fifth grader from Birmingham, Alabama; Nicholas Monahan, a 12-year-old sixth grader from Idaho; Patrick Taylor, a 12-year-old seventh grader from Iowa; Abhinav Karthikeyan, a 12-year-old sixth grader from Maryland; Lucy Chae, a 13-year-old seventh grader from Massachusetts; Shreyas Varathan, a 14-year-old eighth grader from Minnesota; and Tejas Badgujar, a 13-year-old eighth grader from Pennsylvania. More than 4 million students in over 11,000 schools in all 50 states, the District of Columbia, US Atlantic and Pacific territories and Department of Defense Dependents Schools took part in the National Geographic Bee this year. After winning the competition Menon said, \"I'm on top of the world right now.\" Menon said he found the questions to be \"really challenging\". \"Some of them I'd studied, but for some of them, I had to take a risk. I just had to go with my gut and say an answer,\" he was quoted as saying by 'MyCentralJersey.com'. He said he's always been interested in geography, a subject which helps one become a \"global citizen.\" \"I've always liked looking at maps, seeing where each location is and learning about the different parts the world,\" he said. \"You get to see how and what it is like outside the boundaries of your hometown,\" he said. \"Geography really connects these dots together. It's good to know about the world you live in. You learn about the various cultures around the world and how they live and the topography,\" he said. Yarlagadda said it felt \"great\" to be the runner-up. The sixth-grader said that studying is part of her daily routine. \"I gather various facts and I put them together into my fact files, and study those,\" she said. Yarlagadda, one of only six girls to make it to nationals this year, also expressed disappointment at not being able to participate again in the competition next year since prize winners are not eligible for future competitions. The National Geographic Bee held last year was also won by an Indian-American student, Akhil Rekulapelli, from Virginia. Indian-American kids regularly participate and win in similar competitions, like the spelling bee. Last year, two Indian-American kids Sriram Hathwar, 14, and Ansun Sujoe, 13, had created history by jointly winning the Scripps National Spelling Bee, the first time in 52 years that two participants won the contest. The win by the duo was the seventh consecutive year that Indian-American students retained the spelling bee title, a trend that was started by Sameer Mishra who won the contest in 2008. In another record-breaking contest, 13-year-old Kush Sharma emerged as the winner of a local spelling bee competition in Missouri last year defeating a middle school student in an epic duel that had lasted for a total of 95 rounds in two installments after the judges ran out of words in a previous round.","source":"IBNLIVE","id":"ca480f64-05d7-49b7-9435-a0c3907225a8","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Xi greets Modi in ancestral home town with eye to trade ties","link":"http://feeds.reuters.com/~r/reuters/INworldNews/~3/hfVSPI1idZI/story01.htm","description":"BEIJING (Reuters) - Chinese President Xi Jinping hosted Indian Prime Minister Narendra Modi in his ancestral home town at the start of a three-day visit to China on Thursday as the two Asian giants work to boost economic ties despite decades of mistrust.","date":"Thu May 14 07:01:41 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://s3.reutersmedia.net/resources_v2/images/masthead-logo.gif"},"content":"BEIJING Chinese President Xi Jinping hosted Indian Prime Minister Narendra Modi in his ancestral home town at the start of a three-day visit to China on Thursday as the two Asian giants work to boost economic ties despite decades of mistrust.","source":"REUTERS","id":"b2600d21-1324-4aac-a3a8-d12f37866a59","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Chinese company sends 12,000+ on Thai holiday","link":"http://www.oneindia.com/international/chinese-company-sends-12000-on-thai-holiday-1746965.html","description":"Bangkok, May 14: A Chinese company is sending more than 12,000 people on a holiday to Thailand, tourism officials said today, with one resort hosting a series of back-to-back banquets catering to thousands of guests at a time. Thailand's tourism","date":"Thu May 14 06:55:57 GMT-05:00 2015","image":{"detail":null,"sort":"http://www.oneindia.com/img/2015/05/14-1431605510-china.jpg"},"content":"Bangkok, May 14: A Chinese company is sending more than 12,000 people on a holiday to Thailand, tourism officials said today, with one resort hosting a series of back-to-back banquets catering to thousands of guests at a time. Thailand's tourism body said the enormous group of holidaymakers was one of the largest they had accommodated from a company in China, where employees and customers are often rewarded for meeting targets. \"It will be a challenge but it's one we relish,\" Chattan Kunjara Na Ayudhya, the executive director of the Tourism Authority of Thailand's public relations wing, told AFP. The 12,700 tourists are being sent by Infinitus China, a direct sales company, and began arriving in Thailand on 10 May, Chattan said. They will travel in groups of 2-3,000 at a time and will make a six-day trip to Bangkok and the nearby seaside town of Pattaya, he added. Those arriving include both employees of the firm as well as freelance sales staff and regular customers. The visit comes less than a week after France received more than 6,000 Chinese holidaymakers from a single Chinese firm that booked 4,760 rooms in 79 four-and five-star hotels. Itthiphol Kunplome, Pattaya's mayor, confirmed that the first batch of nearly 3,000 employees had begun arriving in his city. \"We are ready to welcome them and ready to facilitate their activities while they are in Pattaya,\" he told AFP. A tour guide involved in the colossal task of organising 400 coach trips to ferry the groups said 300 colleagues would be on hand until the last holidaymaker leaves on 23 May. \"The company chose Thailand because they were impressed with our beaches, temples, cultural performances and fruits,\" he told AFP, asking not to be named. Chattan said all the guests would attend one of a series of giant banquets at the Royal Cliff Hotel in Pattaya. A planning schedule seen by AFP shows the hotel intends to host four nights of giant banquets, the largest of which will feed 3,935. Tourism is one of Thailand's largest earners, usually accounting for around 10 percent of GDP, and China sends the largest number of tourists. But the industry has taken a hit, thanks to ongoing political instability and a significant drop in Russian arrivals following the rouble's depreciation. AFP","source":"ONEINDIA","id":"8ca3c36e-4cba-4882-9bee-57e62d01d1d5","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Philippines Factory Fire Toll Rises to 72","link":"http://www.newindianexpress.com/world/Philippines-Factory-Fire-Toll-Rises-to-72/2015/05/14/article2814165.ece","description":"Authorities are yet to determine the exact number of people present in the factory at the time the fire broke out.","date":"Thu May 14 06:44:44 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/Philippine_Factory-Fire.jpg/2015/05/14/article2814164.ece/alternates/w620/Philippine_Factory%20Fire.jpg\" alt=\"Relatives of the victims killed in a fire that gutted a footwear factory the day before attend a briefing from local government officials, held at a makeshift morgue set up at a village hall in Valenzuela City in suburban Manila. |AFP\">","sort":"http://media.newindianexpress.com/Philippine_Factory-Fire.jpg/2015/05/14/article2814164.ece/alternates/w620/Philippine_Factory%20Fire.jpg"},"content":"MANILA: The toll in the fire on Wednesday at a footwear factory in Valenzuela municipality, in the Philippines capital Manila, has risen to 72, Interior Minister Mar Roxas said on Thursday. The minister visited the gutted factory on Thursday morning and said the number of casualties could rise further as some people are still missing, Rappler news network confirmed. Most victims were found on the second floor, to where workers were believed have rushed to escape the fire, according to Sergio Soriano of the fire department, The Star newspaper reported. The blaze which took seven hours to be extinguished began when sparks from welding equipment used to repair a broken gate ignited flammable chemicals in nearby barrels. Authorities are yet to determine the exact number of people present in the factory at the time the fire broke out. Parts of the building remained inaccessible until early Thursday. The interior minister announced financial compensation for the families of the victims and a rigorous investigation to determine responsibility for the accident. Bureau of Fire Protection officials told the media on Thursday that they would investigate if the facility had official certification and had complied with safety regulations.","source":"NEW INDIAN EXPRESS","id":"93cbb7e3-440c-4762-b0af-f6aea9a8eb4c","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Protests Greet Wider Powers to Japan Defence Forces","link":"http://www.newindianexpress.com/world/Protests-Greet-Wider-Powers-to-Japan-Defence-Forces/2015/05/14/article2814162.ece","description":"So far, the government has been required to enact a special law each time it wants to dispatch the SDF for overseas logistical support.","date":"Thu May 14 06:37:53 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"TOKYO: Protests greeted the Japanese cabinet approval on Thursday to a legislative package which would give the Japan Self-Defence Forces (JSDF) greater powers, including removal of geographical restrictions on where the forces can operate. The national security package, including a permanent bill on international peace assistance and the other comprising revisions to 10 existing laws, will remove geographical restrictions on where the JSDF can operate, Xinhua news agency reported. Earlier in the day, over 500 people gathered outside the Japanese Prime Minister's Office (PM0) in Tokyo protesting the cabinetr approval to the bills. People held placards condemning that the move would undermine the country's pacifist constitution and drag Japan into war.  So far, the government has been required to enact a special law each time it wants to dispatch the SDF for overseas logistical support. After the enactment of the permanent bill, the SDF personnel could be dispatched overseas at any time when needed. The other provision would allow Japan to exercise, on a limited scope, the right to collective self-defence, or coming to the aid of allies under armed attack even if Japan itself is not attacked. The cabinet will present those bills to the Diet, Japan's bicameral parliament, on Friday.","source":"NEW INDIAN EXPRESS","id":"ab919b01-dcb7-45c2-b175-a2fab8a74551","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Corrected - Afghan clerics uneasy as civil rights movement gains momentum","link":"http://feeds.reuters.com/~r/reuters/INworldNews/~3/SSm0YDWg60E/story01.htm","description":"(Corrects 13th paragraph to remove a reference that could not be verified to protesters shouting \"Death to the Koran\" in this story released on May 11)","date":"Thu May 14 06:34:39 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://s3.reutersmedia.net/resources_v2/images/masthead-logo.gif"},"content":"(Corrects 13th paragraph to remove a reference that could not be verified to protesters shouting \"Death to the Koran\" in this story released on May 11)","source":"REUTERS","id":"866f87ba-f864-48c3-b958-499b00dba2a1","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"U.S. House passes bill to end mass collection of phone data","link":"http://www.thehindu.com/news/international/us-house-passes-bill-to-end-mass-collection-of-phone-data/article7205706.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"The U.S. House of Representatives have passed the Freedom Act, replacing the controversial Patriot Act.","date":"Thu May 14 06:34:26 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/USA-SECURITYNSA_jp_2405998f.jpg\" class=\"main-image\" alt=\"Edward Snowden in 2013 leaked thousands of documents to journalists that reported that NSA for many years have been secretly collecting all records of U.S. landline phone calls.\" width=\"636\" height=\"477\" title=\"Edward Snowden in 2013 leaked thousands of documents to journalists that reported that NSA for many years have been secretly collecting all records of U.S. landline phone calls.\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/USA-SECURITYNSA_jp_2405998f.jpg"},"content":"The US House of Representatives on Thursday voted overwhelmingly to end the NSA’s bulk collection of Americans’ phone records, a controversial programme made public in 2013 by former security contractor Edward Snowden. The U.S. House of Representatives have passed the Freedom Act, replacing the controversial Patriot Act. The Freedom Act, which now goes to the Senate, extends many parts of the Patriot Act that ends on June 1. The Freedom bill was passed 338 to 88 votes on Wednesday. Congressman Jerrold Nadler, senior member of the House Judiciary Committee and Ranking Member of the Subcommittee on Courts and Intellectual Property, said the bill prohibits the intelligence community from engaging in bulk data collection within the U.S. “This practice — the dragnet collection, without a warrant, of telephone records and internet metadata — is the contemporary equivalent to the writs of assistance that early American revolutionaries opposed, and that the Fourth Amendment was drafted to address. It has never complied with the Constitution, and must be brought to an end without delay,” he said. Mr. Snowden in 2013 leaked thousands of documents to journalists that reported that NSA for many years have been secretly collecting all records of U.S. landline phone calls. The House Speaker John Boehner said the U.S.A. Freedom Act helps in preventing attacks on the U.S. by allowing authorities to monitor terrorists who enter the country, and increasing penalties for those who support them. “It ensures Americans’ civil liberties are protected by ending bulk records collection and enhancing transparency of the FISA court. In short, this critical measure continues our focus on putting Americans’ priorities first,” he said. Voting against the bill, Congresswoman Tulsi Gabbard said it does not go far enough to reform the Patriot Act and the overreaching surveillance activities that are currently being conducted. “Congress should not set precedence by codifying these surveillance programmes that the Federal Courts have ruled are illegal. Congress should let these controversial provisions expire and instead work toward comprehensive reform of the Patriot Act that will truly keep the American people safe and free,” she said. Welcoming the passage of the Freedom Act, the Software Alliance President and CEO Victoria Espinel said public trust is critical to today’s technology economy, and passing this legislation will strengthen trust in both government surveillance programs and the U.S. technology industry. “By voting to end bulk data collection and improve transparency in the public and private sectors, the House has taken an important step in ensuring our national security and restoring public confidence. We urge the Senate to take swift action by passing this bill before the expiration of the current authorities,” he said.","source":"THEHINDU","id":"c81c51bf-c57d-419c-80a2-f853257a986a","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Serb Court Quashes Treason Conviction of WWII General","link":"http://www.newindianexpress.com/world/Serb-Court-Quashes-Treason-Conviction-of-WWII-General/2015/05/14/article2814160.ece","description":"For decades, Mihailovic's fate has fueled division in Serbia, where many see him as a hero who died for political reasons.","date":"Thu May 14 06:31:44 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"BELGRADE, Serbia: A Belgrade court on Thursday quashed the treason conviction of Gen. Draza Mihailovic for his collaboration with Nazis during World War II, politically rehabilitating the controversial Serbian guerrilla commander almost 70 years after he was sentenced and shot to death by communists. For decades, Mihailovic's fate has fueled division in Serbia, where many see him as a hero who died for political reasons. The Higher Court of Belgrade said Thursday that the verdict from July 1946 is now \"null and void.\" The ruling was met with a thunderous applause by dozens of Mihailovic's supporters who filled the courtroom. Dozens more flag-waving nationalist supporters and leftist opponents of Mihailovic gathered outside and were kept apart by riot police. \"Thank God for this!\" cried Novica Djoric, wearing the trademark beard and black shirt of the so-called Chetnik movement — named after Mihailovic's WWII guerrilla troops. An opponent, Aleksandar Djekic, described the ruling as a \"big shame and a mockery of all the victims of fascism.\" Supporters of WWII Yugoslav communist partisans maintain that Mihailovic collaborated with the Nazi occupiers, and non-Serbs in the former Yugoslavia have accused his troops of atrocities. Historian Srdjan Milosevic described the ruling as \"regretable\" and bound to cause negative reactions in the Balkan region, still recovering from bloody breakup of the former Yugoslavia in the 1990s when Serbian nationalist troops were accused of crimes against other ethnic groups. As a Yugoslav royal army officer, Mihailovic launched a resistance movement in 1941 against German occupation, before turning against communist guerrillas later in the war. When World War II was over, he was jailed and sentenced to death in a hasty trial. He was buried in an unmarked grave. In 1948, U.S. President Harry Truman posthumously awarded Mihailovic the Legion of Merit for his role in rescuing hundreds of U.S. airmen downed by the Nazis over Serbia.","source":"NEW INDIAN EXPRESS","id":"7317bf1e-8fd9-42e2-b564-3a53de9cae51","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Suspected Ugandan rebels kill at least 22 in eastern Congo","link":"http://feeds.reuters.com/~r/reuters/INworldNews/~3/NeE3B6KV8yo/story01.htm","description":"KINSHASA (Reuters) - Suspected Ugandan rebels killed at least 22 people in eastern Democratic Republic of Congo late on Wednesday, local officials said, the third deadly attack on civilians in the region in the last week.","date":"Thu May 14 06:30:01 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://s3.reutersmedia.net/resources_v2/images/masthead-logo.gif"},"content":"KINSHASA Suspected Ugandan rebels killed at least 22 people in eastern Democratic Republic of Congo late on Wednesday, local officials said, the third deadly attack on civilians in the region in the last week.","source":"REUTERS","id":"3aeff485-83b9-4f43-98a9-d57bb3e14422","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Bombardier Aerospace unit to cut 1,800 jobs: Report","link":"http://economictimes.indiatimes.com/news/international/business/bombardier-aerospace-unit-to-cut-1800-jobs-report/articleshow/47283953.cms","description":"The report from La Presse on Thursday said the majority, or about 1,000 of the cuts, will be in its home base of Montreal.","date":"Thu May 14 06:19:57 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47284228,width-310,resizemode-4/bombardierjet1_bccl.jpg\" alt=\"The company last week warned that it may cut production of its profitable Global business jets, due to weak demand.\" title=\"The company last week warned that it may cut production of its profitable Global business jets, due to weak demand.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47284228,width-310,resizemode-4/bombardierjet1_bccl.jpg"},"content":"TORONTO: Canadian train and aircraft maker Bombardier Inc plans to announce 1,800 job cuts in its aerospace division on Thursday, according to a newspaper report. The report from La Presse on Thursday said the majority, or about 1,000 of the cuts, will be in its home base of Montreal. The company last week warned that it may cut production of its profitable Global business jets, due to weak demand. While earnings from business jets were steady in the first quarter, net orders dropped to 19 from 46 a year earlier. On a conference call at the time, Chief Executive Alain Bellemare said the weakness was in the Global large-jet program.","source":"THEECONOMICTIMES","id":"f894b736-5eab-4fd2-a4cf-762b95a871f7","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"'On-demand' startups see surge in venture capital","link":"http://economictimes.indiatimes.com/news/international/business/on-demand-startups-see-surge-in-venture-capital/articleshow/47283936.cms","description":"Startups in the \"on-demand\" sector which offer speedy services on a smartphone app -- are seeing an unprecedented surge in venture capital","date":"Thu May 14 06:18:25 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47284165,width-310,resizemode-4/on-demand-startups-see-surge-in-venture-capital.jpg\" alt=\"&quot;On-demand&quot; start-ups such as Uber are seeing an unprecedented surge in venture capital.\" title=\"&quot;On-demand&quot; start-ups such as Uber are seeing an unprecedented surge in venture capital.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47284165,width-310,resizemode-4/on-demand-startups-see-surge-in-venture-capital.jpg"},"content":"WASHINGTON:Startups in the \"on-demand\" sector -- such as Uber and Instacart, which offer speedy services on a smartphone app -- are seeing an unprecedented surge in venture capital, a new report showed Thursday. Funding for on-demand companies jumped 514 percent last year to $4.12 billion, and new investments in early 2015 have totaled at least $3.78 billion, according to venture capital research firm CB Insights. The rush to funding highlights the growing ability of emerging tech companies to raise venture capital at an early stage, without resorting to a more complicated stock offering. The on-demand sector is one of the hottest, led by the ride-hailing service Uber, which according to unconfirmed reports has been in talks to raise an additional $1.5 billion, an amount that could boost its valuation to $50 billion. Uber has confirmed that it has already raised more that $5.5 billion, according to CB Insights. Others in this segment include ride-sharing rival Lyft which has raised $862 million, lodging service Airbnb ($794 million) and local delivery group Instacart ($275 million). The on-demand sector also includes Thumbtack, a way to connect consumers and professional contractors such as painters ($148 million) and Handy, which offers services such as house cleaning and furniture assembly ($58 million). The sector has raised $9.4 billion since 2010, but most of that has come in the past 18 months, according to the research firm. \"In 2010, there were under 20 (venture capital) investors that had done a deal in on-demand mobile services,\" the report said. \"At the end of April 2015, that figure has risen to 198. Said another way, there are 14 times the number of investors in the on-demand space.\" Nearly two out of three of these firms are based in California, with 18 percent in New York, and significant numbers in Texas, Illinois and Massachusetts. The most active investor groups in the sector have been SV Angel, Andreessen Horowitz and First Round Capital, the report said. In addition to ride-sharing, a key segment includes startups in local delivery of food and other items, including Postmates, Sprig, Caviar and Doordash and others providing personal services such as errand-runner TaskRabbit and Shyp, which offers on-demand shipping.","source":"THEECONOMICTIMES","id":"7c7dce34-7f39-47b3-a08e-0bcbdf73dcdd","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"UK experts urge $2bn global fund for researching development of antibiotics","link":"http://economictimes.indiatimes.com/news/international/business/uk-experts-urge-2bn-global-fund-for-researching-development-of-antibiotics/articleshow/47283637.cms","description":"The global pharmaceutical industry should set up a $2.0 billion global innovation fund to kickstart research into developing more antibiotics.","date":"Thu May 14 06:01:58 GMT-05:00 2015","image":{"detail":"<img vspace=\"0\" marginheight=\"0\" marginwidth=\"0\" border=\"0\" width=\"310\" src=\"http://economictimes.indiatimes.com/thumb/msid-47283838,width-310,resizemode-4/uk-experts-urge-2bn-global-fund-for-researching-development-of-antibiotics.jpg\" alt=\"The global pharmaceutical industry should set up a $2.0 billion global innovation fund to&amp;nbsp;kickstart&amp;nbsp;research into developing more antibiotics.\" title=\"The global pharmaceutical industry should set up a $2.0 billion global innovation fund to&amp;nbsp;kickstart&amp;nbsp;research into developing more antibiotics.\">","sort":"http://economictimes.indiatimes.com/thumb/msid-47283838,width-310,resizemode-4/uk-experts-urge-2bn-global-fund-for-researching-development-of-antibiotics.jpg"},"content":"LONDON: The global pharmaceutical industry should set up a $2.0 billion (1.8-billion euro) global innovation fund to help kickstart research into developing more resistant antibiotics, experts said on Thursday. The report was by the British government appointed Review on Antimicrobial Resistance committee, which has warned that drug-resistant microbes could kill 10 million people a year worldwide by 2050. \"We need to kickstart drug development to make sure the world has the drugs it needs,\" the review's author, economist Jim O'Neill, told the BBC. O'Neill, who used to work at Goldman Sachs investment bank, has also warned that antimicrobial resistance -- when bugs become immune to existing drugs -- could cost $100 trillion in lost economic output. Speaking on the BBC Panorama programme, he said big pharma should act with \"enlightened self-interest\". \"If it gets really bad, somebody is going to come gunning for these guys just how people came gunning for finance\" during the 2008 global financial crisis, he said. He said a fund with $2.0 billion over five years would give a vital boost to research and development by universities and small biotech companies. The report said that one potential direction was the development of \"resistance breakers\" that could boost the effectiveness of existing antibiotics without the additional cost of developing new ones. With $2.0 billion over five years, the fund could prioritise payment to universities and small biotech companies and break the link between profitability of the drug and volume of sales. \"Too many good ideas are not being pursued for lack of funding,\" the report said. O'Neill was appointed by Prime Minister David Cameron last year. The World Health Organization last month warned that the world was doing far too little to combat the misuse of antibiotics, which is fuelling drug resistance and allowing treatable diseases to become killers. In its first ever analysis of how countries are responding to the problem of antimicrobial resistance, the UN health agency revealed \"major gaps\" in all six regions of the world. \"This is the single greatest challenge in infectious diseases today,\" Keiji Fukuda, WHO's assistant director general for health security, said in a statement.","source":"THEECONOMICTIMES","id":"b4a35372-d6e2-43ef-a2a0-3cbb14d3bda4","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"},{"title":"Obama Assuaging Arab Countries by Accusing Iran: Minister","link":"http://www.newindianexpress.com/world/Obama-Assuaging-Arab-Countries-by-Accusing-Iran-Minister/2015/05/14/article2814133.ece","description":"The US president was hosting Persian Gulf Arab leaders and officials of the Gulf Cooperation Council in his Camp David resort.","date":"Thu May 14 05:54:09 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/Obama-Arab_Summit.jpg/2015/05/11/article2808832.ece/alternates/w620/Obama-Arab_Summit.jpg\" alt=\"|File Photo: AP\">","sort":"http://media.newindianexpress.com/Obama-Arab_Summit.jpg/2015/05/11/article2808832.ece/alternates/w620/Obama-Arab_Summit.jpg"},"content":"TEHRAN: Iran's top diplomat has dismissed US President Barack Obama's recent anti-Iran remarks, saying the comments are aimed at pleasing Washington's Arab allies. Reacting to remarks by Obama, who called Iran a \"state sponsor of terrorism\" in an interview with Arab newspaper Asharq Al-Awsat, Iranian Foreign Minister Mohammad Javad Zarif said the comments were \"merely a repetition of previous baseless accusations\" and were intended to calm US allies, Fars news agency reported on Thursday. \"These allegations have been proven groundless time and again,\" Zarif said. During the Asharq Al-Awsat interview, which was published on Wednesday, Obama also said the Arab states of the Persian Gulf were right to be concerned about Iran's activities in the region. The Iranian foreign minister said Tehran's policies in the region were based on \"the enhancement of friendship and cooperation and responsible action to strengthen stability and guarantee security in the region\". The US president was hosting Persian Gulf Arab leaders and officials of the Gulf Cooperation Council in his Camp David resort. The meeting was widely viewed as an attempt to ease Arab concerns over a possible nuclear deal between Iran and the P5+1 group of major world powers. The Islamic Republic and the P5+1 countries -- the US, China, France, Russia, Britain plus Germany -- have been negotiating to reach a comprehensive deal over a peaceful Iranian nuclear programme.Iran sought the removal of sanctions on the country in return for enhanced transparency in its civilian nuclear work.","source":"NEW INDIAN EXPRESS","id":"a5fc0d98-ada1-4276-af64-4f90bf4b3224","category":"WORLD","order":null,"colorCode":"#E49E1B","displayName":"WORLD"}],"lastupdated":1431619237786,"category":"WORLD","refreshInt":5,"colorCode":"#E49E1B","displayName":"WORLD"}