{"feed":[{"title":"Approach SC in Jayalalithaa case: SPP recommends State","link":"http://www.thehindu.com/news/national/tamil-nadu/approach-sc-in-jayalalithaa-case-spp-recommends-state/article7205929.ece?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication","description":"Karnataka High Court on May 11 had acquitted all the accused in the disproportionate assets case.","date":"Thu May 14 09:55:10 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02402/B_V__ACHARYA_2402876f.jpg\" class=\"main-image\" alt=\"Special Public Prosecutor B.V. Acharya File photo\" width=\"636\" height=\"423\" title=\"Special Public Prosecutor B.V. Acharya File photo\">","sort":"http://www.thehindu.com/multimedia/dynamic/02402/B_V__ACHARYA_2402876f.jpg"},"content":"Special Public Prosecutor B.V. Acharya on Thursday recommended the Karnataka Government to file an appeal in the Supreme Court against the Karnataka High Court’s verdict of acquitting AIADMK General Secretary J. Jayalalithaa and three others in the disproportionate assets case. After going through the 919-page verdict for the past three days, Mr. Acharya has said that \"it is a fit case for appeal\" before the Apex Court. Karnataka High Court on May 11 had acquitted all the accused, holding that no evidence were available against them while setting aside the September 27, 2014 verdict of the Special Court, which had convicted and sentenced them to four years imprisonment.","source":"THEHINDU","id":"ca3ecc7c-5a88-4399-8214-67c5635f7cae","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Public prosecutor Acharya favours appealing against Jayalalithaa's acquittal in DA case before SC","link":"http://ibnlive.in.com/news/public-prosecutor-acharya-favours-appealing-against-jayalalithaas-acquittal-in-da-case-before-sc/545626-62-128.html","description":"The Karnataka government of Chief Minister Siddaramaiah is yet to decide whether to appeal or not.","date":"Thu May 14 08:42:19 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/03_2014/ls-polls-jayalalithaa-goes-all-guns-blazing-for-40-seats_220314013325.jpg\" width=\"669px\" title=\"Public prosecutor Acharya favours appealing against Jayalalithaa's acquittal in DA case before SC\" alt=\"Public prosecutor Acharya favours appealing against Jayalalithaa's acquittal in DA case before SC\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/03_2014/ls-polls-jayalalithaa-goes-all-guns-blazing-for-40-seats_220314013325.jpg"},"content":"Chennai: Special Public Prosecutor (SPP) BV Acharya will recommend an appeal against the acquittal of All India Anna Dravida Munnetra Kazhagam (AIADMK) supremo and former Tamil Nadu chief minister Jayalalithaa in the disproportionate assets case to the Karnataka government. Acharya said on Thursday that the verdict quashing the sentence and conviction of Jayalalithaa by the Karnataka High Court is a fit case to appeal before the Supreme Court. The Karnataka government of Chief Minister Siddaramaiah is yet to decide whether to appeal or not. Karnataka High Court judge Justice CR Kumaraswamy while acquitting Jayalalithaa had observed that she had received loans worth Rs 24 crore. But the actual figures come up to only Rs 10 crore, so there is a mistake of about Rs 14 crore, said Acharya. The Karnataka government of Chief Minister Siddaramaiah is yet to decide whether to appeal or not. #special public prosecutor #bv acharya #jayalalithaa #all india anna dravida munnetra kazhagam According to Acharya Jayalalithaa's total disproportionate assets (DA) is Rs 16.34 crore and not Rs 2.82 crore as the High Court judge said. The assets are 76% disproportionate and not just 8.12% as per HC, Acharya said. BV Acharya, who actually built a very strong case against Jayalalithaa during his previous tenure as the Special Public Prosecutor said, \"In page 852, judge says prosecution has not taken into account the income part of accused by obtaining loans from nationalised banks. Have given particulars of loans from different banks from which loans were rejected. The judge says total loans received are Rs 24 crore. There is some mistake in adding up. Actual figure comes to only Rs 10 crore. Thus there is a mistake to the extent of about Rs 14 crore. The DA will come to Rs 16.34 crore, as against Rs 2 crore. Therefore, there is a glaring arithmetical error in terms calculation.\" \"Fundamental mistake is in totalling 10 items of the loan. Since this glaring mistake has come to my notice, I am considering all options available. If the Supreme Court appeal is decided, this will be an excellent point to prove that acquittal of Jaya is wrong,\" he added. When asked if he is asking for stay on the judgment, Acharya said, \"It is a matter of deep consideration. I can't say anything positive now.\" In a huge relief for Jayalalithaa, the Karnataka High Court on Monday set aside her conviction in the disproportionate assets case paving the way for her return to active politics. Soon after the High Court assembled, Justice CR Kumaraswamy pronounced the judgement acquitting her in the 18-year-old disproportionate assets case starting wild celebrations by AIADMK workers and leaders in Bengaluru and back in Tamil Nadu. With her acquittal, her disqualification under the Representation of People's Act (RPA) also stands cancelled and she can become the Chief Minister of Tamil Nadu once again. She can now take over as Tamil Nadu Chief Minister by removing her aide O Paneerselvam and then lead the AIADMK in the Assembly election due in May 2016.","source":"IBNLIVE","id":"82aac0e9-789c-4e9a-8122-7130ed412c31","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Three drown in Swarnamukhi river","link":"http://www.thehindu.com/news/national/andhra-pradesh/three-drown-in-swarnamukhi-river/article7205949.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"A pal of gloom descended on Lakshmipuram of Sitanagaram mandal of Vizianagaram District on Thursday with the confirmation of deaths of three persons who got drowned in Swarnamukhi River. ...","date":"Thu May 14 07:52:42 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"A pal of gloom descended on Lakshmipuram of Sitanagaram mandal of Vizianagaram District on Thursday with the confirmation of deaths of three persons who got drowned in Swarnamukhi River. The deceased were identified as Krishna (42) and his relatives Mahendra (9) and Nagendra (7). According to the police, both kids who came to Lakshmipuram for summer vacation went for swimming along with their uncle. They thought that there was not much depth and nothing would happen while swimming. The kids got drowned and Krishna also lost his life while trying to save them. Sitanagaram police sent bodies for postmortem and registered a case.","source":"THEHINDU","id":"1e9efad2-9e39-4c53-8c16-2acfe28e6249","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Bidar school achieves 100% results in SSLC exams","link":"http://www.thehindu.com/news/national/karnataka/bidar-school-achieves-100-results-in-sslc-exams/article7205948.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Dr. Channabasava Pattaddevaru High Sschool in Kamal Nagar has achieved 100 per cent results in SSLC examinations. As many as 12 of the students have scored more than 90 per cent marks, 3...","date":"Thu May 14 07:51:26 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"Dr. Channabasava Pattaddevaru High Sschool in Kamal Nagar has achieved 100 per cent results in SSLC examinations. As many as 12 of the students have scored more than 90 per cent marks, 31 above 80 per cent, and 18 in first class. Trust president Sri Basavalinga Pattaddevaru, and others have congratulated the students. This is the eighth year of 100 per cent results, said a release by principal Prakash Mankari.","source":"THEHINDU","id":"f4d54e46-99d6-4579-88be-fe07517091d7","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Hiremath releases documents on BDA’s exchange deeds","link":"http://www.thehindu.com/news/national/karnataka/hiremath-releases-documents-on-bdas-exchange-deeds/article7205938.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Seeks suspension of Shyam Bhat, demands inquiry","date":"Thu May 14 07:48:33 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"Releasing documents on the ‘exchange deeds’ by BDA under Commissioner Shyam Bhat, Founder-President of Samaj Parivartan Samudaya (SPS) S.R. Hiremath alleged that Mr. Bhat had executed the deeds despite Additional Advocate General’s (AAG) advise against the execution. The deeds had been executed in the name of one Mr. Nagaraj. Addressing presspersons here on Thursday, Mr. Hiremath pointed out that Mr. Bhat’s predecessor Bharatlal Meena had rejected Mr. Nagaraj’s request for seeking alternate sites (for total 4.13 acres) in Arkavati Layout instead of Kempe Gowda Layout. Quoting the legal opinion given to BDA by AAG K.M. Nataraj, Mr. Hiremath said, “A power of attorney is, as is well known, a document of convenience and not document of conveyance. Under GPA no transfer can be affected to create any right of title in favour of the power of Attorney Holder and the power of Attorney holder can only execute the documents for and on behalf of the allottee and no land can be allotted in his name”. However, despite the clear legal opinion, Mr. Shyam Bhat had not only allotted alternate sites in the name of Mr. Nagaraj instead of the allottees, but also executed as many as four exchange deeds to allot sites with better road connectivity to benefit Mr. Nagaraj, which clearly spoke about the extent of illegalities and irregularities committed by the BDA commissioner, Mr. Hiremath said. Mr. Hiremath demanded immediate suspension of Mr. Shyam Bhat and urged the Chief Minister to hand over the issue for investigation to Justice Santosh Hegde.","source":"THEHINDU","id":"7664b697-48cb-4f89-8fd8-37fa2f132453","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Monsoon rains may hit Kerala coast around May 30: Weather office","link":"http://ibnlive.in.com/news/monsoon-rains-may-hit-kerala-coast-around-may-30-weather-office/545614-62-126.html","description":"India received deficient rains during the four-month long monsoon season last year, which reduced grains output in the world's second-most populous country.","date":"Thu May 14 07:24:38 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/kerala_coast_monsoon.jpg\" width=\"669px\" title=\"Monsoon rains may hit Kerala coast around May 30: Weather office\" alt=\"Monsoon rains may hit Kerala coast around May 30: Weather office\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/kerala_coast_monsoon.jpg"},"content":"New Delhi: India's monsoon rains may arrive at the southern Kerala coast around May 30, earlier than the usual June 1 onset date, the weather office said on Thursday. In 2014, the annual rains hit the Kerala coast on June 6. India received deficient rains during the four-month long monsoon season last year, which reduced grains output in the world's second-most populous country. India received deficient rains during the four-month long monsoon season last year, which reduced grains output in the world's second-most populous country. #monsoon rain #weather office #kerala coast #grain","source":"IBNLIVE","id":"a4d733dc-1b43-46cc-977c-2d614acc7453","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Tamil Nadu Bar Cautions Remarks Against Judges","link":"http://www.newindianexpress.com/states/tamil_nadu/Tamil-Nadu-Bar-Cautions-Remarks-Against-Judges/2015/05/14/article2814224.ece","description":"Cautioning that remarks against Karnataka High Court Judge C R Kumaraswamy for acquitting AIADMK supremo Jayalalithaa would amount to contempt, Bar Council of Tamil Nadu and Puducherry today said it was looking at filing a PIL to protect the honour of judges.","date":"Thu May 14 07:31:53 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"CHENNAI: Cautioning that remarks against Karnataka High Court Judge C R Kumaraswamy for acquitting AIADMK supremo Jayalalithaa would amount to contempt, Bar Council of Tamil Nadu and Puducherry today said it was looking at filing a PIL to protect the honour of judges. Bar Council Chairman D Selvam said some politicians, while referring to judgements delivered in the Jayalalithaa wealth case and the bail plea of bollywood star Salman Khan by high courts, had made comments in a manner that appeared degrading the judges concerned. \"Everybody is equal before law. Speaking against the judges in a derogatory manner is contemptuous. I am in the process of collecting materials with regard to the speeches made by different sections of people against the judiciary which are contemptuous,\" he told PTI. After collecting the material, it would be placed before the Bar Council for taking a decision on filing a PIL, he added. Referring to criticism of Justice Kumaraswamy, who on May 11 acquitted Jayalalithaa in the 19-year-old disproportionate assets case against her, on social media and other platforms, Selvam cautioned that the Bar Council would not remain silent and that it would step in to safeguard the honour of judges.","source":"NEW INDIAN EXPRESS","id":"62a6b266-04b7-4440-97b8-b70df6d5de09","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Malaria Control Software to be in operation by May-end","link":"http://www.thehindu.com/news/cities/Mangalore/malaria-control-software-to-be-in-operation-by-mayend/article7205704.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"By the end of this month, health workers will be seen with tabs enabled with the Malaria Control Software to detect the source of Malaria and act against it within the stipulated time. T...","date":"Thu May 14 06:31:52 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/PSX_20150514_12382_2405997f.jpg\" class=\"main-image\" alt=\"Naren Kodvattat of I Point, speaking at a meeting on Malaria detecting software at DC Office in Mangaluru. Photo: H.S.Manjunath.\" width=\"636\" height=\"477\" title=\"Naren Kodvattat of I Point, speaking at a meeting on Malaria detecting software at DC Office in Mangaluru. Photo: H.S.Manjunath.\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/PSX_20150514_12382_2405997f.jpg"},"content":"By the end of this month, health workers will be seen with tabs enabled with the Malaria Control Software to detect the source of Malaria and act against it within the stipulated time. The software, which has already had trial runs, will be operational by the last week of May. The then Mayor of Mangaluru, Mahabala Marla had initiated the work of preparation of the software, which was found necessary as majority of cases of Malaria in the state were from Mangaluru. This software will be used in the tabs given to the 50-odd Multi-Purpose Workers (MPW) of the Mangaluru City Corporation involved in source identification and destruction. Mangalore Medical Relief Society took up the task and the company I Point was entrusted with development of the software. In a meeting to review Malaria Control programme held at the office of the Deputy Commissioner, the Managing Director of I Point Naren Koduvattat said that the software has been enabled to spot places where mosquito carrying Malaria parasite breeds, report cases of Malaria and follow-up action. He said each of the 80-odd laboratories that have been set-up, will be reporting cases of Malaria that will be reflected on a separate website being developed for the purpose. Soon after it is reported, message goes to the concerned MPW, who has to report the source of Malaria around the victim’s house and destroy it. A set of officials will be monitoring the whole process on a daily basis. The software allows a citizen also to report cases of Malaria.","source":"THEHINDU","id":"ff198cc3-976d-42be-9c7f-7e345682983e","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"‘Ranga Sangatya’ theatre training camp in Manipal from May 17","link":"http://www.thehindu.com/news/national/karnataka/ranga-sangatya-theatre-training-camp-in-manipal-from-may-17/article7205518.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"The Rathabeedi Geleyaru, Sangama Kalavider and Karavali Kalavidaru will be organising a 12-day theatre training camp titled ‘Ranga Sangatya’ in Manipal from May 17 to 28. Addressing press...","date":"Thu May 14 05:28:11 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"The Rathabeedi Geleyaru, Sangama Kalavider and Karavali Kalavidaru will be organising a 12-day theatre training camp titled ‘Ranga Sangatya’ in Manipal from May 17 to 28. Addressing presspersons here on Thursday, M. Prasad Rao, Convener of Ranga Sangatya, said that the theatre training camp was divided into three categories – youth, women and children. During the camp, the children in the age group of 10 to 12 years will be trained in preparing for a play based on Gandhian principles. If children below 10 years of age are present, they too would be trained in acting in but another play. In the morning hours, the youth would be trained in preparing for a play focusing on the female characters in the epic ‘Mahabharata’. Many amateur theatre groups function in Udupi and its surroundings. However, the performances of some actors and actresses were not as polished as was desirable. Hence a training programme would be held for these actors and actresses to hone up their acting skills. The training programme for them would be held daily from 6.30 p.m. to 10 p.m. Normally training camps had persons of the same age group. But this camp is unique in that adults and children would be trained in the theatre here. At the end of the camp, these groups will stage a play each. Iqbal Ahmed, Director of Rangayana, Shivamogga, would inaugurate the camp. Roopa L. Bhat, Principal of Manipal Pre-University College would be the chief guest at the inaugural function, Mr. Rao said. Muralidhar Upadhya Hiriyadka, President of Rathabeedi Geleyaru, Lakshman Peramapalli, President of Sangam Kalavider, Jagadish Acharya Perampalli, President of Karavali Kalavidaru, were present.","source":"THEHINDU","id":"0b74234c-f8b5-4602-871e-77904978d8db","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"CMC chiefs ‘dethroned’ after submitting resignations","link":"http://www.thehindu.com/news/national/karnataka/cmc-chiefs-dethroned-after-submitting-resignations/article7205446.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"The ‘power tussle’ in the Mandya City Municipal Council (CMC) ended here on Thursday with president B. Siddaraju and vice-president Chandrakala Shivaram tendering resignations to their posts. ...","date":"Thu May 14 05:23:05 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/Mandya_CMC_01_2405935f.jpg\" class=\"main-image\" alt=\"Some of the councillors of Mandya City Municipal Council (CMC) with B. Siddaraju and Chandrakala Shivaram in Mandya on Thursday.\" width=\"636\" height=\"477\" title=\"Some of the councillors of Mandya City Municipal Council (CMC) with B. Siddaraju and Chandrakala Shivaram in Mandya on Thursday.\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/Mandya_CMC_01_2405935f.jpg"},"content":"The ‘power tussle’ in the Mandya City Municipal Council (CMC) ended here on Thursday with president B. Siddaraju and vice-president Chandrakala Shivaram tendering resignations to their posts. However, later a no-confidence motion was moved against them at a special meeting at the CMC where they were “dethroned” from the posts. JD(S) support Mr. Siddaraju, an Independent councillor and a Congressman, had assumed the municipal president’s post on September 17, 2013 with the support of Congress and Independent councillors. He had contested as an Independent, while Ms. Shivaram won her ward on a Congress ticket. The duo was asked to step down after being in power for 18 months, but they failed to do so. Supporters of Mr. Ambareesh had been trying to remove them for the past two months. Housing Minister M.H. Ambareesh, MP and Janata Dal (Secular) leader C.S. Puttaraju and 30 councillors voted in favour of the motion. Five councillors – including the ousted chiefs, a BJP member and two independents – were absent. Resignations Earlier in the day, accompanied by some of the councillors who have been supporting them, Mr. Siddaraju and Ms. Shivaram met the Deputy Commissioner M.N. Ajay Nagabhushan and tendered their resignations. Later, the meeting was conducted to move the motion.","source":"THEHINDU","id":"662c72c6-6267-4fdf-b8bd-d46e19b74340","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"KRRS criticises State govt on development","link":"http://www.thehindu.com/news/national/karnataka/krrs-criticises-state-govt-on-development/article7205386.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Karnataka Rajya Raitha Sangha (KRRS) criticised Chief Minister Siddaramaiah and his government for their decision to hold public meeting in Davanagere for celebrating successful completion of two...","date":"Thu May 14 04:38:51 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/CHAMARASA_MALIPATI_2405844f.jpg\" class=\"main-image\" alt=\"KRRS state president Chamarasa Malipatil addressing a media conference at Reporters' Guild in Raichur on Thursday. Photo: Santosh Sagar.\" width=\"636\" height=\"477\" title=\"KRRS state president Chamarasa Malipatil addressing a media conference at Reporters' Guild in Raichur on Thursday. Photo: Santosh Sagar.\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/CHAMARASA_MALIPATI_2405844f.jpg"},"content":"Karnataka Rajya Raitha Sangha (KRRS) criticised Chief Minister Siddaramaiah and his government for their decision to hold public meeting in Davanagere for celebrating successful completion of two years in power and proclaiming State government's achievements in the the period. Addressing a media conference here on Thursday, KRRS State President Chamarasa Malipatil, contending State government's claims on developmental and empowerment initiatives taken up in the last two years, said that there was no difference between the previous BJP government and present Congress government. \"The government did not pay compensation to farmers when their standing and harvested corps were destroyed in floods. It did not open procurement centers to purchase crops at scientific minimum support prices when the farmers were hit by price crash. It did not heed irrigation issues of North Karnataka despite consistent pressures from farming community. Corruption is rampant in almost all the department as it was during previous government,\" he said. Providing rice at Re. 1 per kg alone cannot be taken for overall development of the state, he added. Procurement center Mr. Malipatil demanded the government to open paddy procurement center in each paddy-growing taluks in the state and purchase the crops at minimum support price (MSP). \"Paddy growers, who have already suffered crop destruction in the recent pre-monsoon rains, are now hit by the price crash. The government should immediately open procurement centers and purchase the crop. It should also release compensation amount to be paid to farmers who have lost their crops in the rains,\" he said. Water scam Pointing fingers at Raichur Zilla Panchayat for its \"failure\" to address drinking water crisis in the rural areas, Mr. Malipatil alleged that crores of rupees, that were released for addressing the issue were misappropriated. \"ZP officials have paid money to contractors for various drinking water projects, including two multi-village water supply schemes and thousands of bore-wells. These projects were, however, completed only on paper and not in reality. Despite media coverage and public complaints, the government has not taken any action against the corrupt officials,\" he alleged. Lakshman Gowda Kadagamdoddi, Mallanna Dinni and other farmers' leaders were present.","source":"THEHINDU","id":"a8e7f642-f776-41a9-a8b2-c9de70eed1a1","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Ban on CM photos in govt. ads snatches state rights: Karunanidhi","link":"http://www.thehindu.com/news/national/tamil-nadu/ban-on-cm-photos-in-govt-ads-snatches-state-rights-karunanidhi/article7205340.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"\"According to the Constitution of India, in a federal set-up, Prime Ministers and Chief Ministers have equal status,\" he said.","date":"Thu May 14 04:23:52 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/KARUNANIDHI_jpg_2405822f.jpg\" class=\"main-image\" alt=\"DMk chief M. Karunanidhi\" width=\"636\" height=\"477\" title=\"DMk chief M. Karunanidhi\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/KARUNANIDHI_jpg_2405822f.jpg"},"content":"DMK chief M. Karunanidhi on Thursday said the Supreme Court verdict on banning photos of Chief Ministers in government advertisements amounts “to snatching away the rights of states” as the constitution gives “equal status” to Prime Ministers and Chief Ministers. “The Supreme Court judgement that government advertisements should carry photos of President, Prime Minister and Chief Justice of India and not state Chief Ministers amounts to snatching away the rights of states. According to the Constitution of India, in a federal set-up, Prime Ministers and Chief Ministers have equal status,” he said. Mr. Karunanidhi said people in the respective states always gave importance to Chief Ministers. “Both Prime Minister and a Chief Minister were selected by the majority party, that is, one that had won elections, even as the President had the support of a political party,” he said. Therefore, all the basic reasons that justified carrying photos of President and Prime Ministers applied for state Chief Ministers also, he said in a statement. The former five-time Chief Minister said that with lesser educated people in the country, an advertisement with a picture would convey the message easier than many words. “It has been long accepted by people in Indian democracy that while the Prime Minister was ‘symbolic’ of the Central government, the Chief Minister was the equivalent of the state. Therefore, it is my opinion carrying photos of Chief Ministers in government advertisements is unavoidable,” he said. Decrying “personality cult” as an anti-thesis of democracy, the Supreme Court had on Wednesday barred publication of photos of leaders in government advertisements except those of the President, Prime Minister and the Chief Justice of India.","source":"THEHINDU","id":"e5a3fd0e-3ce6-47bb-8d05-47b80ec193ba","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"DMK suspends two key party functionaries","link":"http://www.thehindu.com/news/national/tamil-nadu/dmk-suspends-karuppasamy-pandian-and-anitha-radhakrishnan/article7205299.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"The two had \"violated party discipline and brought disrepute\" to it, Mr. Anbazhagan said in a statement.","date":"Thu May 14 04:03:25 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/DMK_jpg_2405815f.jpg\" class=\"main-image\" alt=\"V. Karuppasamy Pandian (left), and Anitha R. Radhakrishnan (right).\" width=\"636\" height=\"477\" title=\"V. Karuppasamy Pandian (left), and Anitha R. Radhakrishnan (right).\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/DMK_jpg_2405815f.jpg"},"content":"The DMK on Thursday suspended two key party functionaries, both of whom had joined the party at different points of time after being expelled from the AIADMK. Party General Secretary K. Anbazhagan announced the suspension of V. Karuppasamy Pandian, a powerful leader in the party’s Tirunelveli West district set-up, and Tiruchendur MLA Anitha R. Radhakrishnan. The two had “violated party discipline and brought disrepute” to it, Mr. Anbazhagan said in a statement, adding, they were being suspended from all party posts, including primary membership. Mr. Pandian had joined DMK after being expelled in 2000 by AIADMK supremo Jayalalithaa while Mr. Radhakrishnan, also thrown out of the party, joined in 2009. Mr. Radhakrishnan is representing Tiruchendur for a successive term.","source":"THEHINDU","id":"1192b777-5a9c-4a9a-bb02-33aae5ec5c8d","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"GP elections: DC orders depositing of licensed arms","link":"http://www.thehindu.com/news/national/karnataka/gp-elections-dc-orders-depositing-of-licensed-arms/article7205278.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"For the upcoming Gram Panchayat elections in the State, Deputy Commissioner and District Magistrate N. Jayaram has ordered that all categories of licensed arms in the district be deposited in the...","date":"Thu May 14 03:44:00 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"For the upcoming Gram Panchayat elections in the State, Deputy Commissioner and District Magistrate N. Jayaram has ordered that all categories of licensed arms in the district be deposited in the concerned jurisdictional police station immediately. The jurisdictions which are exceptions to this notice are: Belagavi City Corporation; City Municipal Councils of Nipani and Gokak; Town Municipal Councils of Athani, Bailhongal, Chikkodi, Ramdurg, Mudalgi, Sankeshwar and Savadatti. Failing to deposit the arms would amount to violation of the order and invite prosecution under Section 188 of IPC, he said. However, official sources in the district administration said here on Thursday that all the nationalised banks and financial institutions transporting large amount of cash, security agencies providing security services to various organisations and institutions in the district and private gunmen hired by individuals have been exempted from this notice. Even the carrying of licensed arms from the announcement of election till the declaration of the results has been banned under Section 144 of CrPC, 1973. Issue of license for arms have also been prohibited during the election period.","source":"THEHINDU","id":"46c257f9-8bbb-4132-81bc-02853f3b9ab2","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Indians likely to turn diabetic faster","link":"http://www.thehindu.com/news/national/tamil-nadu/india-is-witnessing-alarming-rate-of-diabetes-conversion/article7204468.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Results of recent study indicate that India is witnessing alarming rate of conversion, especially of those with normal glucose level moving to pre-diabetes and diabetes in ten years","date":"Thu May 14 03:28:50 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"For a country that is competing with China to be the diabetes capital of the world, here’s more sobering news. The results of a recent study published in Diabetes Care indicate that Asian Indians have one of the highest incidence rates for diabetes, with the movement from normal and pre-diabetes stages to diabetes being rapid. The results of the study, published in the peer-reviewed journal, indicate among the highest conversion rates from normal glucose levels and pre-diabetes into diabetes. The tests were done on over 1,300 individuals, their levels recorded initially and then, followed up after 10 years. “There are a number of studies measuring the prevalence (a statistical concept referring to the number of cases of a disease that are present in a particular population at a given time) of diabetes, but this is the first time we are measuring incidence – the number of new cases per population at risk in a given time period,” claims V.Mohan, co-author and founder, Madras Diabetes Research Foundation (MDRF). Diabetes is acknowledged as the most common metabolic disorder. According to the International Diabetes Federation, India has an estimated 40.9 million individuals with diabetes, and this number is set to increase to 69.9 million by 2025. “What we find with this study is the alarming rate of conversion, not only of pre-diabetes to diabetes, but also people with normal glucose levels moving to pre-diabetes and diabetes in ten years,” says R.M. Anjana, author of the paper and vice president, MDRF “The incidence rate of diabetes among individuals with pre-diabetes in our cohort was 78.9 per 1,000 person years, which is one of the highest reported in a large ethnic group and is comparable to the rates reported in small, isolated populations such as the Pima Indians (87.3 per 1,000 person years),” explains Dr. Mohan. While part of this can be explained by the high prevalence of family history of diabetes in our population, it is also an indicator of rapid epidemiological transition, he adds. Advancing age, family history of diabetes, low HDL cholesterol (‘good’ cholesterol) and physical inactivity predict progression from normal glucose levels to abnormal levels. The results also indicated that while development of pre-diabetes is linked to environmental factors, such as a sedentary lifestyle, subsequent development is perhaps governed by a combination of genetic and environmental factors. “Therefore, we think it is reasonable to suggest that in this population, efforts to prevent diabetes should be initiated prior to the pre-diabetes stage itself,” Dr. Anjana said. The New American Diabetes Association guidelines even say that if a person has both impaired tolerance at fasting and the glucose test (IFT and IGT) fasting and glucose tolerance then it is even a case for considering putting the patient on metformin (a drug for type 2 diabetes), says Dr. Mohan. “But lifestyle is the key, unless changes are made to improve physical activity, and eat healthily, we will not be able to prevent the march of diabetes in our population.” ","source":"THEHINDU","id":"ed4ef925-dc2d-485a-8d94-f5bf9ec32633","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Mysuru rape case: State govt transfers case to CID","link":"http://www.thehindu.com/news/national/karnataka/mysuru-rape-case-state-govt-transfers-case-to-cid/article7205133.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"The State government on Wednesday issued an order transferring the investigation of the rape and dowry harassment charges leveled by the daughter of a Retired IAS Officer against her in-laws to th...","date":"Thu May 14 02:51:00 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"The State government on Wednesday issued an order transferring the investigation of the rape and dowry harassment charges leveled by the daughter of a Retired IAS Officer against her in-laws to the Criminal Investigation Department (CID). Revealing this to press persons in Mysuru on Thursday, City Police Commissioner B. Dayananda said that the Mysore police will hand-over the probe to the CID as per the governments orders. The previous Mysuru City Police Commissioner, M.A. Saleem had recommended a CID probe in to the high profile case and the government has accepted his recommendation, said Mr. Dayananda. While the complainant’s mother-in-law and father-in-law had been granted anticipatory bail by the Mysuru Court, the main accused has moved the Karnataka High Court for anticipatory bail after the city court in Mysuru rejected his plea. The complainant lodged a complaint with the police accusing her brother-in-law of raping her while she was eight months pregnant. She has also accused her mother-in-law and father-in-law of harassing her for dowry. The daughter of the retired IAS officer had filed a complaint against her in-laws in Indiranagar police station in Bengaluru. The case was subsequently transferred to Mysuru where a fresh FIR was registered in V.V. Puram police station.","source":"THEHINDU","id":"ff364268-5b6b-48e8-92fe-e1c7ad8e49c0","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"ICET on Saturday across A.P.","link":"http://www.thehindu.com/news/national/andhra-pradesh/icet-on-saturday-across-ap/article7205073.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"The Integrated Common Entrance Test (ICET) 2015, for admission into MCA and MBA programmes, will be held at 136 test centers in 16 Regional Centers of Andhra Pradesh on May 16. A total of...","date":"Thu May 14 02:21:29 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/GSN_RAJU_2405707f.jpg\" class=\"main-image\" alt=\"Andhra University Vice-Chancellor G.S.N. Raju announced the schedule for the ICET-2015 in Visakhapatnam on Thursday. Photo: C.V. Subrahmanyam\" width=\"636\" height=\"463\" title=\"Andhra University Vice-Chancellor G.S.N. Raju announced the schedule for the ICET-2015 in Visakhapatnam on Thursday. Photo: C.V. Subrahmanyam\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/GSN_RAJU_2405707f.jpg"},"content":"The Integrated Common Entrance Test (ICET) 2015, for admission into MCA and MBA programmes, will be held at 136 test centers in 16 Regional Centers of Andhra Pradesh on May 16. A total of 78,755 candidates, including 26,582 women, have registered for the test, Vice-Chancellor of Andhra University and Chairman of ICET 2015 G.S.N. Raju informed media persons here on Thursday. The set code will be released by the HRD Minister Ganta Srinivasa Rao at the AU at 6 a.m. on Saturday. The test will be held from 10 a.m. to 12.30 p.m. Prof. Raju advised the students to reach their respective examination centers by 9 a.m. They will be allowed inside the examination halls at 9.30 a.m. No candidate will be allowed after 10 a.m. and all candidates have to remain inside the examination centers till the test is completed at 12.30 p.m. If hall tickets cannot be downloaded from the ICET website, such candidates have to contact the Chief Superintendents of their examination centers on Friday and submit two passport sized photographs and pay a fee of Rs. 50 to get a duplicate hall ticket. Only ball pen, or blue or black colour has to be used to mark answers on the OMR answer sheet. Convener of ICET 2015 Ch.V. Ramachandramurthy said In case mistakes in his or her name, father's name, category, date of birth or other information is noticed on the OMR answer sheet, corrections have to be made in the nominal rolls at the time of examination and not on the OMR answer sheet. Some candidates have not submitted photograph and as their hall tickets would be without photograph, they are required to submit two passport size photographs, attested by a gazetted officer. One photograph is for nominal roll and one for the downloaded e-Hall ticket. Candidates can contact their respective Chief Superintendents for clarifications and also contact Convenor's office (0891 2579797), or Convener (94403 89136) or Prof. S.V. Naidu (94412 93204) or Prof. K. Ramji (94406 70584) in case of emergency. Rector E.A. Narayana and Registrar V. Umamaheswara Rao were also present.","source":"THEHINDU","id":"229038f1-bf6b-46db-acb0-4aac2b98763b","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"The Hullabaloo over CCE system","link":"http://www.thehindu.com/news/national/karnataka/confusion-still-prevails-over-cce-system/article7204728.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"What was introduced to reduce anxiety and stress among children, and help express their views freely, has now disappointed many. The Continuous and Comprehensive Evaluation (CCE) system, introduce...","date":"Wed May 13 23:06:28 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/BANGalore_2405578f.jpg\" class=\"main-image\" alt=\"Students and parents gathered at Carmel School in connection with internal marks in SSLC exams on 13, May 2015. Photo: V Sreenivasa Murthy\" width=\"636\" height=\"477\" title=\"Students and parents gathered at Carmel School in connection with internal marks in SSLC exams on 13, May 2015. Photo: V Sreenivasa Murthy\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/BANGalore_2405578f.jpg"},"content":"What was introduced to reduce anxiety and stress among children, and help express their views freely, has now disappointed many. The Continuous and Comprehensive Evaluation (CCE) system, introduced for the first time for class 10 students, is mired in controversy over lack of clarity in the system, late introduction in the academic year and inadequate teacher training. The confusion of school managements on how to implement the system is evident as they have used different criteria to evaluate students. While some schools have been lenient and awarded full marks for internal assessment, some others seem to have exercised discretion. Deputy Director, Department of Public Instruction of Vijayapura, S.S. Biradar, said as per the guidelines, teachers have the discretionary power to give internal marks “based on their performance in extra-curricular activities”. He, however, did not rule out the possibility of teachers not being fair with any particular student and reducing internal marks. “If such a complaint is made, we can take action against the teacher,” he said, clarifying that there was no provision to revise marks if there was an error. Students, on the other hand, complained that the new system had not reduced the burden. Darshini S. said her teachers asked for “vague” assignments such as writing four pages of any lesson for internal assessment. “We wrote assignments throughout the year and studied at the end of the year. Some assignments do not help us understand any concept,” she said. Officials acknowledged that the system relied heavily on teachers, who have to reinvent the system. Commissioner for Public Instruction Mohammad Mohsin had said on Tuesday that the department was in the process of obtaining and analysing feedback from teachers and students. What is Continuous and Comprehensive Evaluation?  According to the National Curriculum Framework 2005 paper on ‘Systemic reforms for curriculum change’, CCE should not only lay down guidelines for marking pattern, but also provide space to teachers for creative teaching, provide a tool for diagnosis, and produce learners with greater skills. CCE aims to make children free of fear, trauma, and anxiety, and help them express views freely.  What’s the pattern?  Formative assessment (total of 200 marks which is later converted into 20 marks)  There will be 4 formative assessments and each will consist of 50 marks  Written test - 20 marks  Three activities - 30 marks *There is no minimum pass mark for internal assessment *Public examination will consist of 500 marks *First language is for 100 marks; remaining five papers are for 80 marks   ","source":"THEHINDU","id":"5b5ab4ee-8b84-4918-a442-eb6aaacf52dd","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Rahul Gandhi to begin his 15-km Telangana padyatra to focus on farmers' woes today","link":"http://ibnlive.in.com/news/rahul-gandhi-to-begin-his-15km-telangana-padyatra-to-focus-on-farmers-woes-today/545492-37-64.html","description":"Congress Vice President Rahul Gandhi will embark on a 15-km long padyatra in Adilabad district of Telangana on Friday, highlighting the woes of farmers over which he has taken tenaciously on the Narendra Modi government at the Centre.","date":"Wed May 13 22:06:22 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/rahul_may14.jpg\" width=\"669px\" title=\"Rahul Gandhi to begin his 15-km Telangana padyatra to focus on farmers' woes today\" alt=\"Rahul Gandhi to begin his 15-km Telangana padyatra to focus on farmers' woes today\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/05_2015/rahul_may14.jpg"},"content":"Hyderabad: Congress Vice President Rahul Gandhi will embark on a 15-km long padyatra in Adilabad district of Telangana on Friday, highlighting the woes of farmers over which he has taken tenaciously on the Narendra Modi government at the Centre. The Congress also looks at Rahul's visit to Telangana as a morale booster to party's rank and file as he is visiting the state for the first time since its bifurcation from Andhra Pradesh on June 2, 2014. Despite mounting an aggressive campaign and claiming credit for separate statehood of Telangana, Congress had in 2014 lost elections to the Telangana Rashtra Samiti (TRS) led by Chief Minister K Chandrasekhar Rao. The Congress also looks at Rahul's visit to Telangana as a morale booster to party's rank and file. #rahul gandhi #telangana #telangana padyatra #farmers The Congress leaders, however, said Rahul's visit is to primarily focus on the plight of the farmers. \"Rahul's campaign is meant to highlight the woes of the farmers in the country in general and that of the state in particular,\" said Telangana Pradesh Congress Committee (TPCC) working president Mallu Bhatti Vikramarka. On his arrival in the afternoon, Rahul will briefly interact with student leaders of Osmania University here, who have been agitating on employment issues. Rahul would then proceed to Nirmal by road and may stop at a few points enroute. Next day he will proceed on 'padayatra' from Vadiyala village at 7 AM, the TPCC leader said. \"He will meet and console the families of farmers who have allegedly committed suicide due to agrarian distress in Telangana and console them,\" he added. Also, Rahul will address farmers at Koratikal village at around 4 PM and return to Hyderabad after the event before leaving for Delhi by 8 PM. Rahul has aggressively raised farmers' issues in Parliament and also reached out to farmers in Punjab and the Vidarbha region of Maharashtra. As many as 936 farmers have committed suicide in the state during recent times, the TPCC chief said. Telangana opposition parties Congress, TDP, BJP and others too have alleged that a large number of farmers have committed suicide due to agrarian crisis since the TRS government came to power in 2014, a charge denied by the administration.","source":"IBNLIVE","id":"b20fded6-bf7a-4cb2-bd79-f2473952aadc","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Alarming presence of faecal coliform in Pampa","link":"http://www.thehindu.com/news/national/andhra-pradesh/alarming-presence-of-faecal-coliform-in-pampa/article7203412.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"River records all-time high level of pollution during last Makaravilakku festival","date":"Wed May 13 19:31:34 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/13ptkrk05-ecoli_14_2405494f.jpg\" class=\"main-image\" alt=\"The Kakkathode stream carrying filth into Pampa river from Sabarimala.\" width=\"636\" height=\"573\" title=\"The Kakkathode stream carrying filth into Pampa river from Sabarimala.\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/13ptkrk05-ecoli_14_2405494f.jpg"},"content":"The Pampa, which the Hindus consider as the holy Dakshin Ganga, recorded an all-time high level of pollution during the last Makaravilakku festival, thanks to the laxity of the authorities concerned in addressing the menace that has been plaguing the river for the last three decades. The daily water quality analysis by the Kerala State Pollution Control Board (PCB) during the festival days revealed certain scary facts. A PCB report submitted to the government two months ago showed that total coliform bacteria count and the faecal coliform count had reached 22,00,000 (22 lakh) most probable number (MPN) and 13,00,000 (13 lakh) MPN for every 100 ml respectively in the Njunangar, a tributary of the Pampa that originates from Sabarimala, on January 13. This is against the permissible limit of 500 MPN for every 100 ml for collective bathing. The samples taken from the intake point of the Kerala Water Authority’s drinking water supply station at Pampa also showed alarming presence of coliform. The PCB report says that the collection tank of free toilets near the Valiya Nadappanthal at the Sannidhanam was found overflowing. The entire filth thus reached the Pampa through the Kakkathode stream, leading it to the vicinity of the KWA intake well. The treated effluent at the sewage treatment plant at Pampa showed BOD exceeding the permissible limit. The packing inside the parallel plate separator of the sewage plant too was found collapsed due to overloading during the Makaravilakku festival. The State machinery and the Travancore Devaswom Board are yet to consider the PCB report and take steps to address the issue before the next pilgrim season beginning in November.","source":"THEHINDU","id":"4df5aaeb-0fd9-4a01-a0a9-43a93cd26725","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Breathing easy during agitation time","link":"http://www.thehindu.com/news/national/karnataka/breathing-easy-during-agitation-time/article7203592.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Additional services plied by TN, Karnataka came to the rescue of Tirupati commuters","date":"Wed May 13 19:24:25 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/13TPARRHI-W054-_VJ_2405465f.jpg\" class=\"main-image\" alt=\"KSRTC and TN State Express Transport Corporation buses parked at Alipiri bus-stand in Tirupati on Wednesday.— Photo: K.V. Poornachandra Kumar\" width=\"634\" height=\"333\" title=\"KSRTC and TN State Express Transport Corporation buses parked at Alipiri bus-stand in Tirupati on Wednesday.— Photo: K.V. Poornachandra Kumar\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/13TPARRHI-W054-_VJ_2405465f.jpg"},"content":"Even as the employees of Andhra Pradesh State Road Transport Corporation (APSRTC) called off their strike on Wednesday, bringing down curtains on the week-long ordeal of the passengers, Chittoor district has remained largely insulated owing to a various reasons. Chittoor shares border with both Karnataka and Tamil Nadu, unlike any other district in the State. Even as the strike had brought the services to a third across the State forcing commuters to depend only on private carriages and auto-rickshaws, the impact was hardly felt in the Chennai and Bengaluru highway routes. Thanks to the State-run transport corporations of the neighbouring States, which reportedly chipped in with additional services, passengers were not inconvenienced. The number of services run by a State corporation to its neighbouring State is usually the same as those plied by the other side.","source":"THEHINDU","id":"ab9697c5-2b73-4a0c-8a24-0d3541e632ab","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"'Options Aplenty in Other Disciplines Too'","link":"http://www.newindianexpress.com/states/tamil_nadu/Options-Aplenty-in-Other-Disciplines-Too/2015/05/14/article2813515.ece","description":"'Options Aplenty in Other Disciplines Too'","date":"Wed May 13 19:32:50 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"COIMBATORE: Academics have advised students not to blindly go for engineering courses, but to explore possibilities in other disciplines like arts and science, agriculture courses. Anna University former Vice-Chancellor E Balagurusamy said, “Science graduates, particularly those of Physics, Chemistry, Mathematics and Bio-Chemistry have a good future. In schools, colleges and universities, there is a lot of demand for teaching faculty members in these disciplines. This apart, in research and development organizations and universities, there are vacancies for scientists to undertake various research works.” “Secondly, B.Com graduates also have a good future, as they have multiple job opportunities. They can enter the banking sector, pursue chartered accountancy, get placed in BPO companies or become an accountant,” he added. “Tuition fee concession for first generation graduates is provided only to professional courses like engineering and medicine. This should be extended to arts and science students also,” Balagurusamy opined. According to Tamil Nadu Agricultural University Vice-Chancellor K Ramasamy, agricultural graduates have good placement opportunities both in the government and private sectors. “There are several international companies coming into the agricultural sector for processing, exporting and producing organic products. Many corporate companies are purchasing large tracts of land in India as well as in African countries. In the future, they will be involving in corporate agriculture and they will be opting professionals to manage their business,” he added. “To ensure food security, we have to produce more with lesser land and lesser water in future, which would require more technology. Apart from this, agricultural graduates will also have teaching opportunities. Agricultural students should also learn about protective agriculture, export-oriented agriculture, logistics and networking. If they acquire additional skills, they could get placed in multi-national companies,” he stressed. Girl students who complete agricultural courses can go for the banking sector, processing and marketing industry or government services, Ramasamy opined.","source":"NEW INDIAN EXPRESS","id":"7764c002-baad-4a40-9413-c35cd4c68f0f","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Case against Realtor for Cheating Land Buyer of Rs 96 Lakh","link":"http://www.newindianexpress.com/states/tamil_nadu/Case-against-Realtor-for-Cheating-Land-Buyer-of-Rs-96-Lakh/2015/05/14/article2813516.ece","description":"Case against Realtor for Cheating Land Buyer of Rs 96 Lakh","date":"Wed May 13 19:32:50 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"COIMBATORE: A 76-year-old realtor was booked for cheating another to the tune of `96 lakh on Tuesday. The accused, R Balakrishnan of NGGO Colony, had allegedly sold around 4,040 sq.ft of land to the complainant, M Kumar from Cuddalore district in 2011. The property cost Kumar ` 1.1 crore. Under the terms of the agreement, Kumar paid `51 lakh while the remaining amount was to be settled a year after. Kumar paid `45 lakh in instalments over the next few months. However, Balakrishnan refused to accept the outstanding amount of `15 lakh and refused to sell the land. He also refused to refund the money Kumar had paid him. Based on a direction by the Madras High Court, the District Crime Branch police registered a case. Man Held for theft  A 55-year-old man was arrested for stealing a mobile phone from a Kerala native at Coimbatore Railway Junction on Wednesday. The victim, Srijuth Nayana (50), from Calicut had plugged his mobile phone into a power socket at the railway station. Taking advantage of a minor distraction, the accused, Ravi Shankar from Thudiyalur, stole the phone and escaped. Railway Police, who were notified of the theft, combed CCTV footage and managed to arrest the accused within an hour of the theft.","source":"NEW INDIAN EXPRESS","id":"8a3c8ce3-3f11-45df-a3ed-97a0fa8131d7","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"15 Months On, No Sign of Pedestrian Streets in City","link":"http://www.newindianexpress.com/states/tamil_nadu/15-Months-On-No-Sign-of-Pedestrian-Streets-in-City/2015/05/14/article2813501.ece","description":"15 Months On, No Sign of Pedestrian Streets in City","date":"Wed May 13 19:32:50 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"COIMBATORE:  In January 2014, the Corporation Council decided to allow only pedestrians on some busy streets in the city. Although over 15 months have passed, the condition of the roads remain the same and pedestrians still face the same hardship while using them. It was proposed to allot Big Bazaar Street, NH Road, VH Road, Oppanakara Street and Raja Street as well as a road near VOC Park and another adjoining VOC Grounds exclusively for pedestrians, sources said. The Corporation invited expression of interest from contractors to design the streets. “It is not just this proposal, but a number of projects have remained only on paper for years. In this case, the Corporation can concentrate on making the change at least on Oppanakara Street or Raja Street on a trial basis. These places are busy round the clock,” said R Raveendran, secretary, Residents Awareness Association of Coimbatore. “Initially, parking of vehicles, including two wheelers, on such streets should be stopped. Civic officials, with police help, should implement it strictly. Pedestrians will then be able to walk freely. Traders should cooperate in the effort,” he added. Now, several places in the city have become nightmares for pedestrians. They cannot walk freely in these places. Shopkeepers have encroached on free spaces and there are high chances of pedestrians meeting with accidents. Experts say the civic body should first ensure safety of pedestrians and only then give priority to vehicles, which occupy large spaces on roads and pollute the environment.","source":"NEW INDIAN EXPRESS","id":"0e8600be-245d-41ca-9acd-ec8245368e44","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"'Socio-political Atmosphere behind Evolution of Maoists'","link":"http://www.newindianexpress.com/states/kerala/Socio-political-Atmosphere-behind-Evolution-of-Maoists/2015/05/14/article2813112.ece","description":"According to Kanam, annihilation theory of the Maoists have no place in a democracy. There has to be social change to bring about a perennial solution to the problem","date":"Wed May 13 19:32:22 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"THIRUVANANTHAPURAM: CPI state secretary Kanam Rajendran on Wednesday said that what he had stated about Maoists in Kerala was not the official stance of the LDF.  Addressing a meet-the-press programme on the topic ‘Keralam Engottu’, organised at the  Press Club here, he said it was the socio -political atmosphere prevailing in the state which was behind the evolution of Maoists. He  said, however, the annihilation theory of the Maoists had no place in a democracy. At the same time, killing of Maoists is not a  solution to end their atrocities. There has to be social change to bring about a perennial  solution to the problem, he said.  Kanam Rajendran pointed out that while land reforms introduced by the Communist government in the state heralded a social change, there had been strong opposition to land reforms in north India.  The CPI leader said the unification of  different socialist groups under the Janata  Parivar was an important development and it would result in major political polarisation.  It was not the Congress party but the Janata Parivar and the Left-democratic forces which would be offering a better alternative to the BJP Government at the Centre in future. He said the CPI was the first to state that the Janata Dal should not have been allowed to quit the LDF. It is only now the other LDF constituents realised their folly and agreed to the CPI’s view, Kanam said.  He said if anyone is asked to comment on the performance of the UDF Government one would be prompted to ask whether there was a government at all. ‘’Compared to the corruption of these days the scandals like Bofors were only ‘BPL corruption’,’’ the CPI state secretary said.  He said the best example of the government’s ineffectiveness was the controversy over   SSLC results. ‘’The Education Minister says that it was the result of software  malfunctioning. One would be tempted to ask whether it was the software of the minister or the Education Department which conked off’’ Kanam said.  Speaking on the approach to development, the CPI state secretary aid  instead of opening medical colleges in each district what is more important is to provide healthcare facilities at the primary and secondary-levels. ‘’I am not against Oommen Chandy opening two medical colleges each in all the districts. But it has to be ensured that the people get minimum treatment facilities at the PH centres,’’ he said.  Kanam said that when someone criticises the development perspective of the government, they were being depicted as anti-development.  ‘’Nobody is against development. But problem is with the perspective about development’’ he clarified. It was high time to think whether express ways, flyovers and shopping malls were the indices of development,’’ he said.","source":"NEW INDIAN EXPRESS","id":"de378149-a682-444e-8d5c-7efe780955a1","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Thrust is on Party Unity, Says Kodiyeri","link":"http://www.newindianexpress.com/states/kerala/Thrust-is-on-Party-Unity-Says-Kodiyeri/2015/05/14/article2813116.ece","description":"Thrust is on Party Unity, Says Kodiyeri","date":"Wed May 13 19:32:22 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"    T’Puram: CPM state secretary Kodiyeri Balakrishnan on Wednesday said that his focus was on taking the party forward unitedly to face the challenges lying ahead. Replying to discussions in the two-day state committee meeting, he said what he did not mean was that action would be initiated against those state committee members who had voted against the panel of new secretariat members. Kodiyeri also clarified that he did not consider that the eight members had acted with the intention of reviving factional feuds in the party. Former VS loyalists K Chandran Pillai, S Sarma, Mercykutty Amma, C S Sujatha, C K Sadasivan, Pirappancode Murali and M Chandran had voted against the official panel of Secretariat members when election was held on April 25. They wanted Sarma, Chandran Pillai and Mercykutty Amma to be inducted into the new secretariat. When the state committee meeting began on Wednesday, the Kannur lobby unleashed an all-round attack on them. Kodiyeri had pointed out that the contest triggered an unnecessary controversy and had warned of strong action against any effort to revive factional activities.  According to him, eight state committee members from the VS faction could not have  united to vote against the official panel if it was not factional feud.  The state committee also decided to prepare the party to face local body elections. As part of the preparations, the party would take up local issues. It would also galvanise the workers to take up pre-monsoon cleaning drive scheduled for May 24.","source":"NEW INDIAN EXPRESS","id":"82538f73-7a75-4f0f-9f90-9e25e61638b9","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Kanthalloor Farmers See a Dusty Future","link":"http://www.newindianexpress.com/states/kerala/Kanthalloor-Farmers-See-a-Dusty-Future/2015/05/14/article2813124.ece","description":"Kanthalloor Farmers See a Dusty Future","date":"Wed May 13 19:32:22 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"IDUKKI: Farmers in Kanthaloor and nearby areas in Devikulam taluk are said to be losing over `3 crore annually owing mainly to crop loss each year. Poor awareness on insurance coverage has also helped deepen their damage, reports said. Agriculture Minister K P Mohanan alleged that in spite of the government giving insurance protection, the farmers have not approached the concerned to avail it. The farmers have now started realising the importance of insurance protection as the demand for their crops has started dwindling in Tamil Nadu, Minister said. The government is very much alive on the situation, and the Agriculture Department has been asked to educate the farmers on the various possibilities of insurance coverage, he said, adding that the department would soon hold camps soon.  Government cannot take things too lightly, said P T Mohandas, president of Kanthaloor Sheethakala Pachakari Vipanana Karshaka Sangham. No effort has so far been taken by the officials. They haven’t taken any steps to inform the farmers that insurance would come in handy when they face grave situations like crop loss or natural calamities, said Mohandas. If they had the idea they would certainly have gone for it, he said. “With the demand from Tamil Nadu falling sharply, the farmers themselves, with no option left, destroyed beans grown in over 150 acres of land. That too a bumper crop,” said Mohandas. The farmers were selling beans to Tamil Nadu traders at a price of `28-30 a kg. Prices nosedived this year to below `12. Still there were no buyers. They could not market their products in the state too as the Kanthaloor variety are not familiar with Kerala consumers. As a result, more than 300 farmers destroyed their produce either by burying them or putting them to fire, said Mohandas. Kanthaloor region is ideal for growing cool season vegetables. It is situated 5,000 feet above sea level. If the government is not acting quick on the issue, the farmers will move to other areas in search of greener pastures, and the result would be not be anything short of a catastrophe, warned Mohandas.","source":"NEW INDIAN EXPRESS","id":"cfa77bff-c72a-4a43-a009-6c5487683bb4","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Spare multi-cropped lands: Yogendra Yadav","link":"http://www.thehindu.com/news/national/andhra-pradesh/spare-multicropped-lands-yogendra-yadav/article7203451.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"After the visits of social activists like Medha Patkar and Swami Agnivesh, land owners of river front villages who have so far resisted moves to pool their lands got support from Yogendra Yadav, le...","date":"Wed May 13 19:32:21 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"After the visits of social activists like Medha Patkar and Swami Agnivesh, land owners of river front villages who have so far resisted moves to pool their lands got support from Yogendra Yadav, leader of Swaraj Abhiyan, who undertook a visit to the region on Wednesday. A delegation of social activists led by Mr. Yadav and comprising Adil Mohammad and activists from Telangana and Kerala visited the river front villages starting from Tadepalli, Penumala, Undavalli, Uddandarayepalem and Rayapudi. Speaking to reporters, Mr. Yadav appealed to the government to leave out multi-cropped irrigated land from the proposed acquisition or else arrive at a mutually consented agreement with land owners after genuinely addressing their concerns. “This is a democratically elected government, and it cannot go against the wishes of people. We appeal to the government to leave out fertile lands. Anyhow, they do not need these lands for the capital,” Mr. Yadav said. He also warned against moves to coerce land owners into falling in line by threatening to go for land acquisition. “The threat of land acquisition cannot be used to force farmers into giving away their lands. Land is the only asset with the farmer,” he said. Replying to a question on the support he would give to farmers, Mr. Yadav said struggle was the only option left for farmers and added that all civic organisations, including the National Alliance for People Movement, would back the struggle of farmers. Rayapudi Primary Agricultural Cooperative Society president Mallella Harindranath Chowdary was also present.  This is a democratically elected government, and it cannot go against the wishes of people. We appeal to the government to leave out fertile lands. Yogendra Yadav, Swaraj Abhiyan leader","source":"THEHINDU","id":"b35b08e4-cc39-4a10-a12b-bc6902451c32","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Roja seeks action against municipal chief","link":"http://www.thehindu.com/news/national/andhra-pradesh/roja-seeks-action-against-municipal-chief/article7203390.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"YSRC State women’s wing president and Nagari MLA R.K. Roja on Wednesday directed District Collector Siddarth Jain to initiate action against Nagari Municipal Commissioner Balaji Yadav his alleged b...","date":"Wed May 13 19:32:20 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"YSRC State women’s wing president and Nagari MLA R.K. Roja on Wednesday directed District Collector Siddarth Jain to initiate action against Nagari Municipal Commissioner Balaji Yadav his alleged bias towards TDP leaders. Ms. Roja later told reporters that though the Nagari civic body had passed a resolution seeking a new Commissioner, there was no response from the government. She alleged that Mr. Yadav had been scuttling the progress of the civic body by playing to the whims and fancies of TDP leaders.","source":"THEHINDU","id":"d06099db-2138-406a-8db9-972796440d6c","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Woman ‘battered’ to death by paramour","link":"http://www.thehindu.com/news/national/andhra-pradesh/woman-battered-to-death-by-paramour/article7203388.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"A 38-year-old woman, Kalavati was allegedly battered to death by her paramour at Warigapalle village, 10 km away from here in the early hours of Wednesday. Another man in her company was seriously...","date":"Wed May 13 19:32:20 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"A 38-year-old woman, Kalavati was allegedly battered to death by her paramour at Warigapalle village, 10 km away from here in the early hours of Wednesday. Another man in her company was seriously injured in the attack. According to Chittoor Rural (West) Circle Inspector Adinarayana, Kalavati, who was running a tea stall, had been living with Munikrishna (40) of Kolar in Karnataka for the last few years, after her divorce. Munikrishna used to visit Kalavati frequently, the police said. He arrived at Kalavati’s tea stall at around 3.00 am on Wednesday. Finding her in the company with another man Ramanjulu, a watchman of Rural Water Works Department in Chittoor, an enraged Munikrishna attacked both of them. He crushed the woman’s head with a pestle and inflicted critical wounds on Ramanjulu. He, with serious vocal chord injuries, is undergoing treatment at Government Hospital in Chittoor. Case registered Police have registered a case and launched a search for Munikrishna. The body of the woman has been handed over to her relatives after autopsy.  Kalavati’s paramour attacked her with a pestle after finding her in the company of another man","source":"THEHINDU","id":"3eeaffd3-12df-4652-a5d8-065295f6acca","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Kannada Soon a Must in Higher Education Courses","link":"http://www.newindianexpress.com/states/karnataka/Kannada-Soon-a-Must-in-Higher-Education-Courses/2015/05/14/article2813369.ece","description":"Kannada Soon a Must in Higher Education Courses","date":"Wed May 13 19:31:42 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"BENGALURU: After making Kannada mandatory in school, the government has decided to teach the language in higher education as well. Kannada is on the way to becoming a mandatory subject in all higher education courses, including engineering, law and medicine, from the coming academic year. The decision follows a proposal submitted by the Kannada Development Authority. The Karnataka State Council for Higher Education placed it on the main agenda at a general body meeting on Wednesday. After a long discussion, it decided to usher in the change from 2015-16. A vice-chancellor and senior member of the council told Express an expert committee would finalise what level of Kannada would be taught. In undergraduate courses such as BA, BSc, BCom and BBM, Kannada will be a compulsory subject for the first four semesters. In professional courses such as MBBS, BE and LLB, the language becomes mandatory in the first two semesters. “For students from other states, we have to decide on the level of Kannada. The expert committee, with members from the Kannada Development Authority and academia, will decide about it,” said a senior official and member of the council. Once the report is submitted, the Higher Education Department will issue an official notification. Dr L Hanumanthaiah, chairman, Kannada Development Authority, told Express, “The proposal has been accepted in principle and approved by all vice-chancellors. We will soon form an expert committee to provide the guidelines to write text books.” Two levels of books will be produced: one for non-Karnataka and international students and another for Karnataka students. “The universities will prepare the text books,” he said. The universities will soon place the proposal before their syndicates and academic Councils.","source":"NEW INDIAN EXPRESS","id":"4af28a08-5920-4804-a41f-fffe95f9913c","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Govt Favoured AHINDA Communities, Admits CM","link":"http://www.newindianexpress.com/states/karnataka/Govt-Favoured-AHINDA-Communities-Admits-CM/2015/05/14/article2813389.ece","description":"Govt Favoured AHINDA Communities, Admits CM","date":"Wed May 13 19:31:42 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"BENGALURU: Admitting that his government has been giving preferential treatment to people of the AHINDA communities, Chief Minister Siddaramaiah said it was part of rendering social justice in the state. AHINDA is a Kannada acronym for minorities, backward classes and dalits. At a press meet organised by the Press Club and the Reporters Guild, Bengaluru, on the occasion of the Congress government completing two years in office on Wednesday, he said, “I have no qualms in admitting it.” Strongly defending the various programmes and schemes announced by his government such as Shaadi Bhagya for women of minority communities and the school tour programmes for children of AHINDA communities, he said they were meant for the deprived sections of the society. “Opposition parties have failed in their role and have criticised our government’s programmes with ulterior motives,” he said. The CM said he had tried to live up to the expectations of the people who had voted the party to power in 2013, but said, “We still have a long way to go in fulfilling our promises.” Siddaramaiah hit back at BJP leader Jagadish Shettar’s charge that the Congress government had not achieved anything in the last two years and said, “Let the Opposition leaders open their eyes and then comment on our government’s achievements.” Talking about his government’s feats, he said over 1.08 crore people belonging to the BPL category had been receiving rice free of cost and that 10.10 lakh APL families would also be brought under the PDS ambit shortly. “Over 21 lakh farmers were disbursed farm loans at zero per cent interest and the state government had paid a cash incentive of `250 to farmers for every tonne of sugarcane,” he said. He said bringing a legislation to earmark budgetary allocation according to the percentage of the SC/ST population was a revolutionary step and questioned why BJP leaders could not do it when they were in power. He said his government had done everything they had promised to do. “Opposition parties have been spreading false propaganda against our government, but they will not succeed,” he said. ‘Will Lead Congress in 2018 ELECTIONS’ Siddaramaiah, who had said he would retire from politics after this term, has changed his mind and said he will remain in politics for the 2018 Assembly elections. He told reporters, “BJP leaders’ nation-wide ‘Congress-mukt India’ slogan has motivated me to change my mind. I will not only complete the remaining term of three years in office, but will also lead the Congress to victory in the 2018 Assembly elections.”","source":"NEW INDIAN EXPRESS","id":"9233fecb-5e98-42be-9bbf-1b72ab96c920","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Siddu Says No Relaxation in State's VAT Rates","link":"http://www.newindianexpress.com/states/karnataka/Siddu-Says-No-Relaxation-in-States-VAT-Rates/2015/05/14/article2813396.ece","description":"Siddu Says No Relaxation in State's VAT Rates","date":"Wed May 13 19:31:42 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/13BG09.jpg/2015/05/14/article2813393.ece/alternates/w620/13BG09.jpg\" alt=\"Citizens greeting Chief Minister Siddaramaiah on the completion of two years of his government at the Press Club in Bengaluru on Wednesday | NAGARAJA GADEKAL\">","sort":"http://media.newindianexpress.com/13BG09.jpg/2015/05/14/article2813393.ece/alternates/w620/13BG09.jpg"},"content":"BENGALURU: Chief Minister Siddaramaiah has ruled out any revision of VAT, saying it will be replaced by the Goods and Services Tax (GST) from the next fiscal. Interacting with reporters here, the chief minister admitted that the 14.5 per cent VAT in Karnataka is the highest among the states. However, this discrepancy would disappear with the introduction of GST. Siddaramaiah, who also holds the finance portfolio, said VAT was between 4.5 and 12.5 per cent during 2004-05, and blamed the previous BJP government for increasing it to 5.5 and 14.5 per cent. The Congress government has been focusing more on the social sector, he said. “While doing so, we have not neglected the economy, which is very crucial for job creation and overall growth.” Claiming that in the last two years the state government has cleared investment proposals worth over Rs94,000 crore, he said, “It would generate over 2.34 lakh new jobs.” Siddaramaiah said the state government was keen on achieving self-sufficiency in power generation, and expressed confidence that Karnataka would produce enough power by 2018 to meet its requirements. He said the state has a power subsidy burden of over Rs7,000 crore, and this is expected to touch Rs7,500 crore in 2015-16. The chief minister also admitted that devolution of central funds to the state has increased following the recommendations of the 14th Finance Commission. But the net deficit from the central pool of funds was Rs1,987 crore because of the sharp cut in various centrally-sponsored schemes. “The cut in central grants is the same story in all the other states,” he said. Taking a dig at Prime Minister Narendra Modi, he quipped that there was no sign of the much-promised Achhe Din for the people of the country. Replying to questions, Siddaramaiah said he has not experienced any partisanship from the NDA government towards non-BJP ruled states as of now.","source":"NEW INDIAN EXPRESS","id":"d02ccf88-15f1-4473-87e8-683d172722c4","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Agent Cons 8 Fishermen Promising Jobs","link":"http://www.newindianexpress.com/states/andhra_pradesh/Agent-Cons-8-Fishermen-Promising-Jobs/2015/05/14/article2813434.ece","description":"Agent Cons 8 Fishermen Promising Jobs","date":"Wed May 13 19:30:59 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"SRIKAKULAM: In yet another case of fraudsters cashing in on the ignorance of people, a middleman promising jobs in a foreign country cheated some fishermen and played a vanishing trick. The incident came to light when families of victims complained to collector Lakshmi Nrusimham who asked Polaki mandal MRO J Ramarao to find out the details. The MRO met the families of the victims Wednesday and sought the details of their whereabouts. According to reports, an agent from Chennai collected `75,000 from each of the eight fishermen of Guppudupeta and Suradadavanipeta in Polaki mandal of the district promising jobs in Malaysia. The agent collected money from the victims in January, following which some fishermen boarded the flight to Malaysia in February. However, after reaching Malaysia, the agent disappeared, leaving the fishermen in the lurch. Earlier too some fishermen from Sompeta, Kaviti and Vajrapukottur mandals were conned by middlemen promising jobs in foreign countries. Meanwhile, the MRO, in his inquiry found that the middleman was from Chennai and took the issue to the notice of Chennai tahsildar, when he found that the agent is on the run. The MRO promised the victim’s families of taking immediate measures to trace the agent.","source":"NEW INDIAN EXPRESS","id":"58a623b2-b0dc-4433-b9ee-a7f1ea6d63fb","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Cops Vow to Make Traffic Seamless","link":"http://www.newindianexpress.com/states/andhra_pradesh/Cops-Vow-to-Make-Traffic-Seamless/2015/05/14/article2813449.ece","description":"Cops Vow to Make Traffic Seamless","date":"Wed May 13 19:30:59 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/Traffic.PNG/2015/05/14/article2813447.ece/alternates/w620/Traffic.PNG\" alt=\"Cement barricades parting traffic at the busy Maddilapalem Junction to ensure free flow of vehicles, in Visakhapatnam on Wednesday | Express Photo\">","sort":"http://media.newindianexpress.com/Traffic.PNG/2015/05/14/article2813447.ece/alternates/w620/Traffic.PNG"},"content":"VISAKHAPATNAM: Picture this: You cruising along on your bike or car, without other commuters threatening to collide with you or abruptly pull up in front of you. If the police were to succeed in their aim to  make traffic seamless, the above dream is well set to become a reality. As a part of the efforts initiated by the Traffic Police to ease traffic congestion in the city, the Police Commissionerate has decided to take up re-engineering works on major roads. Henceforth, motorists will have to take a U-turn only at the major junctions, as the medians between the dividers will be closed and small three/four junctions will be blocked. Though many road-users are not going to like the reforms, the police insist that the measures will have a positive impact in the long run by helping make traffic seamless. To begin with, on an experimental basis, the police have restricted the entry of vehicles coming from Andhra University grounds at the Maddilapalem Junction. The vehicles have to take U-turn at the Swarna Bharathi Stadium junction to join the National Highway. The new move reportedly reduced traffic congestions effectively, unlike earlier times when the vehicles from Andhra University and Pithapuram Colony area used to directly join the traffic coming from RTC Complex, leading to much commotion. In the ensuing days, the police would also block the four-road junction at the Swarna Bharathi Stadium and vehicles from Andhra University Engineering grounds will have to take a U-turn at the Spencers/Mosque junction to go Maddilapalem. “In order to have seamless traffic, we have started re-engineering works. Vehicles joining the main traffic from medians or small junctions are leading to traffic snarls. That’s why we’re taking up this new method. With the new rules, motorists will have to apply brakes only at the signals,” said additional commissioner of police (ADCP Traffic) K Mahendra Patrudu. There are several other junctions which have been blocked and made single lanes for smooth flow of traffic, which is seen at Jagadamba Junction where the traffic cops arranged cement barricades at the signals and made it one-way. The Asilmetta Junction is another area where cement barricades have been put up till the end of the Sampath Vinayaka temple. Vehicles will have to take U-turn at the end of the junction near the flyover. While insisting that the new steps are only to improve traffic, the police admitted that there was resistance from the public. “Though the people have complained, especially over the changes at Asilmetta and Maddilapalem junctions, the end result is good. A few minutes’ drive to take a turn and join mainstream traffic doesn’t matter. Naturally it will appear difficult in the beginning, but this system will effectively spell the end of traffic congestions in the city,” Mahendra Patrudu added. Apart from the areas that have seen changes, the police have identified some more major junctions where the procedure would be implemented. Vizagites Not Happy with Changes Though the traffic police reiterate that the new arrangements will help in streamlining traffic, road users have expressed displeasure over being forced to go long distances in order to take a turn. However, ADCP (Traffic) Mahendra Patrudu insisted that traffic flow is vital to avoid congestion, especially now that the traffic levels are going up. Straight ahead  Motorists can now take U-turns only at major junctions.  New system implemented at Maddilaplem, Jagadamba and Asilmetta junctions.  Medians between the dividers and small three/four-road junctions will be blocked.  Cops shift focus on other major junctions.","source":"NEW INDIAN EXPRESS","id":"3df31b13-4150-49bc-b27d-49ec7941d6c2","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Now, ATVMs for Easy Train Ticket Purchase","link":"http://www.newindianexpress.com/states/andhra_pradesh/Now-ATVMs-for-Easy-Train-Ticket-Purchase/2015/05/14/article2813457.ece","description":"Now, ATVMs for Easy Train Ticket Purchase","date":"Wed May 13 19:30:59 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"VIJAYAWADA: For the first time, Automatic Ticket Vending Machines (ATVMs) were introduced at the Vijayawada Railway Station, sparing the commuters from going through the ordeal spending hours in long queue lines at the ticket counters. On Wednesday, eight such ATVMs were set up in Vijayawada while three each were installed at Rajahmundry, Tenali and Nellore railway stations. Vijayawada DRM Ashok Kumar inaugurated them. At Vijayawada station, four ATVMs have been kept at the main concourse of the main booking office, two each at the east entrance concourse and south entrance concourse. The ATVMs will enable the people to purchase unreserved tickets and platform tickets on their own or with the help of the facilitator. All one needs to do to avail the service is purchase a smart card costing Rs50 from the railway general ticket counter and top-up with amount anywhere between Rs100 to Rs5,000. The card will be valid for one one year. Moreover, for every recharge/topping up, the passenger will get a discount of Rs5 per cent on the fare up to 150 km. For operating the ATVMs, the smart card has to be kept on the card reader provided on the machine and a map will be displayed. The station has to be selected by tapping on the touch screen. Those who find it difficult to locate and select, can simply type the destination time in the space provided. Once the station is selected, the class, age and the number of passengers have to be specified. After all the data is entered, a ticket will be printed. Ashok Kumar said it will greatly reduce waiting time and be very useful during rush hour.","source":"NEW INDIAN EXPRESS","id":"9b2cb8b2-c33e-4e72-9cf1-038f397613dc","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Hanuman Jayanthi celebrated with zeal","link":"http://www.thehindu.com/news/national/andhra-pradesh/hanuman-jayanthi-celebrated-with-zeal/article7203447.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Religious ecstasy marked Hanuman Jayanti celebrations at the famous hill temple of Lord Venkagteswara on Wednesday.Special poojas were performed at the ancient Bedi Anjaneya Swamy temple loc...","date":"Wed May 13 19:22:52 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"Religious ecstasy marked Hanuman Jayanti celebrations at the famous hill temple of Lord Venkagteswara on Wednesday. Special poojas were performed at the ancient Bedi Anjaneya Swamy temple located in front of the main temple complex as well as at the temple situated on the north-eastern bank of the temple tank. Special arrangements were made for transportation of pilgrims to the seventh mile on Ghat Road where offerings were made to the 60-feet tall Hanuman idol. The TTD also organised Annadanam, and free buttermilk sachets were distributed to devotees. TTD Chairman C. Krishna Murthy presented silk Vastrams to the Jabali Hanuman temple. Staff Reporter writes from Ongole: Hanumath Jayanti was celebrated across Prakasam district on Wednesday. All roads led to Singarakonda, the abode of Lord Prasanna Anjaneyaswamy, where special prayers were held. The 99-foot idol of Hanuman erected beside the Hyderabad highway near Addanki attracted devotees in large numbers. Right from dawn, there was a heavy rush of devotees in all the Hanuman temples in the city including the Veeranjaneya Swamy temple at Santhapet and Panchamukha Anjaneya Swamy at Mangamur Donka. ‘Hanuman Chalisa’ was recited on the occasion. Staff Reporter writes from Vizianagaram: devotees thronged age-old Sri Dasanjaneya Swamy (Chinna Anjaneya Swamy) Temple at Dasannapeta on the occasion of Hanumath Jayanti on Wednesday.","source":"THEHINDU","id":"79e6b3ba-5258-4d10-80fd-a1e967a798f9","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"BPO brings cheers to rural youths","link":"http://www.thehindu.com/news/national/andhra-pradesh/bpo-brings-cheers-to-rural-youths/article7203380.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"‘Local people can easily earn a minimum monthly pay after initial training’","date":"Wed May 13 19:22:30 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/13OGSMRHI-W004-_14_2405392f.jpg\" class=\"main-image\" alt=\"Employees at work at a rural BPO at Dubagunta near Kandukur in Prakasam district. -Photo: Kommuri Srinivas\" width=\"635\" height=\"467\" title=\"Employees at work at a rural BPO at Dubagunta near Kandukur in Prakasam district. -Photo: Kommuri Srinivas\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/13OGSMRHI-W004-_14_2405392f.jpg"},"content":"Fresh from college, rural youths used to migrate to cities and towns and join the ranks of unemployed in search of jobs even while pursuing crash courses. This is not the case with those in Dubagunta and surrounding villages in Kandukur division as they are now assured of a good placement in the expanding Business Processing Outsourcing (BPO) industry thanks to Prakasam Incubation Centre started by technocrat Kancharla Srikanth. Sd.Javid, one of the team leaders in the 200-seater rural BPO recalls that after completing B.Sc in Chemistry, he had been attending many number of interviews but failed to get a suitable job for his qualification in the past. “Now, I am happy working as a team leader in the BPO involved in voice processing for a leading telecommunication firm working from my village itself ”, he adds with a sense of satisfaction. Salima, an MBA graduate, joined the BPO a year ago. “Now I am confident of convincing any customer over the phone and solve their problems”, she says while overseeing a group of colleagues attending to customers complaints over phone at the rural BPO, an initiative of Prakasam Engineering College (PEC). “Earlier, we did not have any other option but to go to cities. Why should I work for the same salary elsewhere, when I can work from here itself ”, asks Ch. Anusha, a senior BPO staffer who hails from a remote Narasingolu village. Training Local people in the age group of 18 to 30 years easily earn a minimum monthly pay of Rs. 6,700 after initial training, explains Mr. Srikanth whose firm had also tied up with the Andhra Pradesh Skill Development Corporation to eradicate rural unemployment by imparting right skills for rural youths without migrating to far away cities. Most of youngsters who join the BPO belonged to BPL families, he adds. After working here, trained persons move out to seek better jobs in the BPO industry elsewhere making way for freshers, whose communication skills are honed from the start before they are absorbed as entry level assistants, adds Mr Srikanth, a post-graduate in Business Administration with a degree in Electrical and Electronics Engineering. “I am determined to create at least 4,000 jobs to rural youth in the area in the next few years and contribute to eradication of rural unemployment” adds Mr. Srikanth, whose firm has joined hands with the Association of Lady Entrepreneurs of Andhra Pradesh (ALEAP) to train women for suitable jobs in the garment industry. Students of the college also get an opportunity to earn while studying by working after college hours, adds PEC Correspondent K. Ramaiah.  I am determined to create at least 4,000 jobs for rural youth in the next few years and contribute to the eradication of rural unemployment Kancharla Srikanth Technocrat  Students of the college also get an opportunity to earn while studying by working after college hours K. Ramaiah PEC Correspondent","source":"THEHINDU","id":"9e6b939f-76d5-46ef-b016-cfd2a35dbe50","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Padma Bhushan to Shivakumara Swami","link":"http://www.thehindu.com/news/national/karnataka/padma-bhushan-to-shivakumara-swami/article7203410.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Additional Chief Secretary V. Umesh of the State government presented the Padma Bhushan to the seer of Siddaganga Mutt, Shivakumara Swami, on the mutt premises here on Wednesday.The seer cou...","date":"Wed May 13 19:19:52 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"Additional Chief Secretary V. Umesh of the State government presented the Padma Bhushan to the seer of Siddaganga Mutt, Shivakumara Swami, on the mutt premises here on Wednesday. The seer could not make it to the award-presentation ceremony on April 8 at the Rashtrapathi Bhavan in Delhi, so it was given to him at the mutt on behalf of the Union and State governments. After receiving the award, Dr. Shivakumara Swami said: “I had not aspired for this award.” He urged government officials and employees to work with sincerity and honesty, and to serve society selflessly.","source":"THEHINDU","id":"3f79648a-40f0-49c1-ad63-7437f56a9fab","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"PCB records high faecal coliform presence in Pampa","link":"http://www.thehindu.com/news/national/karnataka/pcb-records-high-faecal-coliform-presence-in-pampa/article7203412.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"Report submitted to government two months ago","date":"Wed May 13 19:19:42 GMT-05:00 2015","image":{"detail":"<img src=\"http://www.thehindu.com/multimedia/dynamic/02405/13ptkrk05-ecoli_14_2405395f.jpg\" class=\"main-image\" alt=\"The Kakkathode stream carrying filth into the Pampa from the Sabarimala Sannidhanam. The photograph was taken during the previous Makaravilakku season.— Photo: Leju Kamal\" width=\"636\" height=\"441\" title=\"The Kakkathode stream carrying filth into the Pampa from the Sabarimala Sannidhanam. The photograph was taken during the previous Makaravilakku season.— Photo: Leju Kamal\">","sort":"http://www.thehindu.com/multimedia/dynamic/02405/13ptkrk05-ecoli_14_2405395f.jpg"},"content":"The Pampa, which the Hindus consider as the holy Dakshin Ganga, recorded an all-time high level of pollution during the last Makaravilakku festival, thanks to the laxity of the authorities concerned in addressing the menace that has been plaguing the river for the last three decades. The daily water quality analysis by the Kerala State Pollution Control Board (PCB) during the festival days revealed certain scary facts. The count A PCB report submitted to the government two months ago showed that total coliform bacteria count and the faecal coliform count had reached 22,00,000 (22 lakh) most probable number (MPN) and 13,00,000 (13 lakh) MPN for every 100 ml respectively in the Njunangar, a tributary of the Pampa that originates from Sabarimala, on January 13. This is against the permissible limit of 500 MPN for every 100 ml for collective bathing. The samples taken from the intake point of the Kerala Water Authority’s drinking water supply station at Pampa also showed alarming presence of coliform. The PCB report says that the collection tank of free toilets near the Valiya Nadappanthal at the Sannidhanam was found overflowing. The entire filth thus reached the Pampa through the Kakkathode stream, leading it to the vicinity of the KWA intake well. The treated effluent at the sewage treatment plant at Pampa showed BOD exceeding the permissible limit. The packing inside the parallel plate separator of the sewage plant too was found collapsed due to overloading during the Makaravilakku festival. The State machinery and the Travancore Devaswom Board are yet to consider the PCB report and take steps to address the issue before the next pilgrim season beginning in November.","source":"THEHINDU","id":"c1a5069d-33d7-4c36-a0a6-d057159f7276","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"NHRC team leaves for Delhi","link":"http://www.thehindu.com/news/national/andhra-pradesh/nhrc-team-leaves-for-delhi/article7203425.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":": The team from National Human Rights Commission (NHRC) is learnt to have left for New Delhi on Wednesday afternoon after rounding off its probe into alleged ‘Seshachalam’ encounter.The NHRC...","date":"Wed May 13 19:02:27 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":": The team from National Human Rights Commission (NHRC) is learnt to have left for New Delhi on Wednesday afternoon after rounding off its probe into alleged ‘Seshachalam’ encounter. The NHRC team led by Senior Superintendent of Police Pupul Dutta Prasad arrived on a four-day assignment to seek details on the alleged encounter in Seshachalam forest, but left ahead of its schedule. The team met the police, forest and revenue officials regarding the incident and also recorded the version of the members of Red Sanders Anti-Smuggling Taskforce (RSASTF), who were part of the operation in which 20 woodcutters were gunned down on Apr 7. The team reached Chittoor on Tuesday to meet district Collector Siddharth Jain for getting his account of the incident. The team also tried to bring the print and electronic media personnel into its radar by questioning them as to how they got the news about the encounter and which channel ‘broke’ the news first. However, photographers and video journalists did not share the photographs and clippings taken during the encounter, as sought by the team, on the pretext that they had been deleted after use.","source":"THEHINDU","id":"37c5c921-4110-4462-8d46-68421727cbef","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Jagan to conclude yatra today","link":"http://www.thehindu.com/news/national/andhra-pradesh/jagan-to-conclude-yatra-today/article7203427.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"YSR Congress president and Leader of Opposition in Assembly Y.S. Jaganmohan Reddy on Wednesday visited the houses of three farmers who had committed suicide unable to bear the burden of debts....","date":"Wed May 13 19:02:27 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"YSR Congress president and Leader of Opposition in Assembly Y.S. Jaganmohan Reddy on Wednesday visited the houses of three farmers who had committed suicide unable to bear the burden of debts. Starting off the day with expressing solidarity to the striking APSRTC employees at the Gooty busstand, he moved on to the Gooty church where he offered prayers accompanied by former MP Ananta Venkatrami Reddy, party leaders Y Venkatrami Reddy and Sankar Narayana. .He consoled three families in the YT Cheruvu and Lachanapalli in villages of the Gooty mandal besides Gundala village of the Guntakal mandal. Mr. Jaganmohan Reddy is expected to visit a few more villages on Thursday in the Tadipatri and Singanamala mandals and meet the families of farmers who committed suicide, before winding up his tour.","source":"THEHINDU","id":"1ba5d93e-7ef9-4f1c-8545-495199c6ed2d","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"5.5 Lakh Individual Toilets to be Built in 110 Andhra Municipalities","link":"http://www.newindianexpress.com/nation/5.5-Lakh-Individual-Toilets-to-be-Built-in-110-Andhra-Municipalities/2015/05/14/article2813076.ece","description":"Municipal Administration Minister said that Andhra government plans to construct 5.5 lakh individual toilets in 110 municipalities for families.","date":"Wed May 13 15:13:08 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/Bio-Toilets.jpg/2014/10/07/article2466410.ece/alternates/w620/Bio-Toilets.jpg\" alt=\"Image for representation purposes only.\">","sort":"http://media.newindianexpress.com/Bio-Toilets.jpg/2014/10/07/article2466410.ece/alternates/w620/Bio-Toilets.jpg"},"content":"VISAKAPATTINAM: Andhra Pradesh Municipal Administration Minister P Narayana said here today that the state government plans to construct 5.5 lakh individual toilets in 110 municipalities in the state for families. The government also plans to involve Self Help Groups (SHGs) in construction of toilets as one more step towards women's empowerment. Interacting with women SHGs at the Andhra University Convocation Hall here today, Narayana said that besides toilets, the government also plans to entrust to SHGs the maintenance of 150 generic medical stores to be opened shortly in Andhra Pradesh to boost income of SHGs. The minister said that there were 38 lakh houses in 110 urban local bodies in AP, out of which 5.5 lakh families don't have toilets. In the first phase, the government plans to construct 2.5 lakh toilets by June 2015, he said. The government would supply raw material like cement, iron and others to SHGs and students of civil engineering colleges in the state, who would extend help to SHGs to construct toilets by June 2015. HRD Minister Ganta Srinivasa Rao that the government has allocated Rs 4,000 crore to be disbursed towards waiver of DWACRA loans.","source":"NEW INDIAN EXPRESS","id":"125a4b10-b4c1-4d8c-9f03-909575349f70","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Subscription scheme is missing link: AIADMK","link":"http://www.thehindu.com/news/national/jayalalithaa-acquittal-subscription-scheme-is-missing-link-says-aiadmk/article7202688.ece?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication","description":"The order has not included Rs. 13.5 crore raised through subscriptions","date":"Wed May 13 15:05:33 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://www.thehindu.com/template/1-0-1/gfx/logo.jpg"},"content":"As the Opposition mounted a strident campaign based on a “grave arithmetic error” in the Karnataka High Court judgment that acquitted former Chief Minister Jayalalithaa in the disproportionate assets case, the AIADMK side has come up with an explanation for the “miscalculation.” An AIADMK source said though the judgment had erred in computing the total loans treated as income of the accused, funds raised through a subscription scheme of Namadhu MGR, the party mouthpiece, were omitted. If this amount was added, the total amount of loan works out to over Rs. 24 crore. Opposition parties say the High Court had wrongly calculated the total loan amount as Rs. 24.17 crore, whereas the components mentioned in a table on Page 852 of the judgement added up to just Rs. 10.67 crore. As a result, the percentage of disproportionate assets to income would exceed 10 per cent, making the accused liable for conviction. “The order has not included about Rs. 13.5 crore of non-refundable deposits that Jaya Publications got from the subscription scheme. In our view, since the scheme had been accepted, this amount had to be treated as unsecured loan,” the source said on condition of anonymity. The judge, under the head “Jaya Publications and Namadhu MGR”, gives an income figure of Rs. 4 crore. This figure, according to the source, was the company’s income from other sources, without including the subscription scheme. “Even this Rs. 4 crore is a round figure, but the actual income was Rs. 4.18 crore.” 'Disproportionate assets below 10%' AIADMK sources say that if the Namadhu MGR subscription scheme was accepted as income from loans, the percentage of ‘disproportionate assets’ held by former Chief Minister Jayalalithaa and her associates would remain below 10 per cent. “The table of loans treated as income does contain an error, but this is not serious enough to change the outcome,” a party source said. However, on a reading of the judgment, it is not clear if the judge has accepted the subscription scheme in its entirety. The judge has noted the delay on the part of the company in filing the relevant income tax returns and said “it is a suspicious circumstance. ”    ","source":"THEHINDU","id":"877e3103-0cef-4d5f-8525-cbedbafd9404","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"TN Ministers Call on Jaya, Discuss Next Plan","link":"http://www.newindianexpress.com/states/tamil_nadu/TN-Ministers-Call-on-Jaya-Discuss-Next-Plan/2015/05/13/article2812573.ece","description":"Sources declined to say if a probable date had been decided for the swearing in of their party chief as Chief Minister.","date":"Wed May 13 11:27:46 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/jaya.jpg/2015/05/12/article2809883.ece/alternates/w620/jaya.jpg\" alt=\"Sources declined to say if a probable date had been decided for the swearing in of their party chief as Chief Minister | File photo\">","sort":"http://media.newindianexpress.com/jaya.jpg/2015/05/12/article2809883.ece/alternates/w620/jaya.jpg"},"content":"CHENNAI: Tamil Nadu Ministers, including Chief Minister O Panneerselvam, called on AIADMK chief Jayalalithaa at her residence here today and discussed about the party's next steps following her acquittal in a disproportionate assets case. Over 10 Ministers led by Panneerselvam called on Jayalalithaa at her Poes Garden residence and held talks for about half an hour, party sources said. The high-level meeting comes against the backdrop of heightened expectations among AIADMK party men that Jayalalithaa should return as Chief Minister soon. On the deliberations today, sources said AIADMK's next steps following the legal victory for party chief were discussed. However, sources declined to say if a probable date had been decided for the swearing in of their party chief as Chief Minister. Against the backdrop of demands by Tamil Nadu opposition parties to the Karnataka government to go for an appeal and get a stay on the ruling exonerating Jayalalithaa, the deliberations assume significance.","source":"NEW INDIAN EXPRESS","id":"f4e66dfb-b695-44fe-a54c-51336fa59460","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Pranab Mukherjee to Present Presidential Awards for Classical Tamil","link":"http://www.newindianexpress.com/states/tamil_nadu/Pranab-Mukherjee-to-Present-Presidential-Awards-for-Classical-Tamil/2015/05/13/article2812571.ece","description":"President Pranab Mukherjee will present \"Presidential Awards for Classical Tamil\" for the year 2011-12 and 2012-13.","date":"Wed May 13 11:24:51 GMT-05:00 2015","image":{"detail":"<img src=\"http://media.newindianexpress.com/Pranab-Mukherjee.jpg/2015/01/26/article2637234.ece/alternates/w620/Pranab%20Mukherjee.jpg\" alt=\"President Pranab Mukherjee | File Photo\">","sort":"http://media.newindianexpress.com/Pranab-Mukherjee.jpg/2015/01/26/article2637234.ece/alternates/w620/Pranab%20Mukherjee.jpg"},"content":"NEW DELHI: President Pranab Mukherjee will present \"Presidential Awards for Classical Tamil\" for the year 2011-12 and 2012-13 tomorrow. The awards for Classical Tamil were instituted to give recognition and honour to distinguished scholars who have made outstanding contribution to Classical Tamil language and literature. These awards include one \"Tholkappiar Award\" for life time achievement to an Indian scholar for outstanding contribution in the field of Tamil studies and two Kural Peedam Award for eminent scholars of Classical Tamil of non-Indian origin. Five \"Young Scholar Awards\" for scholars in the age group of 30-40 years for showing interest and excellence in Tamil studies with publications will also be presented with the award.","source":"NEW INDIAN EXPRESS","id":"a15b9011-b3df-459a-a875-5a68bd9a2d14","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Broadgauge Pollachi-Palakkad Broad Gauge Reaches Final Stage","link":"http://www.newindianexpress.com/states/tamil_nadu/Broadgauge-Pollachi-Palakkad-Broad-Gauge-Reaches-Final-Stage/2015/05/13/article2812553.ece","description":"Broadgauge Pollachi-Palakkad Broad Gauge Reaches Final Stage","date":"Wed May 13 10:52:53 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"COIMBATORE: The construction work of long pending broad gauge railway track between Palakkad and Pollachi, has reached its final stage. On commissioning of this line, direct broad gauge connectivity will be available between various southern towns of Tamil Nadu, like Pollachi, Palani, Madurai and Dindigul with Palakkad of Kerala. The track laying work has been completed, along with the work of platforms, station buildings, foot over bridges, level crossing gates and signal installations, a southern railway release said. Repeated inspections are being conducted to check the synchronized functioning of the system. With the help of trolleys and other Railway vehicles, the Railway Officials are conducting inspections in this section at random, it said.","source":"NEW INDIAN EXPRESS","id":"13d92df8-d76d-4e36-8c80-f4f4439ed021","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"PMK urges Karnataka government to obtain stay on Jayalalithaa's acquittal","link":"http://ibnlive.in.com/news/pmk-urges-karnataka-government-to-obtain-stay-on-jayalalithaas-acquittal/545458-37-64.html","description":"Pattali Makkal Katchi President GK Mani on Wednesday met Chief Minister Siddaramaiah and urged his government to initiate the appeal process and obtain a stay on Karnataka High Court's \"flawed\" judgement acquitting AIADMK supremo Jayalalithaa in the disproportionate assets case.","date":"Wed May 13 10:46:40 GMT-05:00 2015","image":{"detail":"<img src=\"http://static.ibnlive.in.com/ibnlive/pix/sitepix/03_2014/ls-polls-jayalalithaa-goes-all-guns-blazing-for-40-seats_220314013325.jpg\" width=\"669px\" title=\"PMK urges Karnataka government to obtain stay on Jayalalithaa's acquittal\" alt=\"PMK urges Karnataka government to obtain stay on Jayalalithaa's acquittal\">","sort":"http://static.ibnlive.in.com/ibnlive/pix/sitepix/03_2014/ls-polls-jayalalithaa-goes-all-guns-blazing-for-40-seats_220314013325.jpg"},"content":"Bengaluru: Pattali Makkal Katchi President GK Mani on Wednesday met Chief Minister Siddaramaiah and urged his government to initiate the appeal process and obtain a stay on Karnataka High Court's \"flawed\" judgement acquitting AIADMK supremo Jayalalithaa in the disproportionate assets case. \"Under the strength of this flawed judgement, Jayalalithaa will hurriedly be assuming the office of Chief Minister of Tamil Nadu. It will harm people of Tamil Nadu. It will also make a mockery of justice. I strongly believe that Karnataka government should immediately initiate the process and obtain stay of the order before any further damage is done to the justice,\" Mani said in Bengaluru. Mani claimed the high court verdict acquitting Jayalalithaa has \"glaring arithmetical error\" relating to her disproportionate assets. Mani claimed the high court verdict acquitting Jayalalithaa has \"glaring arithmetical error\" relating to her disproportionate assets. #j jayalalithaa #pattali makkal katchi #gk mani #aiadmk He said Jayalalithaa's total disproportionate assets was Rs 16.34 crore instead of Rs 2.82 crore as the High Court Judge CR Kumaraswamy has concluded. This amounts to around 76.75 per cent and not merely 8.12 per cent as concluded by the judge in his May 11 verdict allowing appeals by Jayalalithaa challenging the trial court order convicting her. He also said but for Special Public Prosecutor BV Acharya's hard work and excellent presentation, the case might not have reached the stage of conviction and punishment in the first instance itself, but all his efforts seems to have gone in vain following the acquittal.","source":"IBNLIVE","id":"6a04451f-7e2e-4ee9-9854-b262e3070faf","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"Over 40 Sri Lankan Tamil Refugees Go Back Home From Tamil Nadu","link":"http://www.newindianexpress.com/states/tamil_nadu/Over-40-Sri-Lankan-Tamil-Refugees-Go-Back-Home-From-Tamil-Nadu/2015/05/13/article2812545.ece","description":"Over 40 refugees left for Sri Lanka from Chennai, Tiruchirappali under the aegis of UN Refugee Agency, authorities said.","date":"Wed May 13 10:38:20 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"CHENNAI: Over 40 refugees today left for Sri Lanka from here and Tiruchirappali under the aegis of UN Refugee Agency, authorities said. Housed in camps spread across Tamil Nadu including Gumidipoondi near Chennai, 25 of them boarded a flight from the Chennai International Airport and the rest from Tiruchirappalli. The exact number of refugees who left for Sri Lanka from the central Tamil Nadu town of Tiruchirappalli could not be confirmed immediately though it was reported to be over 15. Airport authorities here said the voluntary repatriation was facilitated by the United Nations' Refugee Agency. Over one lakh Tamil refugees from Sri Lanka live in Tamil Nadu. Out of them about 65,000 live in 107 camps spread across the state.","source":"NEW INDIAN EXPRESS","id":"8282df75-9b5c-473e-88a8-c74510334461","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"},{"title":"39-year-old Brain Dead Woman Gives Life to Five Persons","link":"http://www.newindianexpress.com/states/kerala/39-year-old-Brain-Dead-Woman-Gives-Life-to-Five-Persons/2015/05/13/article2812539.ece","description":"A 39-year-old brain dead woman has given a fresh lease of life to five persons by donating her organs.","date":"Wed May 13 10:28:57 GMT-05:00 2015","image":{"detail":"SITE_LOGO","sort":"http://media.newindianexpress.com/main-logo.jpg/2015/02/02/article2648979.ece/binary/original/main-logo.jpg"},"content":"KOZHIKODE: A 39-year-old brain dead woman has given a fresh lease of life to five persons by donating her organs. One of the kidneys of Anitha was transplanted to a patient at Kozhikode Medical College Hospital here. Her second kidney and liver were transplanted to patients at Malabar Institute of Medical Science here (MIMS). Both eyes of the woman were donated to the eye bank of the medical college, a press release from MIMS said today. Anitha was hit by a motorcycle on May 11 when she was returning home from a ration shop at Kuruvangad. The woman, who had suffered head injuries, was taken to a nearby hospital and later to Kozhikode Medical College Hospital, from where again shifted to MIMS. She was declared brain dead at MIMS early this morning and her husband and relatives signed the willingness to donate all her organs.","source":"NEW INDIAN EXPRESS","id":"78f24f8d-0d12-4d81-bd42-32b7d37e7b93","category":"SOUTH_INDIA","order":null,"colorCode":"#1387D5","displayName":"SOUTH INDIA"}],"lastupdated":1431615610966,"category":"SOUTH_INDIA","refreshInt":5,"colorCode":"#1387D5","displayName":"SOUTH INDIA"}